[{"id":"f1247a16-a18c-4a95-a9c9-4125dfd89957","field2":"opening","subject":"開幕式","summary":"","type":"","room":"101","start":"2018-08-11T08:50:00+08:00","end":"2018-08-11T09:05:00+08:00","speaker":{"name":"Staff","bio":"COSCUP x GNOME.Asia x openSUSE.Asia Staff","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"411b3fbc-a604-4f2b-8b08-9844fbcef352","field2":"social-innovation","subject":"Open Source ・ Social Innovation","summary":" When we see “internet of things”, let’s make it an internet of beings.\nWhen we see “virtual reality”, let’s make it a shared reality.\nWhen we see “machine learning”, let’s make it collaborative learning.\nWhen we see “user experience”, let’s make it about human experience.\nWhen we hear “the singularity is near”, let us remember: the Plurality is here. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-social-innovation)","type":"","room":"101","start":"2018-08-11T09:05:00+08:00","end":"2018-08-11T09:20:00+08:00","speaker":{"name":"Audrey Tang","bio":"Audrey Tang, a civic hacker and Taiwan’s Digital Minister in charge of Social Entrepreneurship, is known for revitalizing global open source communities such as Perl and Haskell.\nIn the public sector, Audrey served on Taiwan national development council’s open data committee and K-12 curriculum committee; and led the country’s first e-Rulemaking project.\nIn the private sector, Audrey worked as a consultant with Apple on computational linguistics, with Oxford University Press on crowd lexicography, and with Socialtext on social interaction design.\nIn the social sector, Audrey actively contributes to Taiwan’s g0v (“gov-zero”), a vibrant community focusing on creating tools for the civil society, with the call to “fork the government”.","avatar":"https://coscup.org/2018-assets/img/speakers/s00045.jpg"}},{"id":"35d3e18a-a39f-4a31-80a4-12258220615a","field2":"bitrabbit-keynote","subject":"BitRabbit Hardcore 技術 Live：用 200 行 code 寫一個屬於自己的公有鏈","summary":" 區塊鏈技術圈一直對市場出現的各種公鏈性能、產品化以及商業型態所激烈討論，利用「他山之石」可否解決當下之痛，多數人也不得而知。無論是公有鏈、私有鏈還是聯盟鏈，其商業價值必須與產業問題所緊密結合，但區塊鏈又好像校園中的象牙塔，對大部分研發人員來說不知如何上手。BitRabbit Exchange 研究院總結交易所技術核心，以公有鏈開發框架 BaseChain 為基礎，與大家分享公鏈開發的奧秘。【Live：現場 200 行 code 寫公有鏈】\n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-bitrabbit-keynote) ","type":"","room":"101","start":"2018-08-11T09:20:00+08:00","end":"2018-08-11T09:50:00+08:00","speaker":{"name":"曹力","bio":"《JavaScript 高级程序设计》译者，糗事百科联合创始人、暴走漫画 CTO。阿里巴巴集團淘宝 P8 高级技术专家。现為 BitRabbit 比特兔交易所 CEO。","avatar":"https://coscup.org/2018-assets/img/speakers/s00087.jpg"}},{"id":"43b28372-caa4-41b1-97c4-deb0648d479d","field2":"tickets","subject":"基於區塊鏈上支援二手票卷交換的售票系統","summary":" 大家對二手票卷總是又愛又恨，但無論如何這樣的需求仍然存在。本演講將會探討如何使用 Ethereum ERC721 建立一個搭建在 Ethereum Blockchain 上支援二手票卷的售票系統。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-blockchain/%2Fcoscup18-blockchain-tickets) ","type":"","room":"302","start":"2018-08-11T10:00:00+08:00","end":"2018-08-11T10:25:00+08:00","speaker":{"name":"Yuren Ju (小朱)","bio":"開放源碼長工，2013 之前參與過數年的 COSCUP 籌備，近幾年也積極開發 g0v 的勞動相關專案，最新的興趣是區塊鏈。","avatar":"https://coscup.org/2018-assets/img/speakers/s00001.jpg"}},{"id":"eb6cff4e-ab2f-4874-bef6-dd8a9706a113","field2":"what-we-are-exciting-about-mysql-8.0","subject":"What we are exciting about MySQL 8.0","summary":" The session will show you features and improvements from MySQL 8.0, and what issues those features are going to solve, I will cover the following topics in this session:\n. How DBA can be benefit from MySQL 8.0 by:\n  . ACID data dictionary\n  . Information schema improvement\n  . Solution of hot row lock\n  . Cost model improvement\n  . Improve join performance by histogram\n  . Descending index\n  . Role and security enhancement\n  . Persistent options\n  . Resource Group\n. How developer can be benefit from MySQL 8.0\n  . JSON and XDev API\n  . GIS improvement\n  . CTE (Common Table Expressions)\n  . Window functions\n  . UUID functions\n  . utfi8mb4 as default character set\nI will also will show you MySQL road map in the near future. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-database/%2Fcoscup18-database-what-we-are-exciting-about-mysql-8.0)","type":"","room":"501","start":"2018-08-11T10:00:00+08:00","end":"2018-08-11T10:40:00+08:00","speaker":{"name":"梶山隆輔 (Kajiyama Ryusuke)","bio":"Ryusuke Kajiyama is Open Source Specialist with 10+ years of experience of systems design using MySQL and open source solutions. He originally joined MySQL AB, and is currently managing MySQL Sales Consultant team of Asia Pacific region at Oracle.\nPrior to join MySQL, he was Consultant at Nomura Research Institute, working on enterprise systems design with Oracle Database, WebLogic, Solaris, and various Open Source software including MySQL, JBoss and Linux. He is a Co-Founder of Japan JBoss Users Group","avatar":"https://coscup.org/2018-assets/img/speakers/s00085.jpg"}},{"id":"4ce5ea99-8b80-4325-8ea1-9fbb3b490a5f","field2":"supporting-miracast-on-the-gnome-desktop","subject":"Supporting Miracast on the GNOME Desktop","summary":" Miracast is a standard to stream video and audio through WiFi connections to TVs and other displays. The most popular streaming solutions, Apple Airplay and Chromecast, are closed source implementations which do not integrate reliably with Free software. With Miraclecast, we have an open source solution which could receive a stream from all of your Linux devices. For example, it can be used to stream a video over WiFi to a Raspberry Pi. We are working on solving the sender side issue and a solution that allows casting to a Miracast device easily from the GNOME Desktop. In this talk, we will discuss the current status of the integration and the required changes in the underlying system components. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome301-supporting-miracast-on-the-gnome-desktop)","type":"","room":"301","start":"2018-08-11T10:00:00+08:00","end":"2018-08-11T10:45:00+08:00","speaker":{"name":"Benjamin Berg","bio":"Benjamin is an electrical engineer who has is involved with GNOME helping on various parts of the desktop and also organising the 2016 GNOME Conference GUADEC. Currently he is working on hardware enablement at Red Hat in the Desktop Team.","avatar":"https://coscup.org/2018-assets/img/speakers/gnomeasiasummit.jpg"}},{"id":"e124a989-8259-4a97-a948-9d68aadfb5cf","field2":"cjk-issues-of-floss","subject":"Support to Korean language on GNOME and CJK Issues of FLOSS","summary":" In South Korea(Republic of Korea), Korean open source users experience that lack of Korean language support in FLOSS(Free/Libre Open Source Software).\n\nAlso, Due to the complexity of CJKV character input (Chinese, Japanese, Korean, and Vietnamese), CJKV Information Processing and Localizations are challenging tasks.\n\nUnfortunately, FLOSS Developers & Contributors from outside East Asia(such as CJKV) don't know about the language expression & features. also They don't know about many of needs from Local users to improve CJKV localication.\n\nSo far I will introduce how Korean open source developers & contributors & community is supporting Korean Language on Free/Libre Open Source Software in South Korea.\nI’ll talk about how to proceeding with Korean  Input Method Engine related issues in some Korean communities(such as GNOME Korea, KDE Korea, Ubuntu Korea, LibreOffice Korea, etc)\n\nThe Korean language (Hangul[한글]: 한국말/조선말/한국어/조선어; Hanja[한자/ 漢字]: 韓國말/ 朝鮮말/ 韓國語 / 朝鮮語) is an East Asian language spoken by about 80 million people.\nIt is the official and national language of both Koreas: the Democratic People's Republic of Korea (North Korea) and the Republic of Korea (South Korea), with different standardized official forms used in each territory. It is also one of the two official languages in the Yanbian Korean Autonomous Prefecture(연변 조선족 자치주/ 延邊朝鮮族自治州) and Changbai Korean Autonomous County(장백 조선족 자치현/ 長白朝鮮族自治縣) of the People's Republic of China[中華人民共和國, Mainland China]. Also It uses in Japan, Uzbekistan, Russia[It reads “Корё мар” in Russian], Kazakhstan, Kyrgyzstan, etc\nAlso, Korean language uses Chinese characters(漢字). It says “Sino-Korean vocabulary” or “한자어(漢字語 / Hanja-eo)” in Korean.  It is similar to  Japanese Kanji[漢字かんじ].\nSo on FLOSS, you have to consider both Chinese and Japanese as well as Korean and vice versa.\n\nI will also show the difference of Korean language in South Korea and North Korea.\n\nI’ll talk about CJK issues in GNOME, LibreOffice, etc, based on Korean Language. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome306-cjk-issues-of-floss)","type":"","room":"306","start":"2018-08-11T10:00:00+08:00","end":"2018-08-11T10:45:00+08:00","speaker":{"name":"DaeHyun Sung (성대현, 成大鉉)","bio":"DaeHyun Sung (성대현, 成大鉉)\nI'm a Korean Software developer in Seoul, Republic of Korea. My mother tongue's Korean (한국어). I'm also a GNOME Foundation Member & LibreOffice Contributor. I'm interested in Open Source related things (Development, Translation, Contribution, Communities), East Asian Languages (such as Korean dialects, Japanese, Chinese, Manchu, Mongolian, etc), East Asian cultural sphere. My hobby is learning Languages such as English, Japanese (日本語), Mandarin Chinese (華語, 漢語 / 汉语), etc","avatar":"https://coscup.org/2018-assets/img/speakers/s00041.jpg"}},{"id":"172f513a-2b0f-41f4-9d8d-f48aa0294079","field2":"multistakeholers-model","subject":"多元利害關係人模式解決網路治理議題之機會與挑戰 (The opportunities and challenges of solving Internet Governance issues by MultiStakeholers Model)","summary":" 網路已深入經濟、科技及社會等領域之發展，如何在實體世界與網路世界快速相互融合環境下，對網路衍伸之複雜議題，提供有效的創新解決機制，是建立數位國家良好治理 (good governance) 的先決條件。因此在網路治理議題層出不窮時，要兼顧網路安全 vs 隱私保護、言論自由 vs 保護公共秩序的同時，又要能快速取得各種利害關係人間的政策平衡(Policy balancing)，將持續面臨激烈挑戰。本報告嚐試思考有效的多元利害關係人模式是否是可能的解決方案。預計包括下列內容:\n1.\tScope of Internet Governance Issues \n2.\tCommon mechanisms of MultiStakeholders Model(MSM) \n(Stakeholder identification, common goals, governance structure, conflict type, social power, …)\n3.\tHow to make MSM more effective\n(Transform mindsets, work with power, deal with conflict, promote collaborative leadership, foster participatory learning…..)\n4.\tExamples of applying MSM on IG issues\n-\tICANN/IETF \n-\tUN IGF/APRIGF/TWIGF\n-\tvTaiwan\n-\tothers\n5.\tMSM’s opportunities and challenges \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-governance/%2Fcoscup18-governance-multistakeholers-model)","type":"","room":"502","start":"2018-08-11T10:00:00+08:00","end":"2018-08-11T10:40:00+08:00","speaker":{"name":"Vincent Chen/陳文生","bio":"1. 前 TWNIC 執行長 /.tw Country Manger\n2. 教育部電算中心副主任(官)\n3. 國立高雄第一科技大學資管系所長、電算中心主任、教務長等(學)\n4. 哈瑪星科技 (軟體公司) 總經理(產)\n早期創建及耕耘 BITNET、TANet 等學術網路建設（教育部），具公民草根意識，協助創立 TWNIC（第一任執行長）、擔任. tw Manager 及參與國際網路社群。隨後轉至大學資訊管理領域及軟體公司服務，並持續學習多元包容之網路治理政策。現任 NII 執行長","avatar":"https://coscup.org/2018-assets/img/speakers/s00084.jpg"}},{"id":"d9b54ced-2d85-446f-ab9b-66476a09ba82","field2":"introduction-to-julia","subject":"Introduction to Julia","summary":" Julia 是個新興的數值計算程式語言，他擁有 C 語言一般的執行速度，也有 Python 動態語言般的簡潔語法，這使得他成為科學運算以及資料分析領域再適合不過的工具。我會介紹 Julia 的基本語法及概念，並且舉例它的使用場景，歡迎大家來認識這個新傢伙。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-julia/%2Fcoscup18-julia-introduction-to-julia) ","type":"","room":"308","start":"2018-08-11T10:00:00+08:00","end":"2018-08-11T10:50:00+08:00","speaker":{"name":"杜岳華","bio":"是個熱愛生物、電腦科學跟數學的傢伙。目標是成為生物資料科學家！國立陽明大學生物醫學資訊所碩士，專業是計算生物學、系統生物學及機器學習。","avatar":"https://coscup.org/2018-assets/img/speakers/s00114.jpg"}},{"id":"98509e03-49d7-4b07-8de7-097394a70fb3","field2":"modern-network-servers","subject":"Modern network servers","summary":" While the Intel x86-64 architecture is undisputedly market leader in the \nserver space, several vendors have started introducing ARM64 boards. \nThis presentation examines the suitability of ARM64 server boards for \nnetwork servers. In particular, we look at the workload of a \nmoderate-size ccTLD DNS zone (.dk) and how it would perform on ARM64 \nrunning FreeBSD.\n\nWe consider the viability of the ARM64 platform from performance and \nperformance/power perspectives. While ARM64 is definitely slower than \nIntel on many workloads, it performs at least as well or better than \nIntel on workloads that are interesting to the internet community. \nNotably DNS is a very appropriate workload for ARM64. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-kernel/%2Fcoscup18-kernel-modern-network-servers)","type":"","room":"202","start":"2018-08-11T10:00:00+08:00","end":"2018-08-11T10:40:00+08:00","speaker":{"name":"Philip Paeps","bio":"Philip Paeps is an independent consultant and contractor based in \nBelgium. He provides research and development on low-level software and \noperating systems, particularly in an embedded or real-time context.\n\nHis main interests are bootloaders, device drivers and high-performance \nnetworking. He can also be convinced to teach courses and workshops on a \nvariety of networking-related topics.\n\nIn his so-called free time, Philip is a FreeBSD committer contributing \nmainly to the kernel and a member of the FreeBSD security team. He was \none of the main organisers of FOSDEM, the largest annual open source \nsoftware conference in Europe, from the early 2000s until 2015. He \ndenies having any involvement with amateur radio or tabletop role \nplaying games.","avatar":"https://coscup.org/2018-assets/img/speakers/s00017.jpg"}},{"id":"1e6b5031-3e3e-4717-bd95-95bfba6228ac","field2":"product-retro","subject":"新創產品 - 驗屍報告","summary":" 從技術的角度，探討資料的擷取與分析，進而得知市場需求。從產品死亡的經歷，做錯產品的人，像是吸毒一樣，迷幻在自己的世界，最後死去... \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-product-retro) ","type":"","room":"101","start":"2018-08-11T10:00:00+08:00","end":"2018-08-11T10:30:00+08:00","speaker":{"name":"CIH","bio":"深曉台灣與山林之美，步行環台 55 天 1200 公里，用眼睛錄下台灣之美。享受探險的箇中樂趣。\n專長用戶行為 / 市場分析、資料的探勘與解析。","avatar":"https://coscup.org/2018-assets/img/speakers/s00042.jpg"}},{"id":"5c61be3b-2ca8-40a0-abb6-d0c2a4d78467","field2":"why-get-involved","subject":"Why should you get involved in open source?","summary":"Are you new to the open source community? Or you are not even sure if it could be something for you? I will tell you how I started as an open source contributor and what from my experience makes open source and openSUSE such as interesting option.\n\nI will provide some tips to give your first steps in the open source world. In this line, I will speak about mentoring programs, focusing on GSoC (Google Summer of Code), in which openSUSE participates and in which I personally have participated as a student, mentor and organisation admin. I will explain what this program is about and why it is important for openSUSE. I will show projects from last years and for everybody interested in participating I will cover who can apply and how to do so. Last but not least, I'll present examples of ideal projects to start contributing to, both inside and outside openSUSE. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-why-get-involved)","type":"","room":"201","start":"2018-08-11T10:00:00+08:00","end":"2018-08-11T10:30:00+08:00","speaker":{"name":"Ana María Martínez Gómez","bio":"Ana started at openSUSE as a Google Summer of Code student. She\nstudied Computer Science Engineering and Mathematics at university and\njust after finishing she started working at SUSE in the OBS frontend\nteam. She contributes to several open source projects inside and\noutside openSUSE. When she is not hacking you may find her painting,\ncooking or learning some German.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"3fdf7647-fc10-4249-bd72-0c21a9c3f596","field2":"opensuse-tumbleweed","subject":"Working and Contributing to Open Source Project via Grphic Design in openSUSE Tumbleweed","summary":" Working (in the field of graphic design) with open source applications is sometimes still a scary thing. This is because the use of proprietary products on the market is quite dominant. This often makes non mainstream applications such as Inkscape, Gimp, Krita, Synfig, etc. which incidentally is open source application underestimated. In fact, these applications are highly qualified and powerful to meet the needs of graphic design both general and specific. \r\nIn this session, I will describe my experiences during using these applications to create designs in openSUSE. In addition, I will also tell you about the design community in Indonesia that has been fully using open source applications as the main application to create graphic design work. This community is named Gimpscape ID. \r\nFinally, I will describe what I have done to contribute to an open source project through this graphic design. Hopefully after this session, users of open source design applications are more confident and willing to contribute as well. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-opensuse-tumbleweed)","type":"","room":"304","start":"2018-08-11T10:00:00+08:00","end":"2018-08-11T10:30:00+08:00","speaker":{"name":"Ahmad Romadhon Hidayatullah a.k.a Rania Amina","bio":"","avatar":"https://coscup.org/2018-assets/img/speakers/gnomeasiasummit.jpg"}},{"id":"699d7b15-0f40-4275-af0d-9aa472c9d8a6","field2":"opencrops","subject":"OpenCrops - 開放作物資料庫","summary":" 農業的起始來自種子及土壤；而農業資訊化之基礎即爲作物資料庫。作物資料庫爲什麼需要開放？爲什麼需要群眾參與來建立資料庫？我們希望爲作物建立生長環境數據、病蟲害訊息、圖片庫等，以利資料鏈結與分析。藉由栽培資料分析、優化，與其他軟硬體的智慧搭配，希望能爲糧食生產與環境的改善，盡一點心力。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-osfarm/%2Fcoscup18-osfarm-opencrops) ","type":"","room":"305","start":"2018-08-11T10:00:00+08:00","end":"2018-08-11T10:30:00+08:00","speaker":{"name":"陳幸延","bio":"半碼半農的生活，希望科學與資訊能夠落實到生活中，爲生活帶來實用的改善；並希望發揮自由軟體的精神，可以使社會合作關係更進步。","avatar":"https://coscup.org/2018-assets/img/speakers/s00080.jpg"}},{"id":"f9b1158a-df0c-4bc6-b018-a4bf0d080ff1","field2":"connect-upstream-to-downstream","subject":"讓開源雲端與產品接軌: Take the Advantage and connect upstream to downstream","summary":" 提供經驗分享，關於如何正確的與雲端（OpenStack/K8S）社群接軌，利用社群力量注入雲端產品或實際雲端環境。\n通常玩雲端科技相關的開源，都是有實際開發需求或是建構雲端需求。\n從開發者角度加上產品開發者角度，如何讓自己接收開源並且讓融入社群。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-sdn/%2Fcoscup18-sdn-connect-upstream-to-downstream) ","type":"","room":"401","start":"2018-08-11T10:00:00+08:00","end":"2018-08-11T10:40:00+08:00","speaker":{"name":"Rico Lin","bio":"OpenStack heat project team leader, Put a lot of effort on Cloud integration(OpenStack + K8S) and Cloud Application, Work @ EasyStack,","avatar":"https://coscup.org/2018-assets/img/speakers/s00014.jpg"}},{"id":"99c00372-d32c-4525-8122-2776ff19e5da","field2":"viper","subject":"開源軟體考古 - 以 Viper 為例","summary":" 想成為優秀開發者，大量閱讀開源專案程式碼是必要的。本演講將分享講者閱讀開源專案時所發展與實踐之方法及技巧。內容包含降低專案複雜度、修改 module dependency 追 code 工具、專案統計數據分析、深度與廣度走訪專案程式碼。此內容已於 pycontw 2017 年演講過，當時內容僅涵蓋「開放原始碼專案原始碼追蹤分析『心得經驗』分享」。此次投稿，將新增「開放原始碼專案原始碼追蹤分析『相關輔助工具』(tig, git-timemachine) 的介紹」，以及橫 \\ 縱向專案走訪心得。希望能將自己歸納之系統性追 code 方法分享給大家。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-source/%2Fcoscup18-source-viper)","type":"","room":"503","start":"2018-08-11T10:00:00+08:00","end":"2018-08-11T10:30:00+08:00","speaker":{"name":"陳坤裕 KunYu Chen / 鄧宇翔 Yu Shiang Deng","bio":"Software Archaeologist. Love to dig into the history of software.\n---\n現就學於國立高雄科技大學電腦通訊工程系電腦組學士，也是同一學校的準碩士生。曾參與許多學校資訊安全計畫以及軟體專案競賽，目前主要研究系統分析設計和資訊安全領域。","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"5ada6aeb-e98f-4194-a156-05d20c84761a","field2":"ethereum-tokens","subject":"Ethereum Tokens - 新手終極指南","summary":" 寫給 Dapp 新手的 Ethereum Token 終極指南，從最基礎的 ERC-20 標準，一路介紹到 ERC-223, ERC-677, ERC-777, ERC-721, ERC-821, ERC-865 等，以及各式實作與實際用法。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-blockchain/%2Fcoscup18-blockchain-ethereum-tokens)","type":"","room":"302","start":"2018-08-11T10:25:00+08:00","end":"2018-08-11T10:50:00+08:00","speaker":{"name":"陳耀鑫","bio":"CTO & Co-founder of SOLA","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"58e39570-f1f5-4b3a-a308-8442594a6e82","field2":"next-input-method-framework","subject":"What is necessary for the next input method framework","summary":" Input method framework is a software that has been used to input complex characters (e.g., Chinese characters, Hiragana, Hangul). Strictly speaking, the role of input method framework is bridging desktop applications and input method engines, which translate typed keys into complex characters. During this two decades, several input method frameworks including Kinput2, SCIM, UIM, Gcin, Fcitx, and IBus have been developed.\n\nThe situation surrounding text input method is changing. Firstly, new approaches such as software keyboard for touch screen and speech to text input are available on platforms other than Linux desktop.\n\nAnother change is the integration of input method into desktop application platforms. For example, IBus is now a part of GNOME desktop environment; Not only GNOME, Qt also include IBus support. Furthermore, Flatpack also uses a subset of IBus D-Bus interface for applications in Flatpack sandbox to communicate with an input method running on its host desktop.\n\nSome people might think IBus is the defacto standard input method framework. However, quite many people prefer Fcitx or else due to the design issues of IBus. The latter people might think they are losing their freedom to select input method framework.\n\nNow the speaker thinks that it is time to discuss the variety of input method frameworks is really necessary for the future Linux desktop environment. An input method framework itself does not provide much experience for users because its primary role is usually invisible to users. Thereby, how about bringing the war of input method framework and using our effort to improve input method engine, implementing the new approaches mentioned above, and supporting newer application platforms like Wayland?\n\nIn this talk, we would like to discuss what is necessary for the future input method framework by reviewing the design issues of IBus. The topics will be as the followings:\n\n- Thin and high-level protocol with libraries avoiding code duplication \n- The separation of responsibility between IBus daemon and plugins \n- Importance of opened community\n\nNote that the speaker is neither a developer of IBus nor GNOME. The attendees from GNOME community are welcome to improve this discussion. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-next-input-method-framework)","type":"","room":"201","start":"2018-08-11T10:30:00+08:00","end":"2018-08-11T11:00:00+08:00","speaker":{"name":"Fuminobu TAKEYAMA","bio":"A package maintainer of the openSUSE M17N project since 2011. Developing packages\nrelated to input methods (e.g., IBus and Mozc) and Japanese fonts. As a member of\nJapan openSUSE User Group, organizing meetups, having seminars at OSS events, and\npublishing Geeko Magazine. openSUSE.Asia Summit 2017 Committee Chair.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"7392079d-0038-46ec-a6e4-490679a04f04","field2":"single-sign-on-services","subject":"Single Sign On Services with Free/Open Source Software at Universitas Indonesia - Updating to CAS 5","summary":" In this talk, i will deliver and share my experience as part of engineering team who build and maintain Single Sign On Services (SSO) using F/OSS. This talk is continuation from my paper on OpenSuse Asia 2017. Universitas Indonesia (UI) has been using F/OSS solution to deliver Single Sign On Infrastructure since 2011. We are using JASIG CAS (currently called Apereo CAS - https://github.com/apereo/cas - ) as our SSO engine. We use CAS to integrate multiple authentication sources to a centralized IDP from our internal apps and services from external vendor. We use CAS for our infrastructure services, network authentication, apps authentication and even Google Apps authentication. Our implementation is still based on CAS 3, and it began to slightly out of date to current auth protocol standard. In this talk, i will share our experiences on CAS update process to latest CAS 5.x to cope with current authentication standard and security enhancement. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-single-sign-on-services)","type":"","room":"304","start":"2018-08-11T10:30:00+08:00","end":"2018-08-11T11:00:00+08:00","speaker":{"name":"Tonny Adhi Sabastian","bio":"","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"07d67de7-bde6-421d-ba9a-caecdacb89a3","field2":"language-server-protocol-explained","subject":"language server protocol explained","summary":" Language server protocol (LSP) is a protocol for both programming languages and text editors. This session introduces what kind of features LSP offers and how it can be implemented on the IDEs and possibly languages. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-source/%2Fcoscup18-source-language-server-protocol-explained) ","type":"","room":"503","start":"2018-08-11T10:30:00+08:00","end":"2018-08-11T11:00:00+08:00","speaker":{"name":"Atsushi Eno","bio":"Mono/Xamarin developer in Asia","avatar":"https://coscup.org/2018-assets/img/speakers/s00046.jpg"}},{"id":"3514d871-65c4-4072-886d-6d03b03e9e09","field2":"oyster","subject":"蚵媽的育兒經","summary":" 隨著氣候變遷與環境的改變，近年來養殖牡蠣的數量愈來愈少，\n嚴重影響在地蚵農的生計，如何提升牡蠣的經濟價值成為值得思考的議題，\n透過這個議程跟大家分享過去一年來研究牡蠣生長的一些心得與經驗分享。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-osfarm/%2Fcoscup18-osfarm-oyster) ","type":"","room":"305","start":"2018-08-11T10:35:00+08:00","end":"2018-08-11T11:05:00+08:00","speaker":{"name":"陳于艾","bio":"","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"b667ee53-f920-47a4-90ec-81b746c348e3","field2":"os-panel","subject":"跨界 X 開源 對談","summary":" 主持：Mosky Liu\n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-os-panel) ","type":"","room":"101","start":"2018-08-11T10:40:00+08:00","end":"2018-08-11T12:20:00+08:00","speaker":{"name":"林強 / 卓致遠 / 陳顯立 / 吳漢章 / 蔣鐙緯 / Knight 乃特大","bio":"\n---\n\n---\n\n---\n\n---\n\n---\n","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"ab2b8534-9fc5-48f5-a091-c170ad35a635","field2":"mysql-8-what's-new-in-innodb","subject":"MySQL 8.0: What's new in InnoDB","summary":" MySQL just announced the 8.0 GA in Apr, 2018, this is a very impressive release which will bring quite a lot of new and good features to all users. For example, new data dictionary, enhanced DDL, descending index, partial update JSON, dedicated server, new in-memory storage engine, etc. At the meantime, MySQL has improved the performance significantly in the 8.0 GA release, such as the re-design of redo log. As we know, InnoDB is the main and most important storage engine which is supported officially. By diving into InnoDB, we can know better about how these new features and improvements are implemented, what users should pay attention to, how users can run 8.0 server in a better way. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-database/%2Fcoscup18-database-mysql-8-what's-new-in-innodb)","type":"","room":"501","start":"2018-08-11T10:45:00+08:00","end":"2018-08-11T11:25:00+08:00","speaker":{"name":"苏斌(Su Bin)","bio":"I have been working on database field since 2005. I'm now a principle software engineer in Oracle / MySQL / InnoDB. I have developed several features for InnoDB. The latest is on data dictionary and DDL related work.","avatar":"https://coscup.org/2018-assets/img/speakers/s00102.jpg"}},{"id":"70071b4b-e67f-4599-be80-cb5c8a0e3323","field2":"onnc","subject":"ONNC - Open Neural Network Compiler","summary":" Hundreds of AI chips are releasing in the near future, the latest figures indicate 34 IC and IP vendors will provide various AI chips and deep learning accelerator (DLA) ASICs in 2018. These all reflect the urgent need for an open compiler to support different AI chips.\n\nWe foresaw the trend and developed the compiler ONNC. Based on ONNX, ONNC is an efficient way to connect all current AI chips, especially DLA ASICs, with ONNX.\n\nOpen Neural Network Exchange Format (ONNX) is a standard for representing deep learning models that enables models to be transferred between frameworks. We introduce ONNC that supports ONNX format and mainstream AI frameworks such as Caffe and Tensorflow. ONNC’s dominant advantage to current AI frameworks is that it provides direct support to DLA ASIC chips by ability to describe variants of performance cost models of hardware and by general optimization passes. DLA ASIC vendors can reuse these optimization passes by describing its special performance cost model in ONNC. ONNX and ONNC together help DLA ASIC vendors support various AI frameworks within a short time, improves DLA’s performance and shortens developing schedule. \n\nONNX aims to guarantee `interoperatability` for all tools, and ONNC further guarantees `executability` for all devices. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-kernel/%2Fcoscup18-kernel-onnc)","type":"","room":"202","start":"2018-08-11T10:45:00+08:00","end":"2018-08-11T11:25:00+08:00","speaker":{"name":"Luba Tang","bio":"Luba Tang received his M.S. degree in computer science in only one year from the National Tsing-Hua University, Taiwan. He has been a Ph.D student in computer science department of National Tsing-Hua University, Taiwan since 2007. At the same time, he has been working in the compiler groups in Marvell, Inc. and MediaTek, Inc. since 2010. His research interests include both eletronic system level (ESL) design and compilers. He had focussed on iterative compiler, ahead-of-time compiler, link-time optimization, electronic system level simulation, and electronic system level design. His most recent work focus is on dynamic lnking and link-time optimization. He was the chief programmer of Starfish DSP simulator, the original writer of Marvell iterative compiler, and the software architect of MCLinker and the founder of Skymizer Inc..","avatar":"https://coscup.org/2018-assets/img/speakers/s00134.jpg"}},{"id":"1f476c8b-3ba0-4a94-bc59-559366819e42","field2":"sdn-5g","subject":"雲端技術及 SDN 如何改變行動網路帶動 5G 技術發展","summary":" 在行動網路的變遷中, 如何讓用戶體驗更加良好, 電信商的成本減少, 應付接下來工業 4.0 及車聯網, 物聯網技術的靈活部署應用, 等等... 都是 5G 行動網路中需要關心的技術問題, 在整個行動網路的軟體趨勢中, 如何應用雲端技術及 SDN 技術達成上述所需要的目標都是軟體開發者關心的一環, 本次演講題目讓大家能夠以電信商, 營運商, 行動用戶的各個角度了解到 Cloud Native, SDN 在 5G 行動網路中如何解決大家的問題並帶動 5G 發展. 從需求, 技術, 解法, 應用各項層面帶大家進入 5G 的神祕世界~ \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-sdn/%2Fcoscup18-sdn-sdn-5g)","type":"","room":"401","start":"2018-08-11T10:45:00+08:00","end":"2018-08-11T11:10:00+08:00","speaker":{"name":"陳建豪 Jian-Hao Chen","bio":"小弟我畢業於交通大學電資所, 主要研究方向為 SDN, 且熱愛行動網路技術及雲端軟體技術, 本身在 ONF M-CORD project 中開發約 2 年, 目前為 ONF Ambassador 並任職於工研院從事 MEC Solution 相關開發工作.","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"9d95dac3-d2eb-417f-8def-4a2516b35611","field2":"internet-gov-issue","subject":"生活裡處處可見的網路治理議題","summary":" 分享近年參與台灣網路治理論壇的經驗，並討論生活裡常遇到的相關議題，並與大家交流個資與隱私保護或其他與網路治理相關的討論。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-governance/%2Fcoscup18-governance-internet-gov-issue) ","type":"","room":"502","start":"2018-08-11T10:50:00+08:00","end":"2018-08-11T11:00:00+08:00","speaker":{"name":"陳映竹","bio":"台灣經濟研究院助理研究員、TWNIC 國際事務委員。參與過 Open Data 倡議社群，從開放（政府）資料、智慧城市、物聯網應用相關議題的收集，近幾年沉迷在網路治理與區塊鏈議題上。","avatar":"https://coscup.org/2018-assets/img/speakers/s00078.jpg"}},{"id":"2c071eb2-9e99-4b79-a065-cc3e602a8a45","field2":"ethereum-transaction","subject":"Life Cycle of An Ethereum Transaction","summary":" 交易 (Transaction) 是組成區塊 (Block) 的最小單位。在以太坊 Ethereum 中，使用者可以透過像是 Metamask 以及 Myetherwallet 這類的軟體錢包或是運行一個以太坊的節點來送出交易。從使用者送出一筆交易到真正的被放進區塊中間需要經過層層的關卡才能完成甚至因為參數的設定導致交易失敗。以 go-ethereum 為例子來介紹一筆交易的生命週期，包含交易是怎麼被生成，何謂交易參數，如何被驗證，如何廣播到其他節點以及應該給多少手續費才會被礦工接受並且放到區塊。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-blockchain/%2Fcoscup18-blockchain-ethereum-transaction) ","type":"","room":"302","start":"2018-08-11T11:00:00+08:00","end":"2018-08-11T11:25:00+08:00","speaker":{"name":"陳岱鈴","bio":"AMIS 軟體工程師，致力於區塊鏈核心技術的開發","avatar":"https://coscup.org/2018-assets/img/speakers/s00081.jpg"}},{"id":"ead12222-1935-49e6-983c-53d1ae4c74b5","field2":"desktop-applications","subject":"Desktop applications: life inside a sandbox","summary":" It is now simple to build and run a desktop application inside a sandbox, using systems such as flatpak, to isolate it from the rest of the system. This talk will discuss current advances in sandboxing for desktop applications, including an overview of how the sandbox is created, the restrictions it imposes, and the technologies used to make existence in a sandbox seamless (including portals and services such as PipeWire). \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome301-desktop-applications)","type":"","room":"301","start":"2018-08-11T11:00:00+08:00","end":"2018-08-11T11:45:00+08:00","speaker":{"name":"David King","bio":"David has been a GNOME contributor for many years, and maintains the Cheese and Logs projects, as well as cotributing to several others. He works for Red Hat in the desktop team, contributing upstream to GNOME and core technologies such as dbus.","avatar":"https://coscup.org/2018-assets/img/speakers/gnomeasiasummit.jpg"}},{"id":"10125dfb-8fe1-4b0e-b4a3-e98b4d782294","field2":"hong-kongyears","subject":"What does GNOME.Asia bring to Hong Kong and Asia community ?my experience in 7 years","summary":" A success GNOME.Asia Summit 2012 in Hong Kong gives me a confidence, to establish  open source conferences in Hong Kong for both local and international.\n\nWhat did I try ?\nWhat are difficulties ?\nWhat are success and failure purposes ?\nWhat are current issues ? and ideas to resolve them in the future. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome306-hong-kongyears)","type":"","room":"306","start":"2018-08-11T11:00:00+08:00","end":"2018-08-11T11:45:00+08:00","speaker":{"name":"Sammy Fung","bio":"Sammy is python developer working on web scraping, data and web applications, he shows his passions in open source community for 20 years. He is organiser of GNOME.Asia Summit 2012 in Hong Kong, and then he establishes Hong Kong Open Source Conference in 2013 and PyCon Hong Kong in 2015. His Twitter is @sammyfung","avatar":"https://coscup.org/2018-assets/img/speakers/s00012.jpg"}},{"id":"a0c216d1-e655-47a9-9e1a-c3d65f435987","field2":"duckietown","subject":"小鴨城 (Duckietown)，一個基於 Raspberry Pi 和 ROS 的開源無人小車專案介紹","summary":" 小鴨城 (Duckietown)，來自於 MIT 的課程，目前在交通大學(NCTU) 有課程分支。這是一個開源的電腦視覺自走車學習專案，車上唯一的感測器就是相機。\n從這專案中我們可以學習到感測器校正、計算機視覺、物體辨識和分散式協調等。並實際搭建 Duckiebot 平台、建立機器人體系(ROS)，使用 Python + OpenCV 用電腦視覺實現單系統機器人車道跟隨(lane following)。使用的硬體包括 Raspberry Pi、雙層三輪小車、馬達控制板和最重要的魚眼相機等。\n我們將分享專案的技術細節、實做上會遇到的問題與相關學習資源，希望有更多人能加入並擴充專案內容。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc307-duckietown) ","type":"","room":"307","start":"2018-08-11T11:00:00+08:00","end":"2018-08-11T11:40:00+08:00","speaker":{"name":"sosorry","bio":"Hi, I'm sosorry","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"49f367e3-e74e-4c07-b2b5-f35e6fb5431a","field2":"llvm","subject":"llvm::SmallVector","summary":" Introduction to the llvm SmallVector \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-source/%2Fcoscup18-source-llvm) ","type":"","room":"503","start":"2018-08-11T11:00:00+08:00","end":"2018-08-11T11:30:00+08:00","speaker":{"name":"Yun-Wei Lee","bio":"Master student in NCTU","avatar":"https://coscup.org/2018-assets/img/speakers/s00002.jpg"}},{"id":"417ff92e-5e8b-4a4b-9129-5ea40640ac6f","field2":"oss-dns","subject":"從 Open Source Software DNS 談開放式網路架構下之網路治理","summary":" BIND (Berkeley Internet Name Domain, BIND)屬開源軟體，可讓使用者在網際網路上發布網域名稱系統（Domain Name System, DNS）信息，並為網路使用者解析 DNS 之查詢。BIND 起源於 20 世紀 80 年代初的加州大學伯克萊分校，是迄今全球網際網路上使用最為廣泛的 DNS 開源軟體，提供了一個強大而穩定的平台，並藉由這個平台，組織可以建立分散式計算系統，並使這些系統能完全符合 DNS 標準。\n\n基於全球網際網路開放式之架構與自由開放標準之全球網路互連原則，開源軟體在網路發展的歷史中扮演極為重要之角色。而架構與組成網路互連中最重要的 IP 及域名政策制定與技術協定，即以多方利害關係人 (Multistakeholder Model) 模式進行全球網路治理。\n\n美國商務部所屬之國家電信與資訊管理局（National Telecommunications and Information Administration, NTIA）於 2016 年 9 月 30 日與 ICANN 合約到期後，宣布以多方利益 (Multistakeholder) 的網路治理方式移交網際網路號碼分配的監督權 (IANA Functions)，並以多方利害關係人的網路治理方式，將原有的治理權力，在符合多方利害關係人的治理模式：以維護網域名稱系統(DNS) 安全性、穩定性及可快速回復；維護網域名稱系統 (DNS) 的安全性、穩定性及可快速回復及其開放性；滿足全球消費者的需要與期望已完成 IANA 功能之移轉。\n\n因此，目前全球網際網路唯一標識指稱 (Internet’s unique identifiers) 的協調和管理現在已經實現了私有化，並由多方利害關係人之全球社群進行網路治理。 \n\n本場次之 Workshop 規劃將從全球開放式網路架構下，從技術、政策與多方利害關係人之網路治理模式探討自由、開放與協同管理之網路基本精神與原則。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-governance/%2Fcoscup18-governance-oss-dns)","type":"","room":"502","start":"2018-08-11T11:10:00+08:00","end":"2018-08-11T11:50:00+08:00","speaker":{"name":"Vincent Chen/陳文生 / 鄧惟中 / 張心玲","bio":"1. 前 TWNIC 執行長 /.tw Country Manger\n2. 教育部電算中心副主任(官)\n3. 國立高雄第一科技大學資管系所長、電算中心主任、教務長等(學)\n4. 哈瑪星科技 (軟體公司) 總經理(產)\n早期創建及耕耘 BITNET、TANet 等學術網路建設（教育部），具公民草根意識，協助創立 TWNIC（第一任執行長）、擔任. tw Manager 及參與國際網路社群。隨後轉至大學資訊管理領域及軟體公司服務，並持續學習多元包容之網路治理政策。現任 NII 執行長\n---\n現職及相關經歷\nl   2017 年 3 月迄今 東京大學台灣校友會理事兼秘書長\nl   2017 年 1 月迄今 消費者文教基金會副董事長\nl   2014 年 2 月迄今台灣科技大學資訊工程系副教授\nl   2012 年 11 月至 2014 年 10 月消費者報導雜誌社社長\nl   2010 年 11 月迄今 消費者文教基金會董事\nl   2003 年 8 月至 2014 年 1 月台灣科技大學資訊工程系助理教授\nl   2002 年 4 月至 2003 年 6 月 碩琦科技研發技術處經理\nl   2002 年 3 月 東京大學大學院情報理工學系研究科特任研究員\n研究領域\nl   Network Security\nl   Network Time Synchronization\nl   Virtual Reality\n\n---\n現職\nl   神盾股份有限公司 副總經理\nl   法務部開放資料諮詢小組 委員\nl   TWNIC 國際事務委員會 委員\nl   FIDO Alliance, Representative of Board\nl   中央研究員資創中心 TWISC 計畫顧問\nl   TWCERT/CC(中科院資通所)顧問\nl   Asia FIDO-PKI 技術整合工作組 召集人\nl   台灣資通產業標準協會工作組 組長\nl   亞洲 PKI 聯盟商業案例應用工作組 主席\n\n經歷\nl   行政院科技會報辦公室科技前瞻組 副主任\nl   資策會資安所政策研究中心 組長\n\n著重領域\nl   Open Data 等資料應用、資安領域、國際合作推動與執行\nl   曾任跨國資安計畫 International Collaboration for Advanced Security Technology(iCAST)辦公室主任，連結美國加州柏克萊大學、卡內基美隆大學，與國內各大學、法人、中研院與國防部共同合作\nl   深度參與國際組織，規劃推動各項策略工作，活絡國內外產政學領域與國際組織合作\nl   於 2015 年以 APKIC 工作組加入國際標準組織 FIDO Alliance，2017 年於台灣資通產業標準協會成立「FIDO-PKI 整合工作組」，結合國際外資源共同投入國際標準合作與文件產出，2018 年成功發展 FIDP APKIC Joint White Paper，為國內參與國際標準組織之重要指標 / 案例","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"f0d08b33-c78c-4398-8f72-30e0629e0cf3","field2":"foreign-function-call-in-julia","subject":"Foreign Function Call in Julia","summary":" 介紹 Julia 在與其他語言進行 foreign function call 的相關議題。Julia 的 stdlib 在對 C 以及 Fortran 的 function call，有相當方便的整合了。而對其他語言如，Python、R、Matlab 也有第三方套件來協助。將會在這個 talk 介紹這些 ecosystem。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-julia/%2Fcoscup18-julia-foreign-function-call-in-julia) ","type":"","room":"308","start":"2018-08-11T11:10:00+08:00","end":"2018-08-11T12:00:00+08:00","speaker":{"name":"林峻頤 (Iblis Lin)","bio":"Julia 與 FreeBSD 的愛好者","avatar":"https://coscup.org/2018-assets/img/speakers/s00144.jpg"}},{"id":"020521c1-5535-4a60-a049-796f1a54de42","field2":"weather-bot","subject":"Let's build a weather bot","summary":" Introduce how I build a weather bot, which is a cross platform chat bot that can answer any question about weather. The lecture will cover chat bot platform introduction, chat bot framework, chat bot design, weather data processing, system architecture, etc. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-osfarm/%2Fcoscup18-osfarm-weather-bot)","type":"","room":"305","start":"2018-08-11T11:10:00+08:00","end":"2018-08-11T11:40:00+08:00","speaker":{"name":"劉安齊","bio":"軟體工程師。以 ＠tigercosmos 活躍於網路世界。喜歡分享程式開發知識，著有多篇技術文，並經營有「微中子」科技分享臉書粉專。喜歡開源，參加多項開源專案，並熱衷貢獻。目前著重研究與開發網路瀏覽器。喜歡分享軟體開發經驗與教人寫程式。","avatar":"https://coscup.org/2018-assets/img/speakers/s00058.jpg"}},{"id":"e8406c5d-c3bd-4897-a301-e3177c3f7dd7","field2":"leap-to-enterprise","subject":"Simplistic Migration from Leap to Enterprise","summary":" openSUSE has released a new distribution Leap 15 on openSUSE Conference 2018. openSUSE Leap 15 shares a common core with SUSE Linux Enterprise (SLE) 15 sources and has thousands of community packages on top to meet the needs of professional and semi-professional users and their workloads. \nFor the first time, SUSE will support migration from Leap to SLE, which gives system integrator developing on Leap the possibility of moving to an enterprise version for certifications, mass deployments and/or extended Long Term Support. openSUSE Leap 15 brings plenty of community packages built on top of a core from SUSE Linux Enterprise (SLE) 15 sources, which is the first time the two major releases were built from the beginning in parallel. \nAs a tester of this new feature, I wish I could communicate with you about this feature, and share with you how to perform the migration from Leap to SLE on openSUSE.Asia Summit.\n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-leap-to-enterprise)","type":"","room":"201","start":"2018-08-11T11:15:00+08:00","end":"2018-08-11T11:30:00+08:00","speaker":{"name":"Chenzi Cao","bio":"QA Engineer from SUSE","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"3a3c5b0e-d5bf-44c2-a82c-2adec9fac68a","field2":"nusantara-metode-input","subject":"Nusantara Metode Input at OpenSUSE","summary":" Aksara Nusantara is a variety of script or writing that is used in the archipelago to specifically write a particular regional language. Although the Arabic alphabet and Latin alphabet are also often used to write regional languages, the term Aksara Nusantara is often associated with the letters of inculturation of Indian culture. Various kinds of writing media and stationery are used to write the script of the archipelago. Writing media for inscriptions include stone, wood, animal horns, gold plates, silver plates, copper temples, and bronze plates; writing made with chiseled stationery. Writing media for manuscripts include palm leaves, nipah leaf, coconut leaf, bamboo blades, bark, local paper, imported paper, and fabrics; writing made with stationery in the form of a knife or a pen and ink. \nAksara Nusantara is a unicode script located on the cluster of islands in Indonesia, Java, sunda, rejang, bugis, balinese which is the legacy of tribal characters in indonesia. \nhere I present how to write with Java input method, bali input methodist, rejang input metode, bugis input methode, batak input mothode at operating system Open Suse. \nUnicode archipelago is a project developed by indonesian developers who are now in suspended animation, for that in this event hopefully can revive the archipelago unicode, so as can be an inheritance and can be used in education. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-nusantara-metode-input)","type":"","room":"304","start":"2018-08-11T11:15:00+08:00","end":"2018-08-11T11:30:00+08:00","speaker":{"name":"Rahman Yusri Aftian","bio":"I belong to those who step out of line education, hobbies take me to\nthe field of IT, however I managedto bring BlankOn Linux Release 6-8,\nwhich is Code name Ombilin, Pattimura, Rote. This was my penchantfor\nbringing me to fall into the field of IT, and struggling in their\ndaily lives.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"86fdfd30-f0d7-4e44-a9d8-56b73156e771","field2":"locust-to-go","subject":" Locust to Go, Kubernetes to Load","summary":" Locust is an open source load testing tool written in Python.\nIt let us define user behavior using Python, and swarm your system with millions of simultaneous users.\nFor simulating millions of users, Locust offers slave mode to control foreign executable using ZeroMQ. This feature admit us to implement bots, with any programming language support ZeroMQ.\nWe build our game services using Go language, so we reuse some Go code to implement bots. We run our game services on dockers managed by Google Kubernetes, we try to DDoS our game services using dockers managed by Google Kubernetes, too. Finally we tweaked a reliable game service which is able to handle huge amount of users.\nThis talk will share what is Locust, how to implement Locust slave, and how to do load test using Locust and Google Kubenetes. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-sdn/%2Fcoscup18-sdn-locust-to-go)","type":"","room":"401","start":"2018-08-11T11:15:00+08:00","end":"2018-08-11T11:40:00+08:00","speaker":{"name":"郭學聰 (Heush-Tsung Kuo)","bio":"* programmer from Rayark, a game company in Taiwan\n* backend engineer\n* usually develop something related to my work in Python, Ruby, Golang, C#\n* built almost entire VOEZ game server by myself only\n* support Sdorica backend development","avatar":"https://coscup.org/2018-assets/img/speakers/s00146.jpg"}},{"id":"15149702-f799-42ae-9b2a-2801db207553","field2":"build-an-etherscan-service","subject":"Build an Etherscan service","summary":" In this sharing, I will introduce the required APIs in Etherscan service, list some possible solutions, and compare those pros and cons. After that, illustrate our current design and future works. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-blockchain/%2Fcoscup18-blockchain-build-an-etherscan-service)","type":"","room":"302","start":"2018-08-11T11:25:00+08:00","end":"2018-08-11T11:50:00+08:00","speaker":{"name":"Mark Lin","bio":"Blockchain developer in AMIS","avatar":"https://coscup.org/2018-assets/img/speakers/s00025.jpg"}},{"id":"e8d29bf6-2ad6-4599-a23b-2ae235eec537","field2":"nodejs-mysql-8.0","subject":"Writing a NodeJS Application with Flexible Schema [JSON and Relational Database] The Power of MySQL 8.0","summary":" JSON document usage is widely used in data exchange or storage.  Flexible schema by mixing JSON document and relational data in MySQL database  provides the X-over capability allowing the development of next generation application with the extension to the existing operational data from relational database.    The session shares the insight of using JSON document with Relational Database in MySQL 8.0 by creating a NodeJS Booking Application using expressJS framework.   We will show you the highly interested X-over XDevAPI in using the Collection and JSON document.  Join us to see the Power of MySQL 8.0 in Document Store features! \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-database/%2Fcoscup18-database-nodejs-mysql-8.0) ","type":"","room":"501","start":"2018-08-11T11:30:00+08:00","end":"2018-08-11T12:10:00+08:00","speaker":{"name":"Ivan Ma","bio":"\n\nIvan Ma is the MySQL User Group Lead in Hong Kong. He has over 20+ years of experience in enterprise system infrastructure and software technologies. He has certification on MySQL DBA 5.6, MySQL Developer 5.1 and MySQL Cluster 5.1 DBA.\n\nHe Joined MySQL, is currently MySQL Principal Sales Consultant, Asia Pacific with Oracle, responsible for pre-sales consulting, technical education, and product promotions.\n\nPrior to joining MySQL team, he joined Oracle in System Team from Sun Mircosystems acquisition. Prior to Sun Microsystems, he was Principal Solution Architect with Sybase APAC covering APAC regions.","avatar":"https://coscup.org/2018-assets/img/speakers/s00033.jpg"}},{"id":"3871dc13-f39b-4879-a863-fd17a568f90d","field2":"how-qemu-works","subject":"From Binary to Binary : How Qemu Works","summary":" Qemu 是一個模擬不同 Instruction Set 很好用的工具，鑑於網路上對於 Qemu 的教學都非常的分散，本議程將整理講者研究 Dynamic Binary Translation (DBT) 的心得，並分享 Qemu 如何實作該技術。此議程將帶領聽眾入門 Dynamic Binary Translation，並涵蓋如何 Translate Binary to QEMU TCG-IR、Compile TCG-IR to another ISA on host machine、Handle block chaining、Emulate behavior of source program (e.g. code execution, handle trap, interrupt, system call, etc)。\n\n** 不會涵蓋 Full System Emulation ** \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-kernel/%2Fcoscup18-kernel-how-qemu-works)","type":"","room":"202","start":"2018-08-11T11:30:00+08:00","end":"2018-08-11T12:10:00+08:00","speaker":{"name":"魏禛 / 林致民","bio":"兩隻正在 Computer Architecture, Compiler Optimization 與 Dynamic Binary Translation 領域玩沙打水的菸酒生\n---","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"46c86265-aaa0-40a2-a78a-ea7948c56183","field2":"efi-key","subject":"EFI key","summary":" The EFI boot services variable can only be accessed by signed EFI execution when secure boot is enabled by user. We can use the mechanism to store a random number in boot services variable as a root key. The root key can be sused to encrypt and authenticate other keys in key retention service in Linux kernel. It can be a new key type.\n\nThis talk introduces the EFI key: \n- EFI key: \n- A new master key type to key retention service. \n- It can be a new option beyond trusted key(TPM) and user key. \n- ERK (EFI Root Key) \n- EFI stub generates a random key and stores in EFI boot services variable. \n- The ERK is secure when secure boot enabled. \n- User must aware and enable secure boot by themself if they want. \n- ERK can be a secret to encrypt a random number for generate a EFI key \n- The EFI key can be used by hibernation encryption/authentication. \n- The EFI key can be a master key to generate a encrypted key for EVM. \n- Rescue mechanism for ERK. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-efi-key) ","type":"","room":"201","start":"2018-08-11T11:30:00+08:00","end":"2018-08-11T12:00:00+08:00","speaker":{"name":"Joey Lee","bio":"Joey Lee, SUSE Labs Engineer in Taipei office. He is working on ACPI, EFI, Secure Boot,\nHibernate Signature Verification.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"4bd35641-37b7-485d-9849-2fb01bf44cf8","field2":"building-private-opensuse-cloud","subject":"Building Tiny Private openSUSE Cloud","summary":" Recently, public clouds are getting to a majority of \ninfrastructures. For example, using containers, Docker, Kubernetes, \nWeb applications, etc. Of course, public clouds are very convenient \nbecause they are very easy to use and cheap comparing to using \nphysical machines. However, it's sometimes a bit boring for some \npeople who want to know/manage the whole of the things such as physical network, \nstorage, machines, etc. And also, an experience of building a tiny \ncloud with physical machines could be a very good opportunity to \nunderstand computer technologies. Moreover, it's fun for such people \nlike me.\n\nI had built a my own tiny private cloud with openSUSE and OpenStack on \nmy own physical machines. And I'm now using it for some of purposes \nsuch as evaluating new Linux distributions, containers, Kubernetes, \netc. I had allocated the budget around only 50k JPY (500USD) for \nbuilding it. It's quite a cheap to build a *cloud* system, actually. \nHowever, it can be done with open source software and some tricks.\n\nIn this talk, attendees will get to know about the *tiny private \ncloud* how to build, issues/challenges, benefit and the potential \ncapabilities of openSUSE. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-building-private-opensuse-cloud)","type":"","room":"304","start":"2018-08-11T11:30:00+08:00","end":"2018-08-11T12:00:00+08:00","speaker":{"name":"Masayuki Igawa","bio":"Masayuki Igawa is a software engineer for over 15 years on a wide range\nof software projects, and developing open source software related to\nLinux kernel and virtualization. He's been an active technical\ncontributor to OpenStack for years. He is also an OpenStack Tempest,\nsubunit2sql, openstack-health core member in mostly Quality Assurance\narea. He currently works for SUSE's OpenStack Quality Engineering team\nto make the open source software better both side of upstream and\ndownstream. He has previously been a speaker at OpenStack Summits,\nLinuxCons Japan, FOSSAsia, Linux.conf.au, OpenStack Days Tokyo, July\nTech Festa, Open Source Developers Conference, SUSECon and openSUSE.Asia\nSummit.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"4d0344c1-a339-40ba-b7a7-56b0834555ad","field2":"shell","subject":"看懂源碼基礎 - 批次檔除錯及排版工具","summary":" Linux 的 Shell 組成批次檔可以很簡單，也可以很複雜，如何寫出較不易出錯批次檔，如何將雜亂的批次檔排整齊 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-source/%2Fcoscup18-source-shell) ","type":"","room":"503","start":"2018-08-11T11:30:00+08:00","end":"2018-08-11T12:00:00+08:00","speaker":{"name":"Daniel Lin 林原志","bio":"* 1992 年開始使用 Xenix shell\n* 寫過最長 shell script 約 2000 多行\n* 2005 開始使用 Arch Linux\n* 2013 開發 sh4twbox 幫網樂通建置 Arch Linux 套件","avatar":"https://coscup.org/2018-assets/img/speakers/s00104.jpg"}},{"id":"357a7a4a-dba1-4cf4-9278-bd8e6698066d","field2":"the-year-of-the-gnome","subject":"The Year of the GNOME","summary":" This talk would isabout all the cool new things happening within GNOME, like our move to GitLab, the policies we changed, the donations we are receiving, and the growth we are planning for. GNOME is trying to do more to support community members around the world, and this talk aims to share how we are doing that and how you can start to participate in GNOME's growth this year and in years to come! \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome301-the-year-of-the-gnome)","type":"","room":"301","start":"2018-08-11T11:45:00+08:00","end":"2018-08-11T12:30:00+08:00","speaker":{"name":"Nuritzi Sanchez","bio":"Nuritzi has served two terms as the elected Chairman of the Board for the GNOME Foundation. She is a core member of the GNOME Engagement team, and the founder of GNOME SF, a meetup group in San Francisco, California. In her professional life, Nuritzi has helped start two companies, including most recently, Endless, whose mission is to make computing universally accessible by making an operating system that is designed for the next billion users and based on GNOME.","avatar":"https://coscup.org/2018-assets/img/speakers/s00018.jpg"}},{"id":"04061f0a-72b1-4fc9-a409-2364529172de","field2":"weather-api","subject":"現代氣象資料處理之技術","summary":" 農業與氣象密不可分，傳統以來農民人手一本葵花寶典 (農民曆)，到現代氣象資料的進步人手一台智慧裝置，\n如何從「工人智慧」進化到「人工智慧」，介紹氣象預報系統、資料處理技術、\n天氣風險公司今年開發的氣象 Graph API，以及串接氣象資料後的實務分享。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-osfarm/%2Fcoscup18-osfarm-weather-api) ","type":"","room":"305","start":"2018-08-11T11:45:00+08:00","end":"2018-08-11T12:15:00+08:00","speaker":{"name":"謝孟格","bio":"擔任天氣風險公司的天氣暨資料分析師，同時是 Yahoo 一分鐘報氣象主播，\n其他時間都在跟氣象資料打鬥或玩耍、Data Mining，\n有時參與 R-Ladies Taipei 社群活動。","avatar":"https://coscup.org/2018-assets/img/speakers/s00051.jpg"}},{"id":"4f9ffb65-5598-469a-ab1f-b5adf63f33b0","field2":"onf-intern","subject":"開放網路基金會實習經驗談","summary":" 本演講中，講者會帶大家了解如何專注於提供開放原始碼的非營利組織的運作模式，以及其組織是如何維護以及開發數套開放原始碼專案，並分享在矽谷的所見所聞。\n \n講者去年在美國 Open Networking Foundation, ONF 擔任實習生，同時也是 ONF 大使成員之一。專注於 ONF 主要的計畫（ONOS, CORD），協助開發新功能與修正軟體問題。目前已經是 ONOS 計畫中多套模組的負責人（Module Owner）。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-sdn/%2Fcoscup18-sdn-onf-intern)","type":"","room":"401","start":"2018-08-11T11:45:00+08:00","end":"2018-08-11T12:10:00+08:00","speaker":{"name":"Takeshi","bio":"最近從交大畢業，先前的研究領域著重於 SDN 相關應用，但在求學時期一直找不到目標，於是決定休學跑到美國去實習一年。","avatar":"https://coscup.org/2018-assets/img/speakers/s00006.jpg"}},{"id":"71930105-8fc2-4000-8b44-f1529b88032b","field2":"remote-debug","subject":"全平台前端遠程調試的那些事 —— 遠程頁面調試工具的實現及剖析","summary":" 前端世界還遠未統一，各種 PC 端和移動端瀏覽器的各種不兼容折磨著前端開發人員，調試非本地的項目，特別是移動端項目成為一個大難題。本議程將剖析調試遠程頁面和應用的方方面面——查看修改頁面樣式、收集控制台日志、發送並執行 JS 代碼、監控所有網絡請求、嗅探遠程設備的特征及功能、監控頁面性能指標等等。本議程希望給苦於各類手機瀏覽器不兼容導致調試困難的開發人員一些思路和啟迪。其中包含：1. 現狀分析及比特兔的實踐；2. 關鍵點實現展示；3. 對未來的暢想。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc307-remote-debug) ","type":"","room":"307","start":"2018-08-11T11:50:00+08:00","end":"2018-08-11T12:30:00+08:00","speaker":{"name":"徐曉孟","bio":"徐曉孟，全棧工程師，曾任職於阿裏巴巴集團螞蟻金服技術專家，現任 BitRabbit 比特兔交易所共同創辦人暨前端研發總監。主要業務範圍包括前端業務、數據分析及用戶體驗分析。","avatar":"https://coscup.org/2018-assets/img/speakers/s00140.jpg"}},{"id":"b818ebdf-03ea-4895-84d4-b4b129ed534c","field2":"transparent","subject":"讓透明成為義務：在 2018 台灣網路透明報告之後","summary":" 2013 年，Edward Snowden 揭露了美國國安局大型的網路監控計畫後，世界各地興起了一股消費者／公民運動，紛紛要求企業或政府應主動揭露其網路監控與審查的流程與統計資訊。也因此從 2013 年至今，全世界已有近 70 家的企業主動定期發佈透明報告，也有數個政府受公民社會或學術社群要求，而持續在揭露相關資訊。\n\n在台灣，雖然至今還未有任何本土企業主動發佈透明報告。但自 2014 年 9 月起，台灣人權促進會發起了台灣網路透明報告，透過政府資訊公開法，要求台灣政府揭露資訊；這個計畫至 2018 年 4 月為止，已發行了兩次報告。而在 2018 年的第二次報告中，台灣政府雖然仍有不少單位無法提供完整的資訊，但整體而言，所揭露的資訊已比前一次大量且可信許多，更重要的是，幾個政府單位也同時揭露了不少其請求發送的本土企業，這從而使後續的在私部門的著力成為可能。\n\n因此，在這個 40 分鐘的工作坊中，除簡單介紹台灣網路透明報告及其在 2018 年的一些發現外，主要將會聚焦討論以下幾點：\n\n1. 政府現有的資訊揭露項目或廣度是否足夠？又該如何改善？\n2. 如何要求被政府指名的相關本土企業定期製作並公布透明報告？\n3. 目前已累積了兩次報告的資訊，未來如無意外，資訊也將被持續揭露，是否可能將這些資料以 Open Data 的方式釋出？又該如何進行？ \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-governance/%2Fcoscup18-governance-transparent) ","type":"","room":"502","start":"2018-08-11T12:00:00+08:00","end":"2018-08-11T12:40:00+08:00","speaker":{"name":"何明諠（Ho Ming-Syuan)","bio":"何明諠是台灣人權促進會的專案經理，主要負責台灣網路透明報告。此外，他同時也在台權會中協助倡議隱私與言論自由的議題，例如通訊監察、數位身份、開放資料及巨量資料與隱私、健康資料、以及網路中介者責任等。\n\nHo Ming-Syuan is the project manager at Taiwan Association for Human Rights(TAHR), and mainly responsible for the Taiwan Internet Transparency Report. He also advocates the issues regarding privacy and freedom of expression for TAHR, such as \"communication surveillance\", \"digital identity\", \"open data, big data and privacy\", \"health data\", and \"intermediary liability\".","avatar":"https://coscup.org/2018-assets/img/speakers/s00123.jpg"}},{"id":"87fa9bf0-6f56-4558-a340-9f2befaf0245","field2":"ethereum-casper-ffg-contract","subject":"Ethereum Casper FFG Contract","summary":" Casper FFG 是以太坊權益證明共識演算法之一。其中核心的程式碼是只有一頁的智慧合約撰寫而成。在這個短講中會提到在 2018 年這個程式碼的演進流程，以及怎麼樣透過修改合約內容，讓客戶端少寫許多程式碼 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-source/%2Fcoscup18-source-ethereum-casper-ffg-contract) ","type":"","room":"503","start":"2018-08-11T12:00:00+08:00","end":"2018-08-11T12:30:00+08:00","speaker":{"name":"梁智程","bio":"Taipei Ethereum Meetup 共同組織者，Ethereum Casper FFG 維護者","avatar":"https://coscup.org/2018-assets/img/speakers/s00086.jpg"}},{"id":"563580b8-7847-4ed5-aba8-62ed409fbc27","field2":"llvm-risc-v","subject":"30 個 patch 教你學會 LLVM 編譯器後端移植：以 RISC-V 為例","summary":" LLVM 是一個十分模組化的編譯器系統，提供了自有的中間表示式，我們可以輕易地在 LLVM 新增一個指令集架構。RISC-V 則是目前最火紅的開放指令集架構，各式各樣的 toolchain 與 OS 都正在如火如荼的移植中，當然 LLVM 也不例外，以 30 個 patch 為基礎教你如何移植 RISC-V 到 LLVM 後端，不只是 Compiler，其中還會包含一些有關 Assembler、Disassembler 和 Linker 的基本知識，帶著大家一路從 LLVM 中間表示式到最終生成 binary 檔，一步一步揭開編譯器神秘的面紗。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-kernel/%2Fcoscup18-kernel-llvm-risc-v) ","type":"","room":"202","start":"2018-08-11T12:15:00+08:00","end":"2018-08-11T12:55:00+08:00","speaker":{"name":"林宗俊","bio":"編譯器打雜工人","avatar":"https://coscup.org/2018-assets/img/speakers/s00109.jpg"}},{"id":"62900fa7-f734-4fb6-a560-47fb90936f73","field2":"yoyodiy","subject":"yoyodiy 如何繞過系統，自建一套 local k8s cluster","summary":" 透過 docker edge 快速部署一套 k8s cluster，讓前端開發更輕鬆\n，不用跟其他人共用 server。若發現後端有什麼問題，api 想改就改，database 想清就清，甚至可以在無網路環境下運行前後端 server。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-sdn/%2Fcoscup18-sdn-yoyodiy) ","type":"","room":"401","start":"2018-08-11T12:15:00+08:00","end":"2018-08-11T12:40:00+08:00","speaker":{"name":"yoyo","bio":"從 Linxu Kernel 一路浮上來的前端工程師","avatar":"https://coscup.org/2018-assets/img/speakers/s00004.jpg"}},{"id":"b96fde1d-0f3e-49be-bc5a-a7cc1df3093d","field2":"python-ast","subject":"有效清理 Python Code 中的無用部份 - 利用 Python AST","summary":" 不管是 open source 專案還是工作上，經過長時間開發累積，source code 內可能會殘留許多不再需要的 code，造成維護以及 refactor 的困難，也造成新手 trace code 時的障礙。\n對 C/C++ 這類編譯式語言來說，開啟編譯器最佳化能自動清除 dead code，但對於 Python 這類動態語言，則沒有公認完美的方法。\n本議程分享一些相關經驗，佐以利用 Python AST 的簡易自製工具，討論如何從較複雜的 python source tree 中，安全的清除不再需要的 code。\n\n* https://github.com/PCMan/python-find-unused-func \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-source/%2Fcoscup18-source-python-ast) ","type":"","room":"503","start":"2018-08-11T12:30:00+08:00","end":"2018-08-11T13:00:00+08:00","speaker":{"name":"洪任諭 (PCMan)","bio":"職業:\n* Senior System Engineer at Appier Inc.\n* 前台北榮民總醫院風濕免疫科醫師\n\n學歷:\n* 台大資工所碩士\n* 陽明大學醫學系\n\n主要 Open source 經歷:\n* LXDE/LXQt 桌面環境主要開發者\n* PCMan BBS 連線軟體系列","avatar":"https://coscup.org/2018-assets/img/speakers/s00098.jpg"}},{"id":"4b673c08-5c90-40f0-8286-e44f2c31db3c","field2":"idcard","subject":"晶片身分證：資訊公開下的隱私風險","summary":" 台灣的身份制度落實在人民生活的每一角落，舉凡教育、交通、金融、社福、健康等，幾乎都仰賴身份制度的運作。而靠著配發給所有人民獨一無二的身分證號碼，政府雖維持了其一定的行政效率，卻也使人民的活動及生活細節陷入可能遭政府高度控管的風險中。\n\n而在人民生活更多仰賴數位活動的同時，自 2015 年起，政府再次開始構思將過往的紙本身分證，全面更換為晶片身份證的可能；而內政部亦在 2018 年 5 月於立法院公開指出，將於 2019 年初全面換發晶片身分證。然而問題是，針對這類智慧卡或數位身份的機制，隱私始終是最大的顧慮。在數位足跡可能被大量且長久留存的當下，無論是資訊安全、不斷推移的功能、資料不當揭露、政府集中的管制與追蹤、甚至生物特徵資料的搜集、保護及運用等，都是人們所憂慮的問題。就這些問題，資訊公開甚至開放源碼是否有它的極限？政府該如何做，才能不致有過度侵害人民隱私的疑慮？\n\n在這個十分鐘的短講中，講者將概述從 2015 年來，這兩三年間台灣政府推動晶片身分證的過程與有關的支持理由，並解釋民間團體所憂慮之處。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-governance/%2Fcoscup18-governance-idcard) ","type":"","room":"502","start":"2018-08-11T12:40:00+08:00","end":"2018-08-11T12:45:00+08:00","speaker":{"name":"何明諠（Ho Ming-Syuan)","bio":"何明諠是台灣人權促進會的專案經理，主要負責台灣網路透明報告。此外，他同時也在台權會中協助倡議隱私與言論自由的議題，例如通訊監察、數位身份、開放資料及巨量資料與隱私、健康資料、以及網路中介者責任等。\n\nHo Ming-Syuan is the project manager at Taiwan Association for Human Rights(TAHR), and mainly responsible for the Taiwan Internet Transparency Report. He also advocates the issues regarding privacy and freedom of expression for TAHR, such as \"communication surveillance\", \"digital identity\", \"open data, big data and privacy\", \"health data\", and \"intermediary liability\".","avatar":"https://coscup.org/2018-assets/img/speakers/s00123.jpg"}},{"id":"50acff6a-f9f9-4a35-9220-53352a784f26","field2":"github","subject":"我在 GitHub 參與開源貢獻專案的日子","summary":" 我從 2014 開始加入 GitHub 後，當時還不知道要在上面做什麼，或許跟很多人一樣，上面就放著自己的 side project 而已。活動量是很少量的，直到某一天，在改善了某個國外 PHP 開發者的 PHP 函式庫 bug 後，就開啟我對開源貢獻的興趣。\n那在這開源貢獻路上，自己一個人走得很辛苦，舉步維艱，不過憑藉著自身對於寫 code 的熱情，還是在這條道路上一直堅持著。\n本議程，是想要分享一開源貢獻一路走來的心得，以及讓對於開源貢獻有興趣的人但是不知道如何入門給他一個指引的明燈，以及介紹開源貢獻的方法有哪一些，如何做讓 GitHub 上面的開源專案變得更好。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc307-github) ","type":"","room":"307","start":"2018-08-11T12:40:00+08:00","end":"2018-08-11T13:20:00+08:00","speaker":{"name":"李昀陞","bio":"我叫做 Peter，活躍於 GitHub 上的開源專案貢獻者，目前主要貢獻程式語言對象為 PHP，協助多項 GitHub 上多個 PHP 開源專案進行測試與找 bug 並修復。\n目前個人也經營 Blog 網站，其他興趣涉獵有資訊教育以及與其他 非資訊背景的人一同開發的經驗，同時也是 Webduino L1 認證講師以及智慧緊急按鈕共同發起人之一。附上相關資訊\nGitHub 帳號：https://github.com/peter279k\nBlog 網站：https://peterli.website\n智慧緊急按鈕 (Beta 版本)：https://smart-sos.click","avatar":"https://coscup.org/2018-assets/img/speakers/s00115.jpg"}},{"id":"b1ce81ce-6886-42d9-9cdf-ab77f123d231","field2":"practical-javascript-fuzzing-","subject":"Practical JavaScript Fuzzing","summary":" In previous COSCUPs, I gave talks on introductions to fuzzing. In this session, I will give a demonstration on how to set up the open source funfuzz framework to test the SpiderMonkey engine on the Gecko platform, used in Firefox browsers. \n\n(If you are going to attend this session, please fill the form: https://goo.gl/forms/aJEFFxXXxSgT1znq1)\n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-practical-javascript-fuzzing-)","type":"","room":"101","start":"2018-08-11T12:45:00+08:00","end":"2018-08-11T13:25:00+08:00","speaker":{"name":"Gary Kwong","bio":"Gary Kwong is a senior security engineer at Mozilla and a long-time member of its community. He specialises in running JavaScript fuzzers that rigorously test SpiderMonkey - the JavaScript engine of the Gecko platform on which Mozilla Firefox is based. Gary is passionate about world languages, partner dancing and just started learning to play the piano.","avatar":"https://coscup.org/2018-assets/img/speakers/s00036.jpg"}},{"id":"a9cbc1fb-7d6c-47b5-a8a2-d457fdb6112a","field2":"kubernetes-ha","subject":"一鍵部署 Kubernetes HA + Self-hosted Cluster","summary":" Kubernetes HA cluster 的部署一直都不太方便，本次分享介紹可快速建立 Kubernetes HA 並加上 Self-hosted 功能的好用工具；既提高可靠性，也方便升級 Kubernetes 的核心組件。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-sdn/%2Fcoscup18-sdn-kubernetes-ha) ","type":"","room":"401","start":"2018-08-11T12:45:00+08:00","end":"2018-08-11T13:10:00+08:00","speaker":{"name":"洪瓏軒","bio":"一個喜愛接觸虛擬化與容器化的工程師。","avatar":"https://coscup.org/2018-assets/img/speakers/s00096.jpg"}},{"id":"1d46f9b2-3fa5-4558-abd4-76a27a9ebf53","field2":"devops-panel","subject":"Devops Panel","summary":" \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-blockchain/%2Fcoscup18-blockchain-devops-panel) ","type":"","room":"302","start":"2018-08-11T12:50:00+08:00","end":"2018-08-11T13:15:00+08:00","speaker":{"name":"John Chu / Ken Lin / smalltown","bio":"從礦工開始接觸區塊鏈並架設礦池成立挖礦社群，在挖礦的過程中對區塊鏈有了興趣開始研究\n\n---\n從後端工程師出發, 接著在 Mobile APP 開發, 雲端伺服器管理, 專案負責人等不同職位上探索與學習.\n在這個過程中體驗到了開發, 維運以及專案管理的各種眉眉角角, 進而對於 DevOps 產生了興趣.\n最近這段時間進入了區塊鏈的領域, 跟著各位大神的腳步持續學習, 有時也會在社群中分享自己的淺見, 希望能為社群貢獻一己之力, 也期望藉著自己的拋磚引玉, 吸引更多朋友一起加入社群.\n\n---\n原來只是一介草 QA，但開始研究自動化維運雲端服務後，便一頭栽進 DevOps 的世界裏，熱愛鑽研各種可以提升雲端服務品質及增進團隊開發效率的開源技術，並且協助組織導入 CI/CD；工作之餘喜歡跟大家一起分享和切磋技術，有時候會出現在社群或是企業內部擔任野生的講者。","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"78fc1536-3504-4548-ba88-695f90009352","field2":"blockchain-governance-and-privacy","subject":"Blockchain governance and privacy","summary":" 支撐分散式帳本的區塊鏈技術，是如何形成信任機器？又如何不受第三方監督與管理？而又如何達成網路中立？但，區塊鏈帳本透明毫無隱私，究竟又是如何形成資料保護？並與傳統的資料隱私保護機制有何不同？本講透過以太坊 (Ethereum) 帶你了解區塊鏈的設計與常見的迷思 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-governance/%2Fcoscup18-governance-blockchain-governance-and-privacy) ","type":"","room":"502","start":"2018-08-11T13:05:00+08:00","end":"2018-08-11T13:40:00+08:00","speaker":{"name":"陳昶吾","bio":"任職於 AMIS，負責區塊鏈底層研發。同時也是以太坊基金會研究員，於政大資科開設區塊鏈課程，研究興趣為網路安全、隱私保護和區塊鏈","avatar":"https://coscup.org/2018-assets/img/speakers/s00077.jpg"}},{"id":"fa6d593c-86dd-4842-a772-fb9d15b81e1f","field2":"inception","subject":"Inception- 雲時代的 MySQL 審核開源工具","summary":" 在使用 MySQL 的過程中，爲了確保 SQL 操作的安全和高效，我們逐步認識到對 SQL 的審核越來越重要，特別是在 MySQL 雲逐步普及的今天，很多 MySQL 都在雲端工作，運維的 DBA 越來越少，怎麽高效和自動化的利用自動化工具做 SQL 審核，以保證高效利用資料庫越來越重要了。我們設計並開發了 Inception，利用這個工具可以實現自動化的 SQL 審核、執行、備份、回滾等操作。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-database/%2Fcoscup18-database-inception) ","type":"","room":"501","start":"2018-08-11T13:00:00+08:00","end":"2018-08-11T13:40:00+08:00","speaker":{"name":"周彥偉","bio":"現爲極數雲舟 CEO，在就任極數雲舟 CEO 前他是去那兒的維運總監. 他也是中國最大最重要的 MySQL 社群 - ACMUG 的創始人和主席，也是開源資料庫論壇（ODF）和極數學院發起人。他的著作有《MySQL 運維內參》, 也是開源系統 MySQL Inception 的創作者。他自 2015 即獲得 Oracle ACE Director（MySQL）殊榮。在 2018 年創辦極數雲舟，提供 MySQL 技術産品和顧問服務。","avatar":"https://coscup.org/2018-assets/img/speakers/s00111.jpg"}},{"id":"5a52eb39-1d46-4b64-8ef7-b2cc81273ada","field2":"flux!-the-beautiful-julia-ml-framework","subject":"Flux! the beautiful Julia ML framework","summary":" \"Flux is an elegant approach to machine learning. It's a 100% pure-Julia stack, and provides lightweight abstractions on top of Julia's native GPU and AD support. Flux makes the easy things easy while remaining fully hackable.\" We will show a beautiful approach of building a deep learning model using Flux and how powerful a dynamic framework could be. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-julia/%2Fcoscup18-julia-flux!-the-beautiful-julia-ml-framework)","type":"","room":"308","start":"2018-08-11T13:00:00+08:00","end":"2018-08-11T13:50:00+08:00","speaker":{"name":"鄭景文","bio":"A regular student in Taiwan","avatar":"https://coscup.org/2018-assets/img/speakers/s00055.jpg"}},{"id":"790e15ad-c4c5-4631-979f-7d043405d0e3","field2":"risc-v-ftrace-perf","subject":"在 RISC-V 上的 ftrace 及 perf 工具移植經驗","summary":" 原先只是大學課堂的一個點子，卻因為它的開放理念而成為世界關注的新型態指令集架構，在 2017 年先後完成初步的移植，進入 FreeBSD 與 Linux 的上游，RISC-V 就此橫空出世。\n講者 Alan (高魁良) 來自晶心科技，是國內站在這一浪潮尖端的半導體 IP 公司的軟體工程師。他將帶來的是第一手的移植經驗：從 ftrace 與 perf 的技術本身到 Linux 核心貢獻的眉眉角角，再從與上游維護者的互動到公司面對開源系統的愛恨情仇；小小的 commit 卻大有文章。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-kernel/%2Fcoscup18-kernel-risc-v-ftrace-perf) ","type":"","room":"202","start":"2018-08-11T13:00:00+08:00","end":"2018-08-11T13:40:00+08:00","speaker":{"name":"Alan Kao/高魁良","bio":"國立清華大學資工博士退學生，晶心科技軟體工程師，曾於國內 CTHPC 及 ContainerCon 分享過系統軟體相關的議題。目前的目標是四暗刻單騎。","avatar":"https://coscup.org/2018-assets/img/speakers/s00047.jpg"}},{"id":"d1b32776-aa7d-4286-9636-99d4423b2f34","field2":"open-vswitch","subject":"Open vSwitch overview","summary":" Open vSwitch is a multilayer software switch licensed under the open source Apache 2 license. The goal is to implement a production quality switch platform that supports standard management interfaces and opens the forwarding functions to programmatic extension and control.\n\nOpen vSwitch is well suited to function as a virtual switch in VM environments. In addition to exposing standard control and visibility interfaces to the virtual networking layer, it was designed to support distribution across multiple physical servers. Open vSwitch supports multiple Linux-based virtualization technologies including Xen/XenServer, KVM, and VirtualBox.\n\nIn this talk, I would like to give an overview about the Open vSwitch project and including the following topic: \n- What is Open vSwitch and why we need Open vSwitch? \n- Open vSwitch support features \n- Open vSwitch architecture \n- Current status of Open vSwitch \n- How to install Open vSwitch in openSUSE \n- Introduction Open vSwitch daemons and tools \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-open-vswitch)","type":"","room":"201","start":"2018-08-11T13:00:00+08:00","end":"2018-08-11T13:30:00+08:00","speaker":{"name":"David Chang","bio":"David Chang is a software engineer of SUSE Labs who mainly working on\nethernet drivers update of SUSE Linux. He also makes contributions to\nthe linux kernel.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"6e6c58dd-2ba9-4f80-854a-5edd1529b269","field2":"ansible-and-opensuse-workshop","subject":"Ansible and openSUSE workshop","summary":" Ansible is an IT automation tool. It can configure systems, deploy software, and orchestrate more advanced IT tasks such as continuous deployments or zero downtime rolling updates. \nIn this workshop - We will introduce ansible and hands on some example with openSUSE. \n* What is ansible - configuration management tool \n* Online resource with ansible \n* Why do you use Ansible \n* What's difference with shell script? \n* What do I need to know before I use Ansible? \n* How to install ansible with openSUSE and other linux. \n* The role of Ansible. \n---- Control Machine \n---- Managed Node\n\n* Hands on - Hello ansible! Your first ansible command. \n---- Use command line \n---- Use Jupyterhub\n\n* What is inventory file? \n* What is ansible.cfg? \n* What is Ansible Module - what could them do it for you?\n\n* Hands on - use ansible module with openSUSE.\n\n* What is Playbook? \n---- how could I use playbook with ansible.\n\n* Hands on - use ansible playbook with openSUSE\n\n* Reference \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-ansible-and-opensuse-workshop)","type":"","room":"304","start":"2018-08-11T13:00:00+08:00","end":"2018-08-11T15:15:00+08:00","speaker":{"name":"Max Huang","bio":"Working at NCHC\nStudy Area 酷學園 & 鳥哥私房菜 小雜工\nopenSUSE Member / openSUSE.Asia Committee Member\nGNOME.Asia Committee Member\n喜歡社群自由無私的分享、熱愛自由軟體及 Linux 所帶來的方便性\n\nhttps://sakanamax.github.io/","avatar":"https://coscup.org/2018-assets/img/speakers/s00023.jpg"}},{"id":"31ccc6c2-7b82-497d-9919-000b6e9ff941","field2":"linux-iptables","subject":"Linux iptables 的運作原理分析","summary":" Linux Iptables 是一個強大且好用的防火牆工具，透過不同的規則與指令來達成各式各樣的網路功能，本次內容將分享這些功能背後的運作原理，同時也會介紹如何自行實現一個 iptalbes 的模組來客製化功能。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-source/%2Fcoscup18-source-linux-iptalbes) ","type":"","room":"503","start":"2018-08-11T13:00:00+08:00","end":"2018-08-11T13:30:00+08:00","speaker":{"name":"邱宏瑋 (hwchiu)","bio":"Just an engineer\n喜愛研究各類網路知識與系統維運概念，如 SDN/SDS/Kubernetes / 等\n此外也喜歡透過閱讀原始碼的方式來學習各類技術的實現方式\n\n目前也擔任 SDNDS-TW 以及 Cloud Native Taiwan User Group (CNTUG) 的共同創辦人\n定期舉辦相關的 Meetup 來交流學習","avatar":"https://coscup.org/2018-assets/img/speakers/s00142.jpg"}},{"id":"1a957ed9-16ef-4cc8-af5d-7efdf19a807c","field2":"family-workshop-2","subject":"親子工作坊：向上飛行～飛行小紙杯！","summary":" （[需提前報名](https://coscup2018.kktix.cc/events/workshop2018sat-2)）\n\n只要把紙杯與自己做好的螺旋槳以及翅膀進行最終合體，就可以解開封印還你飛行小紙杯原型，順利的向上飛行，奔向青空！所以不要太興奮，這次工作坊要跟你分享做這個小小飛行器。  ","type":"","room":"大用","start":"2018-08-11T13:00:00+08:00","end":"2018-08-11T16:00:00+08:00","speaker":{"name":"鄭鴻旗","bio":"","avatar":"https://coscup.org/2018-assets/img/speakers/s00054.jpg"}},{"id":"38977b18-39ca-4816-80f9-cc144813664a","field2":"traefik-on-k8s","subject":"用 Traefik 來簡化及統一網站流量管理 on K8s","summary":" Traefik 是個輕巧的反向代理及平衡負載。而且 K8s L7 LB 上的支援，針對各家 Cloud 皆有不同的做法及不完整的支援度。使用 Treafik on K8s 可以方便管理所有流量的及服務的關係，而且支援完整的 Websocket, HTTP/2, GRPC, Let’s Encrypt , TLS. 希望介紹 Traefik 讓大家認識外，也讓聽眾能了解如何簡化 K8s L7 的管理及服務。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-sdn/%2Fcoscup18-sdn-traefik-on-k8s)","type":"","room":"401","start":"2018-08-11T13:15:00+08:00","end":"2018-08-11T13:40:00+08:00","speaker":{"name":"陳銘森 (Mat Chen)","bio":"前 Yahoo! 超級商城工程師 + 主管。有 16 年的開發經驗。致力於優化公司內部的開發流程，並將 DevOps, CI/CD 等技術，實踐於公司的開發流程中","avatar":"https://coscup.org/2018-assets/img/speakers/s00071.jpg"}},{"id":"8740296e-4631-4876-8d4e-b7c6c6878198","field2":"ethereum-layer-2-solutions","subject":"An Introduction to Ethereum Layer 2 Solutions","summary":" Most of the blockchain mainnet is not scalable. For example, the average transaction per second of Ethereum is only 25tps. Fortunately, we have some scaling solutions for blockchain that supports smart contract, like Ethereum. These solutions include payment channel, state channel, plasma and BOLT, which is developed by BOLT research team. In this talk, we will introduce these scaling solutions and compare their pros and cons.\n\nref1: [Making Sense of Ethereum’s Layer 2 Scaling Solutions: State Channels, Plasma, and Truebit](https://medium.com/l4-media/making-sense-of-ethereums-layer-2-scaling-solutions-state-channels-plasma-and-truebit-22cb40dcc2f4)\nref2: [Layer 2](https://github.com/BOLT-Protocol/wiki/blob/master/layer2.pdf) \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-blockchain/%2Fcoscup18-blockchain-ethereum-layer-2-solutions)","type":"","room":"302","start":"2018-08-11T13:20:00+08:00","end":"2018-08-11T13:45:00+08:00","speaker":{"name":"呂峻豪 / 陳柏翰","bio":"BOLT Core Developer\n---\nBOLT Core Developer","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"7e428aaa-d81b-44a2-ba99-8248ff44ddfd","field2":"minifarmbot","subject":"當開源農業自動化教育走入校園","summary":" miniFarmBot 在教育上的應用算是很很先進的機電自動化整合的絕佳專案教具,~\n有機構, 電機, Arduino 微處理器電控, Pi3 PC-Base, OpenCV 視覺辨識, Iot 雲端大數據,~\n自動化的應用非常廣, 要是教育界的先進識貨的話, 可以幫業界培養很多人才,~\n傳統自動化業界技術斷層很嚴重, 人才需求更大 (因為自動化生產是世界趨勢潮流, \n普遍找不到生產類別年輕員工, 中老一輩的想休息不加班, 產能無法達成, 只有產線自動化一路可走),~ \n所以 FarmBot 的專案, 從頭到尾有好好學會一兩樣, 就絕對一定是個人才了~~ \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-osfarm/%2Fcoscup18-osfarm-minifarmbot)","type":"","room":"305","start":"2018-08-11T13:20:00+08:00","end":"2018-08-11T13:55:00+08:00","speaker":{"name":"陳志弘","bio":"任職於弘熙自動化科技有限公司，主程式設計、產線自動化機電整合。\n於 職校 / 科大 兼任 [自動化專題] 業界講師。\n","avatar":"https://coscup.org/2018-assets/img/speakers/s00083.jpg"}},{"id":"79b191bb-3662-4a83-8ef4-31325e6e43ae","field2":"plan-your-testing","subject":"Plan your testing","summary":" GNOME has seen a number of initiatives to improve testing over recent years and the project is in the best position to see further improvements. Automated testing, especially with the move to GitLab, is more effective than ever. Usability testing has seen a lot of work from Jim Hall and the design team. But what about the planning and organisation around delivering GNOME as a product?\n\nI will discuss the theory and processes around planning testing for a product like GNOME with regular releases, using real life examples from Apertis and how they can be applied to applications and the GNOME desktop. I will discuss the pros and cons of different approaches and how to decide what you should be using. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome301-plan-your-testing)","type":"","room":"301","start":"2018-08-11T13:30:00+08:00","end":"2018-08-11T14:15:00+08:00","speaker":{"name":"Kat","bio":"Kat has been a user of Free/Libre software for over a decade and it did not take her long to start contributing. She joined the GNOME project as an intern with the documentation team and GUADEC organiser. Shortly after, she started mentoring interns and becoming involved in other areas of GNOME and joining other teams. Since then, her work has included being on the Board of Directors and the documentation team lead. Kat currently works as QA Lead at Collabora, promoting use of Free/Libre software in her every day work.","avatar":"https://coscup.org/2018-assets/img/speakers/gnomeasiasummit.jpg"}},{"id":"730c3fca-83e4-4a81-8da4-86560a1c0c24","field2":"machine-economy-with-iota","subject":"Machine Economy with IOTA","summary":" In this group, we invite individuals with an interest in Blockchain and Distributed Ledger Technology to investigate and collaborate on projects using the IOTA Tangle platform (think blockchain 3.0 minus block and chain).\n\nAll are welcome to this group, we are about collaboration and exploration.\n\nIf you'd like more information about the IOTA Tangle platform please see the links below, (there are some clear video explanations).\n\nWhy we think the IOTA Tangle has the potential to be bigger than Blockchain\n\n* No transaction fees - enabling microtransactions\n* Decentralized - no miners\n* More network use = a faster network\n* Infinitely Scalable\n* An ecosystem for the Machine Economy\n* IOTA protocol ensures data integrity in information sharing\n* Tangle technology uses ternary code, a natural progression from binary code.\n* Quantum secure - resistant to quantum computer cryptanalysis. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-machine-economy-with-iota)","type":"","room":"101","start":"2018-08-11T13:30:00+08:00","end":"2018-08-11T14:20:00+08:00","speaker":{"name":"Edward Greve","bio":"Edward Greve has been a software developer for a number of years, most recently at WillowTree Apps in North Carolina, where he worked on cutting edge digital products for nationally and internationally recognizable brands, such as CBC and National Geographic. His area of expertise is in full-stack web development, and he understands how to work with business partners to develop advanced cloud-based systems that support applications with a world-class user experience. Edward holds degrees in Mathematics and Physics from Rowan University and is fully self-taught in computer science. He is also a language enthusiast and polyglot, and he speaks fluent Mandarin Chinese, Dutch, and French in addition to conversational bits and pieces in a half-dozen other languages from around the world. He spent almost a decade living and working in Taiwan. Edward Greve has a wide range of experience from different regions and brings with him a varied skill set to the IOTA Foundation, and while his primary role will be full stack front-end development, he plays a key role in supporting the IOTA Foundation’s efforts on the ground in Asia to establish IOTA as a standard in the region for IoT and beyond. His polyglot abilities is also a very useful asset for obvious reasons.","avatar":"https://coscup.org/2018-assets/img/speakers/s00038.jpg"}},{"id":"6b2f5071-1a08-4060-9694-aa3571163d8e","field2":"opensuse-today","subject":"What you should know about OpenSUSE today ?","summary":" openSUSE project, a community program sponsored by SUSE in order to promoting the use of Linux everywhere. This program aims to provides free, easy access to the world's most usable Linux distribution (openSUSE).\n\nopenSUSE has been a community-driven project that, despite sponsorship from SUSE, is relatively independent. About two years ago, openSUSE decided to move the base of openSUSE Leap to SUSE Linux Enterprise (SLE), which SLE is a tightly controlled enterprise ship that runs on mission critical systems. The fact is that moving to SLE source code would solve many problems for both SLE and openSUSE via creating a symbiotic relationship in which they can pull the content from each other.\n\nAt the end, openSUSE project restructured its distributions and created two distributions: Leap and Tumbleweed.\n\nTumbleweed, the fully-tested rolling release, became upstream for SLE; whereas Leap is based on SLE and inching itself towards full compatibility with SLE. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-opensuse-today)","type":"","room":"201","start":"2018-08-11T13:30:00+08:00","end":"2018-08-11T14:00:00+08:00","speaker":{"name":"Jeffrey Cheung","bio":"Project Manager of SUSE Labs","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"2745c807-a09d-4fb2-8f8e-15d3bda538b4","field2":"ethereum-source","subject":"從零開始理解原始碼 - 以 ethereum 為例","summary":" 當 block chain 走入大眾眼眶，多數人不是被炒幣給攫住目光，就會馬上想到是不是要去買一把韭菜了。其實在主流的 block chain 應用中都有非常不錯的軟體藏在其中。Ethereum 是一個可以部署 Smart contract 應用的平台，在這個範圍裡，可以看見一個把 smart contract 變成 bytecode 的 solidity compiler 也有一個可以執行 bytecode 的 ethereum virtual machine。\n\n而面對像這樣一個全新的大型專案，看到裡頭洋洋灑灑數千甚至數萬行程式碼，讓人很容易卻步，也不容易在短時間內熟悉內容。\n在本次的議程中，我將分享自己是如何快速地從全新的專案中了解內部的架構設計：\n\n1. 以三個從完全不懂到理解架構與細節的 ethereum 專案為例： go-ethereum, cpp-ethereum, solidity compiler。\n2. 要如何對軟體架構進行分析，並做出 UML 來逐步拆解元件。\n3. 如何仔細地追蹤細節，並把重要的部分抽取出來講解給他人。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-source/%2Fcoscup18-source-ethereum-source)","type":"","room":"503","start":"2018-08-11T13:30:00+08:00","end":"2018-08-11T14:00:00+08:00","speaker":{"name":"戴宏穎","bio":"hydai（讀作海帶），是個興趣使然的軟體開發者。\nWebsite: hyd.ai\nGitHub: @hydai\n目前在 Skymizer 這家編譯器公司跟 Compiler 的巨龍對幹中。\nEthereum 是我在一年前開始玩的區塊鏈專案，覺得能在去中心化的世界裏寫程式很開心，因此義無反顧的加入公司在 Blockchain 這邊的 Lity Project。\n目前在 Skymizer 與許多屠龍勇者一起攻打 Compiler 這條巨龍。","avatar":"https://coscup.org/2018-assets/img/speakers/s00053.jpg"}},{"id":"183a9bc2-9c36-4d48-bc7f-fd4842d09f00","field2":"ethical-ai","subject":"從 ethical AI 談機器學習的隱私與公平性問題","summary":" 隨著機器學習的應用場景增加，關於其倫理問題也愈來愈受重視。但許多相關的討論，在專門名詞與概念混淆的情況下難以聚焦。本場演講將介紹如平等機會（equal opportunity）、差異隱私（differentcial privacy）等相關概念，並回顧機器學習領域近年來關於演算法公平性，隱私問題相關的研究成果。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-governance/%2Fcoscup18-governance-ethical-ai) ","type":"","room":"502","start":"2018-08-11T13:50:00+08:00","end":"2018-08-11T14:25:00+08:00","speaker":{"name":"吳柏旻","bio":"吳柏旻（Pomin Wu、pm5），數學家、攝影師、程式設計師。曾協助數個 NGO 導入開放源碼軟體。活躍於零時政府 g0v.tw、開放街圖、OpenData.tw 等社群。為開源軟體專案「政誌」、「賽豬公上太空」，itaigi.tw 的參與開發者。現於 Sense.tw。","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"f3420e98-992b-47d4-bb94-d7540ac12127","field2":"bolt","subject":"BOLT: Booster of Ledger Technology","summary":" BOLT, a.k.a Booster of Ledger Technology, is one of the public blockchain layer 2 solutions. The core idea of BOLT is that it boosts the network by utilizing centralized system. Meanwhile, BOLT uses auditors to ensure the security of the booster. In this talk, we will introduce BOLT and present a live demo that shows the power of this new technology.\n\nref1: [BOLT github](https://github.com/BOLT-Protocol/)\nref2: [BOLT yellow paper](https://github.com/BOLT-Protocol/wiki/blob/master/yellow_paper.md) \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-blockchain/%2Fcoscup18-blockchain-bolt)","type":"","room":"302","start":"2018-08-11T14:10:00+08:00","end":"2018-08-11T14:35:00+08:00","speaker":{"name":"邱駿 / 鄭安傑","bio":"BOLT Core Developer\n---\nBOLT Core Developer","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"f6dc9130-f0a1-4b13-b1a7-75d8174d1c40","field2":"postgresql-11","subject":"What's new in PostgreSQL 11","summary":" PostgreSQL 11 將於 2018 年第三季發布，在這個新的版本有許多功能新增與強化，如 Local Partitioned Indexes、Hash Partitioning、Partition Wise Join、Partition Wise Aggregates... 等。盼藉由這半小時介紹 PostgreSQL 11 的新特性，以及讓更多人認識 TWPUG。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-database/%2Fcoscup18-database-postgresql-11) ","type":"","room":"501","start":"2018-08-11T13:45:00+08:00","end":"2018-08-11T14:15:00+08:00","speaker":{"name":"林宗禧","bio":"自 PostgreSQL 9 成為重度使用者，以開發 FDW 為樂趣；於 2014-2016 間，約兩年半的時間，聯繫拜訪國內推廣 PostgreSQL 的前輩，以及聚集相關技服廠商，自 2017 年再次推動台灣 PostgreSQL 使用者社群 (TWPUG) 至今。","avatar":"https://coscup.org/2018-assets/img/speakers/s00108.jpg"}},{"id":"51cf57a1-7d3b-4ec7-8e29-a93a1d9d82fb","field2":"simd","subject":"快快樂樂 SIMD","summary":" 所有 CPU 等級裝置都包含了一個尚未被喚醒的功能, 向量暫存器, 目前全世界所有的開源只有 OpenCV 達到 30% 的使用率, 本次演講將會針對 Intel SSE/AVX 及 Arm NEON 兩大平台, 如何超越 compiler O3 等級的優化 (release mode), 發揮向量暫存器 100% 的極限, 將會比現存的 O3 等級優化再快 4 倍, 對於 AI 人工智慧, blockchain 演算法類, 將會是重要的里程碑 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-kernel/%2Fcoscup18-kernel-simd)","type":"","room":"202","start":"2018-08-11T13:45:00+08:00","end":"2018-08-11T14:25:00+08:00","speaker":{"name":"王唯達","bio":"OpenCV 昨日 作者 http://yester-place.blogspot.tw/2008/06/opencv.html\n技術分享 Google+  https://plus.google.com/u/0/107194220253712101874\nHTC VIVE team Leader","avatar":"https://coscup.org/2018-assets/img/speakers/s00128.jpg"}},{"id":"ba16df66-6da4-4b43-83cd-0caf784010a3","field2":"raspberry-pi-x-kubernetes-x-tensorflow","subject":"Raspberry PI x Kubernetes x TensorFlow","summary":" 利用 k8s 部署 TensorFlow 應用於 Raspberry Pi 上的經驗分享 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-sdn/%2Fcoscup18-sdn-raspberry-pi-x-kubernetes-x-tensorflow) ","type":"","room":"401","start":"2018-08-11T13:45:00+08:00","end":"2018-08-11T14:25:00+08:00","speaker":{"name":"蔡霈萱","bio":"最近剛從清大畢業的工程師，主要研究方向為物聯網以及霧運算，常使用的工具為 Docker 及 Kubernetes","avatar":"https://coscup.org/2018-assets/img/speakers/s00147.jpg"}},{"id":"58e9b47c-0ae1-496d-9c69-1c3fa29190a2","field2":"agrino","subject":"Agrino : 應用於農業感測的開源專案","summary":" 在科技如此進步的台灣，農業領域中仍缺乏穩定且簡單有效的設備來協助農夫掌握田間的狀態，因此提出 Agrino 開源專案，目標是打造一個適用於各種作物與環境的低成本田間感測器，不僅讓農夫也讓學校師生、研究人員… 等等，能依自己需求打造屬於自己的感測器。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-osfarm/%2Fcoscup18-osfarm-agrino) ","type":"","room":"305","start":"2018-08-11T14:00:00+08:00","end":"2018-08-11T14:35:00+08:00","speaker":{"name":"KobeYu","bio":"不務正業的博士班學生","avatar":"https://coscup.org/2018-assets/img/speakers/s00028.jpg"}},{"id":"dcd3a91a-5a99-44bb-86dc-19971a5f1a3c","field2":"kubernetes-apiserver","subject":"Read source code: kubernetes apiserver","summary":" In this session, we will go through kubernetes apiserver source code and identify the following main features in apiserver source code:\n1. Basic structure of kube-apiserver\n2. Restful API in kube-apiserver and apimachinery\n3. Authentication and Authorization mechanism \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-source/%2Fcoscup18-source-kubernetes-apiserver)","type":"","room":"503","start":"2018-08-11T14:00:00+08:00","end":"2018-08-11T14:30:00+08:00","speaker":{"name":"David Chang","bio":"後端工程師 / DevOps，喜歡編寫 bash script 自動化維運過程中的大小事。剛開始投入 Kubernetes 的源碼貢獻與國內社群活動，以及 Kubernetes 相關演討會演講。","avatar":"https://coscup.org/2018-assets/img/speakers/s00040.jpg"}},{"id":"a59848b6-50a9-47ba-9000-c7ff7717360a","field2":"meta-programming-in-julia","subject":"Meta Programming in Julia","summary":" Julia 擁有 AST level 的 meta programming 能力，本次會介紹 Julia 的 meta programming 常見的 use cases, pattern and hacks。希望能夠對 Julia 的套件開發者，不管是在提供 DSL、API design 或是接界 native extension 有所幫助。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-julia/%2Fcoscup18-julia-meta-programming-in-julia)","type":"","room":"308","start":"2018-08-11T14:05:00+08:00","end":"2018-08-11T14:55:00+08:00","speaker":{"name":"林峻頤 (Iblis Lin)","bio":"Julia 與 FreeBSD 的愛好者","avatar":"https://coscup.org/2018-assets/img/speakers/s00144.jpg"}},{"id":"644cb19b-772b-4f78-90fa-80e3f70ca445","field2":"plasma","subject":"Plasma introduction","summary":" Plasma is a second layer scalability solution proposed by Ethereum Foundation. Inspired by Lightening Network, it uses child chains reporting to root chains (i.e. Ethereum) to increase transaction throughput without sacrificing the safety. It theoretically empowers Ethereum blockchain to handle billions of computations per second. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-blockchain/%2Fcoscup18-blockchain-plasma)","type":"","room":"302","start":"2018-08-11T13:45:00+08:00","end":"2018-08-11T14:10:00+08:00","speaker":{"name":"徐粲翔","bio":"I graduated from National Taiwan University for both bachelor and master degree. After graduation, I started to participate in Ethereum project. Now, I'm a Plasma contributor.","avatar":"https://coscup.org/2018-assets/img/speakers/s00093.jpg"}},{"id":"bf6ce842-c5c6-4dd3-b3a5-fac09b4dbc62","field2":"gnome-l10n","subject":"談談 GNOME 翻譯","summary":" 淺談自由軟體翻譯困境與 GNOME 翻譯參與方式。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome301-gnome-l10n) ","type":"","room":"301","start":"2018-08-11T14:15:00+08:00","end":"2018-08-11T15:00:00+08:00","speaker":{"name":"曾政嘉","bio":"長期自由軟體翻譯者、推廣者，自己的生活日常中也用 GNU/Linux 桌面。期待有更多熱情的新血可以參與自由軟體翻譯，我們這群翻譯者都會全力協助。","avatar":"https://coscup.org/2018-assets/img/speakers/s00068.jpg"}},{"id":"501a7e66-f56c-4c1a-96f3-df86a0959994","field2":"journey-to-opensuse-leap-15","subject":"Journey to openSUSE Leap 15.0","summary":" openSUSE Leap is a stable release version of openSUSE project[1], a brand new way of building openSUSE and is new type of hybrid Linux distribution. openSUSE Leap uses source shared codebase with SUSE Linux Enterprise (SLE), which gives Leap a level of stability unmatched by other Linux distributions, and combines that with community developments to give users, developers and sysadmins the best stable Linux experience available. The first release of Leap was November 4, 2015, with the release of openSUSE Leap 42.1. The latest release of openSUSE Leap, 15.0, was released on May 25, 2018.\n\nIn this talk, I will present what happened during developing openSUSE Leap 15.0, eg. we have switched to rolling development model for openSUSE Leap release[2]; we have enabled more checks than previous release ensure a better quality, etc., apart from that, I will also given a overview of the important changes.\n\n[1] https://en.opensuse.org/Portal:Leap \n[2] https://en.opensuse.org/openSUSE:Factory_development_model \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-journey-to-opensuse-leap-15)","type":"","room":"201","start":"2018-08-11T14:15:00+08:00","end":"2018-08-11T14:45:00+08:00","speaker":{"name":"Max Lin","bio":"Max is employed by SUSE as openSUSE release engineer. He has contributed to various aspects of openSUSE project.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"b694a620-107c-4d15-9668-69610b629f88","field2":"postgresql-cloud","subject":"PostgreSQL 漫步雲端","summary":" 適用於 PostgreSQL 的 Azure 資料庫為應用程式的開發與部署提供完整受控、符合企業需求的社群版 PostgreSQL 資料庫即服務。讓你輕鬆地移轉到雲端，並可任選語言和架構。除此之外，內建的高可用性與功能，在幾秒內即可調整完成，輕鬆依據需求的改變來調整。強大的安全性與合規性 (包括 Azure IP Advantage) 結合傲視群雄的資料中心數量，務必一起來看看此議程如何帶領各位在彈指之間即可上雲駕馭 PostgreSQL。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-database/%2Fcoscup18-database-postgresql-cloud) ","type":"","room":"501","start":"2018-08-11T14:20:00+08:00","end":"2018-08-11T14:50:00+08:00","speaker":{"name":"楊志強 ( LEWIS YANG)","bio":"。 簡介： 教學經驗超過 10 年以上，專精於 SQL Server 資料庫開發管理與效能調校，微軟、.NET 開發、Oracle 資料庫...；在 server 資料庫的教學上是頂級的專業講師。 \n。 經歷： ．台灣微軟特約資深顧問講師．行政院勞委會職訓局教師．台灣微軟講師．華彩電腦講師．中華電信研究所講師．司法院講師 MS-MCT 2005、MS-MCP、MS-MCSD 2000、MS-MCDBA、Oracle-OCPIAD、Oracle-OCPDA、MS-MCT-2010 \n。 專長： ．微軟. NET 開發工具．微軟 SQL Server 資料庫開發管理與效能調校．美商 Oracle 資料庫．美商 Oracle Developer 開發工具．Delphi 開發工具 \n。 著作： ．SQL Server 2005 資料庫程式開發達人手冊．SQL Server 2005 管理升級與移轉達人手冊．SQL Server 2005 Transact-SQL 達人養成手冊 \n","avatar":"https://coscup.org/2018-assets/img/speakers/s00064.jpg"}},{"id":"e63d21a2-3b90-4505-a4e1-adc4e5ad7e60","field2":"kkbox","subject":"回首過去，看 KKBOX 怎麼走搜尋音樂這條路","summary":" 分享 KKBOX 搜尋音樂所經歷的大小事，以及如何建立完善的監控機制，進而提升系統整體穩定度。\nKKBOX 創立至今十餘年，為亞太地區知名音樂串流平台，而搜尋為其不可或缺的一項功能，不管是搜尋音樂、歌單、專輯、藝人等，都為用戶經常所使用。本議程說明 KKBOX 從早期的 Solor 轉換到 Elasticsearch 的過程，並藉助 Grafana 搭建出視覺化監控平台，有效追蹤與解決系統問題。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-kkbox) ","type":"","room":"101","start":"2018-08-11T14:25:00+08:00","end":"2018-08-11T15:15:00+08:00","speaker":{"name":"Eason Chen","bio":"宅宅工程師，慵懶背包客，喜歡簡單的生活，默默關注新知的技術愛好者。","avatar":"https://coscup.org/2018-assets/img/speakers/s00039.jpg"}},{"id":"6caf346a-61bf-4f44-acdb-08ba44958122","field2":"nds32","subject":"把 nds32 送進 Linux mainline 的經驗分享","summary":" What is nds32\nPrerequisite to port an arch to Linux mainline\nWhat should you port for your arch\nRebase to the latest kernel codes\nDeveloping cycle\nReady to be merged to linux-next\nGet your signed\nGet an account of kernel.org\nSend the pull request to Linus \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-kernel/%2Fcoscup18-kernel-nds32) ","type":"","room":"202","start":"2018-08-11T14:30:00+08:00","end":"2018-08-11T15:10:00+08:00","speaker":{"name":"Greentime Hu","bio":"nds32 Linux kernel maintainer\n晶心科技軟體工程師 (2008-2012,2013-now)\n聯發科技軟體工程師 (2012-2013)\n成功大學電腦與通信工程所\n政治大學資訊科學系","avatar":"https://coscup.org/2018-assets/img/speakers/s00035.jpg"}},{"id":"f965e731-b3a8-48a3-9bc2-e5885c6790f5","field2":"mender-ota","subject":"分享研究 Mender OTA 開源方案的心得","summary":" 隨著連網設備越來越多，如何進行有效率的大規模更新佈署，成了一個關鍵問題\n我研究了這個開源的 OTA 方案，想要來跟大家分享研究得到的心得 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc307-mender-ota) ","type":"","room":"307","start":"2018-08-11T14:30:00+08:00","end":"2018-08-11T15:10:00+08:00","speaker":{"name":"李東霖","bio":"利用即將畢業的時間，與老師同學一同研究好玩的東西","avatar":"https://coscup.org/2018-assets/img/speakers/s00145.jpg"}},{"id":"7e45eb35-749a-4fbb-a49d-d86f7fef9ef8","field2":"openstack-kubernetes-operators","subject":"OpenStack 搭上自建的 Kubernetes Operators 大船啟航","summary":" Kubernetes Operator 是由 CoreOS 推出的框架用途在簡化複雜有狀態的應用管理，Operator 是一個感知應用狀態的控制器，通過 Kubernetes Custom Resources Definitions(CRD) Application Programming Interface 來達到自動建立、管理以及設定相關應用的實例。我們將動手以例子來講解如何利用 Kubernetes Operator 來開發出”OpenStack Services Operators” 可以幫您自動執行及管理 OpenStack 服務的常見任務。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-sdn/%2Fcoscup18-sdn-openstack-kubernetes-operators) ","type":"","room":"401","start":"2018-08-11T14:30:00+08:00","end":"2018-08-11T14:55:00+08:00","speaker":{"name":"李孟澤 / 林毅鑫","bio":"埋頭於雲端世界的耕耘者，期盼有朝一日可以將撒下的種子，能茁壯志浩天。\n---\n","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"6f6cb482-487c-4185-96b9-a8a7c4380c65","field2":"c-compiler","subject":"用 1500 行建構可自我編譯的 C 編譯器","summary":" 透過 AMaCC 來學習可自我編譯的 C 編譯器 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-source/%2Fcoscup18-source-c-compiler) ","type":"","room":"503","start":"2018-08-11T14:30:00+08:00","end":"2018-08-11T15:00:00+08:00","speaker":{"name":"翁敏維","bio":"工程師","avatar":"https://coscup.org/2018-assets/img/speakers/s00092.jpg"}},{"id":"6e885b7e-2142-45f5-8d51-555f4591bd83","field2":"lpwan","subject":"LPWAN 物聯網通訊技術","summary":" 探討物聯網低功耗三大通訊技術推展現況、通訊方式（硬體模組、資料格式、連線機制 / 方式）、如何挑選各種場域適用性及應用場景。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-osfarm/%2Fcoscup18-osfarm-lpwan) ","type":"","room":"305","start":"2018-08-11T14:40:00+08:00","end":"2018-08-11T15:15:00+08:00","speaker":{"name":"柯大","bio":"","avatar":"https://coscup.org/2018-assets/img/speakers/s00099.jpg"}},{"id":"3ae54549-1f75-4548-b32c-03ee55f2e34d","field2":"jogja","subject":"How Jogja Become City of GNU/Linux User Friendly","summary":" I came in to Jogja, March 2009 for Bachelor Degree of Computer Engineering at UIN Sunan Kalijaga and became GNU/Linux user 6 month later since release of Ubuntu 9.10 Karmic Koala.\n\nAfter 10.04 Release, I am only use GNU/Linux as my operating system on my study, although not many course use GNU/Linux on procces. Latter, I joined GNU/Linux Study Club on my campus, and start learn deeper on GNU/Linux.\n\nJogja is known as a center of education (City of Students) because almost 20% of its productive population is students. The city is colored by the various background of students that came from various regions in Indonesia. Jogja has private and public/state universities. Jogja have more than 16 universities which have computer related majors. Each campus have similar GNU/Linux Study club. And each month all GNU/Linux study club held regular meeting. Each meeting will talk about GNU/Linux technical or non technical related and held on different location.\n\nFrom this background, education about GNU/Linux on University become common things. Students start using GNU/Linux base what their need for their study. Many campus often have GNU/Linux Repository, event ther GNU/Linux derivative distribution. Each campus have different fan of distribution too. I join this community until I graduated from my Campus at 2014.\n\nThis habit they keep up to the next office. Why? Because now, Jogja move from city of education to city of startup. Because more than 10 big startup create Developer Office on Jogja. And many new startup born everyday.\n\n2018, GNU/Linux community in Jogja did not have bigger fans like ten years ago. But every startup still using GNU/Linux for their development and service what their made, even using all open source tools in development tools.\n\nIn this talk, I will present what keys point to make GNU/Linux became common things on Jogja. How it feasible to implement on other city or other country? \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-jogja)","type":"","room":"201","start":"2018-08-11T14:45:00+08:00","end":"2018-08-11T15:15:00+08:00","speaker":{"name":"Estu Fardani","bio":"Estu Fardani is currently working as DevOps in Indonesian local startup. Doing daily mentoring fullstack development for Binar Academy. He has extensive experience in all aspects of managing event for local, national and international. Active as contributor for BlankOn Project for make BlankOn Linux, one of linux distribution from Indonesia.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"dadf5dab-b3fb-43c2-bac7-a70fcffcf8f5","field2":"lity","subject":"Lity: 讓你更安全的 smart contract language","summary":" 在 Ethereum 開發 smart contract 時，常常會因為原本語法上的設計，讓開發者可能在無意間犯下數千萬金錢的損失。以最近發生的 BEC overflow 事件，因為在一個小地方的乘法沒有使用 SafeMath 函式庫來包裝，讓 token 數量可以被 overflow 攻擊，進而造成非常驚人的損失。以及 EDU 沒有使用 SafeMath 做數值的減法。\n\n而當我們想在 Ethereum 中增加加解密的功能時，直接將 RSA encrypt & decrypt 的演算法實現在 Solidity 中的時候，會讓大量資料的加解密消耗過多的 gas 讓整個 transaction 失敗。\n\nLity 是基於 Solidity language 來擴充的語言，針對上面提到的兩個問題做了改善：\n\n1. Lity Native Interface 提供了一個 ENI 指令，當 developer 想使用複雜計算的額外功能，可以通過 ENI 指令來呼叫以 C/C++ 實作的外部 library 來執行。\n\n2. Lity Linter 提供更安全的 overflow checker、ERC Standard checker 等讓 developer 能更安心的開發。\n\n在本次的演講中，我將談論 Lity 的設計哲學與在實作中的各種血淚故事，以及對現在 Solidity compiler 的看法。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-blockchain/%2Fcoscup18-blockchain-lity) ","type":"","room":"302","start":"2018-08-11T14:50:00+08:00","end":"2018-08-11T15:15:00+08:00","speaker":{"name":"戴宏穎","bio":"hydai（讀作海帶），是個興趣使然的軟體開發者。\nWebsite: hyd.ai\nGitHub: @hydai\n目前在 Skymizer 這家編譯器公司跟 Compiler 的巨龍對幹中。\nEthereum 是我在一年前開始玩的區塊鏈專案，覺得能在去中心化的世界裏寫程式很開心，因此義無反顧的加入公司在 Blockchain 這邊的 Lity Project。\n目前在 Skymizer 與許多屠龍勇者一起攻打 Compiler 這條巨龍。","avatar":"https://coscup.org/2018-assets/img/speakers/s00053.jpg"}},{"id":"d69eec72-ebdc-4f5a-ac86-696226c2d131","field2":"public-money-public-code","subject":" 為什麼用人民納稅錢所建立的軟體與資訊系統，卻沒有以自由軟體授權公開釋出呢？ Public Money Public Code, and Open API in Taiwan","summary":" 為什麼用人民納稅錢所建立的軟體與資訊系統，卻沒有以自由軟體授權公開釋出呢？\n人民因為各種因素或理念而選擇政府來協助處理人民相關事務，而政府依靠人民的稅金與支持得以維持國家的運作，這種關係在民主國家是十分合理且必要的互動。但因為政府無法獨自用組織內的人力處理全部的事務，所以政府與立法機關用一致性的法則來規範合作的項目，這就是行政院公共工程委員會頒布的政府採購法。相對於資訊相關的部分則為政府採購法施行細則中的資訊服務相關條例。政府以人民稅金所產生的資訊服務，雖然最終使用者包含人民，但人民應該有個疑問：這些源自人民稅金的服務，是否也能把程式框架或原始程式碼公開？\n歐洲自由軟體基金會 (FSFE) 發起的 Public Money Public Code 議題 (https://publiccode.eu/zh_tw/)，其中表現了 FSFE 希望人民可以在各個國家透過立法單位去要求政府產生的軟體服務或架構，其授權改用自由軟體授權方式釋出。我所協助的社群： FOSSASIA（亞洲分享並貢獻 FOSS 社群 ）也是響應 FSFE 這個計畫的其中一個社群，自己先前參與 VTaiwan 社群小聚中，聽到許多大大十分精彩的意見，其中包含 AU 推廣的 OpenAPI（共通性資料存取應用程式介面），覺得這些資料整理後，希望分享給大家知道，並希望大家能夠專注這個議題，無論是 Public Money Public Code，或是 AU 推廣的 OpenAPI，政府的資訊軟體或服務的授權是否跟得上時代，或是自由軟體授權在政府單位是否有阻礙，除了自己淺薄的知識希望分享之外，這些都是我希望跟大家一起討論的。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-governance/%2Fcoscup18-governance-public-money-public-code) ","type":"","room":"502","start":"2018-08-11T14:35:00+08:00","end":"2018-08-11T15:10:00+08:00","speaker":{"name":"Noah Chen","bio":"Noah, volunteer of FOSSASIA, and volunteer of many PyCon around Asia","avatar":"https://coscup.org/2018-assets/img/speakers/s00019.jpg"}},{"id":"c8e3d011-7748-42aa-81ac-f37296fb2f8b","field2":"postgresql-security-issue","subject":"PostgreSQL Security Issue and pgAudit","summary":" 討論有關於 PostgreSQL 的安全性問題，還有日本 PostgreSQL 社群的發展情況。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-database/%2Fcoscup18-database-postgresql-security-issue) ","type":"","room":"501","start":"2018-08-11T14:55:00+08:00","end":"2018-08-11T15:25:00+08:00","speaker":{"name":"多度純一","bio":"PostgreSQL 日本使用者社群於 1999 年成立，能夠提供相當豐富的使用推廣經驗","avatar":"https://coscup.org/2018-assets/img/speakers/s00124.jpg"}},{"id":"350b22d1-89e3-429c-ace8-e607bf4fd42a","field2":"kubernetes-cni","subject":"Kubernetes 網路分析，搞懂所有網路功能以及 CNI 開發","summary":" 介紹 kubernetes 內部跟網路有關的服務背後到底是如何實現，同時也會介紹 CNI 並且說明 CNI 如何提供各種靈活彈性的網路介面功 kubernetes 使用 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-sdn/%2Fcoscup18-sdn-kubernetes-cni) ","type":"","room":"401","start":"2018-08-11T15:00:00+08:00","end":"2018-08-11T15:25:00+08:00","speaker":{"name":"邱宏瑋 (hwchiu)","bio":"Just an engineer\n喜愛研究各類網路知識與系統維運概念，如 SDN/SDS/Kubernetes / 等\n此外也喜歡透過閱讀原始碼的方式來學習各類技術的實現方式\n\n目前也擔任 SDNDS-TW 以及 Cloud Native Taiwan User Group (CNTUG) 的共同創辦人\n定期舉辦相關的 Meetup 來交流學習","avatar":"https://coscup.org/2018-assets/img/speakers/s00142.jpg"}},{"id":"151c624c-d327-4f3e-ab81-abf015f3003b","field2":"swift-dictionary","subject":"探索 Swift Dictionary 實作","summary":" Swift 的 內建 Collection Type (Array, Dictionary) 有許多有趣的特性，\n它們是 Value Type，每一個變數的值都是獨立的，所以不會改了一個變數卻害另外一個也一起變。\n但是在效能方面，卻又能和普通的 Class Type 一樣能夠被快速的修改和複製。\n讓我們一起從程式碼來探索 Swift Dictionary 是如何做到這些實用的特性。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-source/%2Fcoscup18-source-swift-dictionary)","type":"","room":"503","start":"2018-08-11T15:00:00+08:00","end":"2018-08-11T15:30:00+08:00","speaker":{"name":"John Lin","bio":"Lead Engineer at iCHEF. Ruby lover. Full-stack developer. [ErRuby](https://github.com/johnlinvc/erruby) developer. Organizer of Swift Taipei. iOS developer. FP lover. find me at [johnlin.vc](https://johnlin.vc)","avatar":"https://coscup.org/2018-assets/img/speakers/s00030.jpg"}},{"id":"8db4c060-0b69-46af-b600-f4917dc44865","field2":"introduction-to-cassete.jl","subject":"Introduction to Cassete.jl","summary":" \"Cassette is a Julia package that provides a mechanism for dynamically injecting code transformation passes into Julia’s just-in-time (JIT) compilation cycle, enabling post hoc analysis, optimization, and modification of\"Cassette-unaware\"Julia programs.\" We will show some simple usage of Cassette.jl and how it work conceptually. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-julia/%2Fcoscup18-julia-introduction-to-cassete.jl)","type":"","room":"308","start":"2018-08-11T15:10:00+08:00","end":"2018-08-11T16:00:00+08:00","speaker":{"name":"鄭景文","bio":"A regular student in Taiwan","avatar":"https://coscup.org/2018-assets/img/speakers/s00055.jpg"}},{"id":"4cf3bb9b-99f8-4f69-8a37-09624056c52e","field2":"solidity","subject":"用 Solidity 開發高效能智能合約","summary":" 1. 高效能定義\n2. 優化的過程\n3. 優化的技巧 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-blockchain/%2Fcoscup18-blockchain-solidity) ","type":"","room":"302","start":"2018-08-11T15:15:00+08:00","end":"2018-08-11T15:40:00+08:00","speaker":{"name":"陳翊銓","bio":"JOYSO 首席架構師，負責 JOYSO 架構、全端開發與智能合約優化","avatar":"https://coscup.org/2018-assets/img/speakers/s00076.jpg"}},{"id":"5d6c579f-4839-41e7-9384-134c27b674cf","field2":"asia-culture","subject":"把亞洲文化帶進文件基金會","summary":" 在 2015 年的 LibreOffice Conference 中，我發表了台灣導入 LibreOffice 的故事。這次發表不只讓 LibreOffice 國際社群看到台灣的努力，也進一步讓他們想要主動瞭解與將亞洲文化帶進社群。於是我開始扮演這個橋樑，從行銷團隊，認證委員會到董事會，這兩三年來亞洲地區的活力與文化在文件基金會中引發了許多化學變化，也發生了一些有趣的故事…… \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome301-asia-culture) ","type":"","room":"301","start":"2018-08-11T15:15:00+08:00","end":"2018-08-11T16:00:00+08:00","speaker":{"name":"Franklin Weng","bio":"軟體自由協會理事長，文件基金會董事會成員，LibreOffice 認證委員會委員與認證導入專家","avatar":"https://coscup.org/2018-assets/img/speakers/gnomeasiasummit.jpg"}},{"id":"bf2c792e-c387-40de-94ce-ac128a074995","field2":"webassembly","subject":"Web 可用的組合語言 - WebAssembly & 自幹 WebAssembly 虛擬機器","summary":" 隨著 Web Application 的快速發展，WebAssembly 組合語言的規格也被提出，讓網站可以用組合語言增加更多的可能性。\n我覺得在網站上和桌面能有共通的組合語言是很酷的事情\n想和大家分享 WebAssembly ，以及我自幹 WebAssembly 虛擬機器時的發現和心得 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-kernel/%2Fcoscup18-kernel-webassembly) ","type":"","room":"202","start":"2018-08-11T15:15:00+08:00","end":"2018-08-11T16:00:00+08:00","speaker":{"name":"徐朝逸","bio":"剛從成功大學出來的社會新鮮人。 從 Web 前端開始摸，後來不知不覺連後端也一起玩，再下去又沉浸到編譯器和虛擬機器裡去了......","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"e84bcf8a-d093-47a2-a897-162fba2c7faf","field2":"ar","subject":"結合 AR 與人臉辨識之開源戰鬥力探測器","summary":" 是的，就是七龍珠中的戰鬥力探測器。我們做了一款辨識工程師們開源貢獻力的的戰鬥力探測器，可以透過人臉來探測身邊的開源大大。本次分享分為幾個部分：\n1. 人臉辨識技術\n2. 前端 Augmented Reality 即時顯示\n3. 消夜垃圾話中誕生的 side project，從無到有的過程與收穫分享 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-ar) ","type":"","room":"101","start":"2018-08-11T15:20:00+08:00","end":"2018-08-11T16:00:00+08:00","speaker":{"name":"David Chang","bio":"後端工程師 / DevOps，喜歡編寫 bash script 自動化維運過程中的大小事。剛開始投入 Kubernetes 的源碼貢獻與國內社群活動，以及 Kubernetes 相關演討會演講。","avatar":"https://coscup.org/2018-assets/img/speakers/s00040.jpg"}},{"id":"9a54cb02-b141-44d3-b296-497289c1f662","field2":"hack-everything","subject":" Hack Everything, Including Society, 真的嗎？","summary":" 黑客精神真的能改造社會嗎？五年前，我在 coscup 演講「Hack Everything, Including Society」。這五年間，我嘗試用黑客精神的方式，參與社會運動，嘗試倡議與改造社會。五年來，我累積了不少心得，希望可以分享給大家。\n\n五年前的演講：\nhttps://www.youtube.com/watch?v=W4BbHx0G5jE \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc307-hack-everything)","type":"","room":"307","start":"2018-08-11T15:20:00+08:00","end":"2018-08-11T16:00:00+08:00","speaker":{"name":"雨蒼","bio":"自由軟體工作者，公民記者","avatar":"https://coscup.org/2018-assets/img/speakers/s00106.jpg"}},{"id":"431400ed-9832-4d53-88d1-adab10d6e2fe","field2":"influxdb-x-grafana","subject":"Influxdb x Grafana 建立視覺化後台 (以虛擬貨幣交易為例)","summary":" 介紹 Time-series Database Influxdb 以及 Grafana 數據分析儀表板工具來建立數據分析視覺化儀表版。\n虛擬貨幣為近年來熱門的討論話題，其特性是交易為公開性的展示資訊，透過使用這兩項開源工具建立視覺化後台分析交易工具。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-osfarm/%2Fcoscup18-osfarm-influxdb-x-grafana) ","type":"","room":"305","start":"2018-08-11T15:20:00+08:00","end":"2018-08-11T16:00:00+08:00","speaker":{"name":"王雅人","bio":"","avatar":"https://coscup.org/2018-assets/img/speakers/s00127.jpg"}},{"id":"ef7aa7df-9b94-48c8-ae27-d4d788ee2ec7","field2":"mozilla-internet-health-report","subject":"幫網路把個脈： Mozilla Internet Health Report 網路健康報告","summary":" 網際網路發展至今三十多年，究竟是正在步入盛年，或者已經病入膏肓？Mozilla 2018 網路健康報告，帶你自隱私、開放、數位包容、網路素養、去中心化等五個面向，探討自個人體驗至全球規模的 60 個問題。\n\nThe Internet is getting old, or it just grows up? Mozilla Internet Health Report (2018) compilation of research explains what’s helping and what’s hurting the Internet across five issues, from personal experience to global concerns. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-governance/%2Fcoscup18-governance-mozilla-internet-health-report)","type":"","room":"502","start":"2018-08-11T15:20:00+08:00","end":"2018-08-11T15:55:00+08:00","speaker":{"name":"Irvin Chen","bio":"MozTW 社群聯絡人，從平面設計、網站設計開始貢獻 Mozilla，十年的 Mozillian。本職是女人迷 womany.net 前端工程師。目前在 Mozilla 致力於社群經營相關事務，以推廣自由文化與開放網路為職志。","avatar":"https://coscup.org/2018-assets/img/speakers/s00034.jpg"}},{"id":"a297bd03-6ce9-49c7-ae3f-b8bf6ecb29a8","field2":"large-table","subject":"How to alter a large table","summary":" 資料量小的時候編輯表 (alter table) 很簡單。而若 Table 資料量達千萬級且資料庫有讀寫分離的情況下，編輯表 (alter table) 可能會成為你的惡夢。這次的 Talk 將會分享大型資料庫如何克服讀寫分離的 slave lag。如何使用 Open Source 方案 LHM 成功的解決問題。\n\n註: alter table 即對 table 新增、修改欄位或是增加、刪除索引(index)... 等等的動作。\n\n附上 Ruby Conf 2018 閃電秀所分享的投影片\nhttps://hackmd.io/p/BkvjbwyaM#/\n這次我會將內容加強讓非 Ruby on Rails 的開發者也可以了解運作原理，並且順利使用之。\n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-database/%2Fcoscup18-database-large-table) ","type":"","room":"501","start":"2018-08-11T15:30:00+08:00","end":"2018-08-11T16:00:00+08:00","speaker":{"name":"Steven Huang 黃鈞彥","bio":"Backend RD work for Splashtop. I am passionate about building large-scale distributed systems.\n","avatar":"https://coscup.org/2018-assets/img/speakers/s00007.jpg"}},{"id":"e14fb9e0-dd0d-451f-9bad-20f75099a44e","field2":"sed","subject":"Introduction to Self Encryption Disk (SED)","summary":" A brief introduction to Self Encryption Disk (SED), a hardware based full disk encryption (FDE), which is implemented by hard disk vendors confining to the OPAL storage specification developed by the Trusted Computing Group (TCG).\n\nThe SED is not rare or expensive, in contrast, it is relatively easy to find on the market of Solid State Drive (SSD) and is also inexpensive. The feature comes with almost no extra cost (money for real), so why not jump on the boat of encrypting your data through most fancy technology. The talk will let you know about how to identify it.\n\nSecond, since it is about Security, the talk will cover the security concerns, and also comparison with Software based encryption on Linux (LUKS).\n\nThird, the majority of the talk is to give you an idea how to set it up in openSUSE, centered around the tool sedutil and will provide you the information of how to use it to accomplish most common tasks (80/20).\n\nLast, it has always been tricky to boot from encrypted device, as we are not only facing trypical chicken-and-egg situation but also different firmware could impose different constraints. We will talk about the solution provided by SED/OPAL spec and also how to use tools in openSUSE to craft that. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-sed)","type":"","room":"201","start":"2018-08-11T15:30:00+08:00","end":"2018-08-11T15:45:00+08:00","speaker":{"name":"Michael Chang","bio":"Software Engineer at SUSE","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"ca04602e-7d1c-47e1-8df2-d792f0ce5234","field2":"vikube","subject":"Vikube - a kubernetes operation tool in Vim","summary":" This talk introduces you the kubectl operation commands, and the design of the kubernetes operation tool. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-sdn/%2Fcoscup18-sdn-vikube)","type":"","room":"401","start":"2018-08-11T15:30:00+08:00","end":"2018-08-11T15:55:00+08:00","speaker":{"name":"Yo-An Lin (c9s)","bio":"從 2007 年開始投入開放原始碼社群及專案已有十年，專精領域從 UI/UX Design, Visual Design, 前端如 TypeScript, JavaScript, CSS/SASS 等至後端技術如 Perl, Golang, PHP, NodeJs 等等。\n於 2011 年開始使用 Go 程式語言開發工具 ，並於 2012 年將 Go 程式語言應用於正式環境 (Production) ，發布十多個 Go 相關開源專案，為 Golang 核心專案貢獻者之一。\n曾在 Perl 最大的開放原始碼模組平台 CPAN 維護近五十個模組，至今在 GitHub 上開源約兩百多個專案。\n知名專案為 PHPBrew, Maghead (ORM), Pux, CLIFramework 以及如 C 語言開發的高效能路由函式庫 r3。\n其他曾參與貢獻的知名開源專案有 Google Go / HHVM / PHP (Zend Engine) / Jifty Perl Web Framework 等等。\n曾為 2013 年 GitHub top 1 contributions user.","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"6fb2f81c-23e1-43d2-807e-dd8382fd9029","field2":"neural-network-frameworks","subject":"A Taste of Open Source Neural Network Frameworks on Cell Phones","summary":" AI or more precisely neural network-based machine learning is getting popular on edge devices. In this talk I'll review important open source NN frameworks, namely TensorFlow Lite + Android NN and Caffe2. Then I'll walk the audience  through important source code of TenorFlow Lite and Caffe 2. For TensorFlow Lite, the interpreter and sample command line label_image will be covered. The talk will be a heavily modified one of [1] and [2], a much more code-oriented one.\n\n[1] https://www.slideshare.net/kstan2/introduction-to-tensorflow-lite\n[2] https://www.slideshare.net/kstan2/caffe2-on-android \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-source/%2Fcoscup18-source-neural-network-frameworks)","type":"","room":"503","start":"2018-08-11T15:30:00+08:00","end":"2018-08-11T16:00:00+08:00","speaker":{"name":"\"freedom\" Koan-Sin Tan","bio":"Koan-Sin Tan is a veteran open source user who learned to use Unix on VAX-11/780 running 4.3BSD. He was interested in making NN models working cell phone recently. He wrote the label_image for TFLite, the first non-Google C/C++ command line example for TensorFlow Lite.","avatar":"https://coscup.org/2018-assets/img/speakers/s00029.jpg"}},{"id":"335df165-e179-485e-a0bf-01fe6de5f6db","field2":"smart-contract","subject":"如何撰寫可更新的智能合約","summary":" 智能合約一旦部署上區塊鏈便無法修改，因此我們無法替現有的合約增加新功能或修復 bug，相當缺乏彈性。\n但我們可以藉由適當地拆分合約，讓部分合約得以被抽換，達到更新合約的效果。\n讓我用實際範例告訴你如何撰寫可更新的智能合約。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-blockchain/%2Fcoscup18-blockchain-smart-contract) ","type":"","room":"302","start":"2018-08-11T15:40:00+08:00","end":"2018-08-11T16:00:00+08:00","speaker":{"name":"吳冠融","bio":"台大電信所碩士生。本來是弱弱的前端開發者，後來因為挖礦而接觸到區塊鏈與智能合約，現在兼任智能合約與前端開發，成為一個弱弱的 DApp 開發者。","avatar":"https://coscup.org/2018-assets/img/speakers/s00120.jpg"}},{"id":"ee251de4-8973-483d-b4f0-88849326d9ba","field2":"hidpi-support-on-opensuse-leap15","subject":"The status of HiDPI support on openSUSE Leap15","summary":" HiDPI displays are all the rage now, It is not easy to get your Linux scaled correctly in the past. openSUSE Leap15 has pretty good HiDPI support these days, you can enable HiDPI support more easier than before. In this talk I will give a brief introduction of HiDPI and share the status of HiDPI support on openSUSE Leap15 and summarize how to tweak the scaling factors for YaST Installer, Grub2(on both Legacy and UEFI mode), GDM, GNOME Session, SDDM, KDE Plasma, other apps (on both X and Wayland), some known issues and the support of fractional scaling from a Desktop user's perspective.\n\nHopefully this talk will help some openSUSE users to get their life with a HiDPI screen more pleasant.\n\nAbout the Speaker: \nMy name is Chingkai Chu, I am a software engineer from Beijing SLE Desktop Dev&QA Team. This talk is based on a HiDPI testing for SLED15 and openSUSE Leap15 in my team. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-hidpi-support-on-opensuse-leap15)","type":"","room":"201","start":"2018-08-11T15:45:00+08:00","end":"2018-08-11T16:00:00+08:00","speaker":{"name":"Chingkai Chu/朱庆凯","bio":"My name is Chingkai Chu, I am a software engineer from Beijing SLE Desktop Dev&QA Team.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"d11dcf00-a343-4fe4-ad2c-d1debf9655f8","field2":"the-bright-future-of-suse-and-opensuse","subject":"The bright future of SUSE and openSUSE","summary":" \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-the-bright-future-of-suse-and-opensuse) ","type":"","room":"101","start":"2018-08-11T16:10:00+08:00","end":"2018-08-11T16:40:00+08:00","speaker":{"name":"Ralf Flaxa","bio":"As President of Engineering for SUSE, Ralf Flaxa is responsible for leading the global team of engineers that develop SUSE solutions.\n\nFlaxa joined and has contributed to the Linux community since 1991, and has over 15 years of international management experience working for global organizations building Linux products. In 2002, he joined SUSE, and later Novell, where he has held various engineering management roles related to the delivery of SUSE solutions, such as SUSE Linux Enterprise Server and openSUSE®.\n\nFlaxa holds a Master’s degree in Computer Science from Friedrich-Alexander-Universität Erlangen-Nürnberg, Germany.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"4999ddd0-0258-4285-a4fe-8fc6e59c9de1","field2":"the-dexon-network","subject":"The DEXON Network - The Infrastructure of the Internet’s Decentralized Future","summary":" Current blockchain technology suffers from transaction latency, high transaction cost and centralized limitations. The new generation blockchain technology uses parallel blockchain systems that work together to form an infinitely scalable, low-latency decentralized transaction processing engine. This will resolve the existing pain points today and upgrade blockchain technology to the next level with mass adoption to all. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-the-dexon-network)","type":"","room":"101","start":"2018-08-11T16:40:00+08:00","end":"2018-08-11T17:10:00+08:00","speaker":{"name":"Popo Chen","bio":"Popo is a 27-year-old serial entrepreneur with several successful exits. He founded 17 Media, a leading live streaming platform across Asia, and cashed-out at a 200M USD valuation in 2 years. He also founded COBINHOOD, the cryptocurrency service platform for the blockchain era which launched the world’s first zero trading fee cryptocurrency exchange, ranking top-30 in terms of global trading volume. With his eyes set on materializing the future-proof infrastructure of the decentralized internet, he also founded DEXON Foundation, an organization which leads the development of the infinitely scalable decentralized technology, the DEXON network.","avatar":"https://coscup.org/2018-assets/img/speakers/s00131.jpg"}},{"id":"3cd7a811-9700-4952-b086-8f5d69553d97","field2":"lightning-talk","subject":"Lightning Talk","summary":" Join the famous COSCUP Lightning Talk, show your project / idea / experience In 3-5 minutes! **Please register your topic at the information desk (1F) before 15:30**, we will pick the final list and update the website at 16:00。\n\n在 COSCUP 地位幾乎等同於新八眼鏡的閃電秀 -- Lightning Talk，現場報名、當天抽籤、限時演講！兼具知識性與娛樂性的重頭大戲，千萬別錯過了~\n\n每場次 3-5 分鐘，請有興趣參與演講的人於 10:00-15:30 間至一樓服務台提供稱呼、題目、聯絡方式等資料報名。16:00 前將進行抽籤並於此公布最後入選名單\n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-lightning-talk)","type":"","room":"101","start":"2018-08-11T17:10:00+08:00","end":"2018-08-11T18:00:00+08:00","speaker":{"name":"Staff","bio":"COSCUP x GNOME.Asia x openSUSE.Asia Staff","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"e71acdf9-31d5-49f3-adbf-92c0f6f35b2e","field2":"bof","subject":"BoF Sessions - Powered by COBINHOOD x DEXON","summary":" Venue information:\n\n* COBINHOOD Booth (1F) : COBINHOOD + DEXON\n* Room 202: Taiwan Linux Kernel Hackers\n* Room 301: Ubuntu-TW\n* Room 304: openSUSE.Asia + openSUSE Taiwan\n* Room 306: GNOME 之夜\n* Room 307: Arch Linux Taiwan & Archers、開發板、開源硬體大亂鬥\n* Room 308 Cloud Native x SDN | CNTUG, sdnds-tw, golang, DigitalOcean Hsinchu\n* Room 401: 台大開源社、SITCON 學生計算機年會\n* Room 501: Taiwan Wikimedia Community, LIT Team 李梅樹紀念館資訊組\n* Room 502: 科技社群如何參與科技政策規劃 | sense.tw + Wikipdia TW + KaLUG + 樹黨\n* Room 503: 中區飛起來、交大資工同學會、台科資工地主同樂會\n\n\nhttps://docs.google.com/document/d/14I51R_FauCe9kwhz3vd1EQhnlNS6ALh9OksNtc3aH9Y/edit\n\n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-bof)","type":"","room":"101","start":"2018-08-11T18:00:00+08:00","end":"2018-08-11T21:00:00+08:00","speaker":{"name":"Staff","bio":"COSCUP x GNOME.Asia x openSUSE.Asia Staff","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"09ff5f82-c42a-45f1-aaa3-6f983452cba0","field2":"welcome-to-year-22","subject":"Welcome to Year 22","summary":" GNOME is turning 21 this year. During this time, GNOME has grown to become one of the leading Free desktops in the world and has incubated many other core Free Software technologies used by outside projects. Our mission is to make software that is accessible to all, and we need your help to do it. Come learn more about what makes GNOME special, some of the plans we have for the upcoming year, and how you can become part of the GNOME story. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-welcome-to-year-22)","type":"","room":"101","start":"2018-08-12T08:50:00+08:00","end":"2018-08-12T09:20:00+08:00","speaker":{"name":"Kat","bio":"Kat has been a user of Free/Libre software for over a decade and it did not take her long to start contributing. She joined the GNOME project as an intern with the documentation team and GUADEC organiser. Shortly after, she started mentoring interns and becoming involved in other areas of GNOME and joining other teams. Since then, her work has included being on the Board of Directors and the documentation team lead. Kat currently works as QA Lead at Collabora, promoting use of Free/Libre software in her every day work.","avatar":"https://coscup.org/2018-assets/img/speakers/gnomeasiasummit.jpg"}},{"id":"e55caf86-d0e9-4d86-b750-6c0cb03f6d31","field2":"blockchain-internet","subject":"區塊鏈加互聯網的六個維度","summary":" 區塊鏈雖然是當下熱點，但並非萬能。巧妙借鑑區塊鏈的思想，通過創新性的技術架構與實現手段，可以解決本時代互聯網存在的嚴峻問題。陳榕先生作爲操作系統專家，曾長期參與微軟操作系統的開發，此後創業自主設計了 開源的 Elastos 項目，並得到鴻海集團 3000 餘萬美金投資支持，已經成爲由區塊鏈技術驅動的、開源分佈式、适應物聯網時代的新型網絡操作系統。Elastos 項目目前已經開源了 2000 万行代碼，並將半數以上的 token 用於開源社區、開源代碼的持續建設。Elastos 代表了 Smart Web 發展方向，集中關注在 ID 身份認證、Token 價值存證、可控複製保護稀缺、共識機制、去運營中介、去運行中介這 6 個維度。重點通過開源的 carrier 模塊，建設安全網絡，減少和避免數據洩露、冒用、DDOS 攻擊；通過開源的 Runtime 模塊，爲 DAPP 提供安全的運行環境，將區塊鏈的權益傳遞到手機安全運行。通過設立無 Daemon、無驅動、無上網能力的虛擬機，秉持「上網不計算、計算不上網」的原則，通過精妙的技術代碼，加上開源社區的持續貢獻，從而構建了一個保證安全、傳遞程式因而傳遞價值、開源而皆可參與的新一代網絡。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-blockchain/%2Fcoscup18-blockchain-blockchain-internet) ","type":"","room":"302","start":"2018-08-12T09:30:00+08:00","end":"2018-08-12T10:00:00+08:00","speaker":{"name":"張玉新","bio":"張玉新先生在清華大學獲工學學士及管理學碩士後，先後從事諮詢與 IT 管理工作，在世界 500 強石油公司工作十年以上。張先生同時是免費開源軟體的資深互聯網佈道師，知名中文博客。現在亦來雲專案任執行顧問及物聯網應用負責人。","avatar":"https://coscup.org/2018-assets/img/speakers/s00072-2.jpg"}},{"id":"7f697e2c-5353-4049-9c9d-3b0f639ba5db","field2":"an-introduction-from-our-hosts","subject":"An introduction from our hosts","summary":" Introduction \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-compliance/%2Fcoscup18-compliance-an-introduction-from-our-hosts) ","type":"","room":"503","start":"2018-08-12T09:30:00+08:00","end":"2018-08-12T09:35:00+08:00","speaker":{"name":"Lucien C.H. Lin / 林誠夏 / Shane Coughlan","bio":"Lucien Cheng-hsia Lin（林誠夏）, has been doing the FOSS licenses research and study from 2005 to 2016 when acted as an academic professional in the project “OpenFoundry\"hosted in Academia Sinica, which is a FOSS web-hosting service platform based on Subversion and Request Tracker. He is best known for being the main proposer and drafter of the\"Open Government Data License Taiwan 1.0\"(https://data.gov.tw/license), with an one-way CC BY 4.0 switching mechanism implemented, which can make most of the materials on Taiwan Open Data portal be used under CC BY 4.0 license. Besides that, he has been participating in the Open Source, Open Data, and Creative Commons Licenses interpretation and clarification among the local communities, official agencies, and companies in Taiwan for more than 10 years. And now he is engaging to build the Taiwan Open Source Legal Network in the position of legal adviser both of Open Culture Foundation and Gemly Int'l Intellectual Property Right Office for facilitating FOSS licensing knowledge exchange and FOSS ecosystem establishment in Taiwan. / 林誠夏 (Lucien C.H. Lin)，知識背景為科技法律，05-16 年間任職於中央研究院從事公眾授權模式的研究，近年的研究成果包括：協助歐洲自由軟體基金會，擔任自由開源軟體法律參考書台灣專章的編撰作者、參與國家發展委員會就「政府資料開放授權條款」第一版本的討論與編撰，並應臺灣數位文化中心籌備計畫邀請，協助台中市文化局研擬制定「臺中自由文化授權條款」及「臺中開放文化授權條款」，裨利用於開放文化領域的素材流通。目前於鈞理知識產權事務所，以及開放文化基金會擔任法制顧問，撥付工作之餘的心力營建國內開源授權知識的分享網絡 (Open Source Legal Network, Taiwan)，本年度並同時擔任國發會、文化部，以及陸委會政府資料開放諮詢委員。\n---\nShane Coughlan is an expert in communication, security and business development. His professional accomplishments include spearheading the licensing team that elevated Open Invention Network into the largest patent non-aggression community in history, establishing the leading professional network of Open Source legal experts and aligning stakeholders to launch both the first law journal and the first law book dedicated to Open Source. He currently leads the OpenChain community as Project Director.\n\nShane has extensive knowledge of Open Source governance, internal process development, supply chain management and community building. His experience includes engagement with the enterprise, embedded, mobile and automotive industries.","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"c6fe3317-1cef-4a3d-9354-7241b9bbe4c2","field2":"elastic-stack","subject":"基于 Elastic Stack 的大数据分析","summary":" Elastic Stack（github.com/elastic）是时下非常新颖的一个开源的大数据分析和可视化交互平台，包括 Elasticsearch、Logstash、Kibana 和 Beats 这 4 个主要的开源组件，可以为用户提供各种便利的分析能力和可视化展现效果，本次分享将介绍 Elastic Stack 的使用以及结合 Demo 来具体介绍如何使用  Elastic Stack 进行数据分析的方法。\n\n演讲主题包括以下几个方面：\n\nElastic Stack 项目历史；\nElastic Stack  基本概念；\nDemo 演示；\nKibana Canvas；\nKibana Geo 地理位置分析。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-data/%2Fcoscup18-data-elastic-stack) ","type":"","room":"202","start":"2018-08-12T09:30:00+08:00","end":"2018-08-12T10:20:00+08:00","speaker":{"name":"曾勇","bio":"曾勇（Medcl），Elastic 技术布道师，在分布式搜索、高性能、高可用架构、自动化运维等方面积累多年的经验。Elastic 中国开源社区负责人。阿里云 MVP。开源软件爱好者。","avatar":"https://coscup.org/2018-assets/img/speakers/s00069.jpg"}},{"id":"d7d0ded3-875a-476a-a3aa-c16073386110","field2":"postgresql-mysql","subject":"1. 利用 PostgreSQL 作圖形相似度計算 2.PostgreSQL 與 Oracle / MySQL 協作","summary":" 1. 載入圖形資料取特徵作相似度比對 2. 外部資料源的操作及快速對映的方法 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-database/%2Fcoscup18-database-postgresql-mysql) ","type":"","room":"501","start":"2018-08-12T09:30:00+08:00","end":"2018-08-12T10:00:00+08:00","speaker":{"name":"張友謙","bio":"一位大叔","avatar":"https://coscup.org/2018-assets/img/speakers/s00091.jpg"}},{"id":"b1225ec0-b594-4a94-bcdc-b14eb2a4906b","field2":"urban-analytics","subject":"Urban Analytics - 如何透過空間資料閱讀城市","summary":" 近年來因行動裝置普及與資料開放意識抬頭，都市裡的各式空間資料快速的累積與開放，打破了過去資料難以取得的困境，並為” 都市科學” 這一新領域創造了新的潛力。這些空間資料只是一些數字的組合與排列，我們往往很難單從資料本身提出甚麼洞見，但透過空間分析、資料視覺化等方式將不同類型的資料交互整合，我們得以從中更深入探究城市運作的潛在邏輯。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gis/%2Fcoscup18-gis-urban-analytics) ","type":"","room":"305","start":"2018-08-12T09:30:00+08:00","end":"2018-08-12T10:00:00+08:00","speaker":{"name":"陳彥佑","bio":"地理資訊分析師，熱愛地圖、都市、咖啡","avatar":"https://coscup.org/2018-assets/img/speakers/s00079.jpg"}},{"id":"574c71fb-6235-462d-9e82-06b76c7e3b36","field2":"team-silverblue","subject":"Introducing Team Silverblue","summary":" I will present Team Silverblue, a new project in Fedora that brings together a number of technologies from the GNOME sphere (ostree, rpm-ostree, flatpak) in a container-focused developer workstation product. In this presentation, I will talk about the goals of the project and show what we have achieved so far. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome301-team-silverblue)","type":"","room":"301","start":"2018-08-12T09:30:00+08:00","end":"2018-08-12T10:15:00+08:00","speaker":{"name":"Matthias Clasen","bio":"Matthias is a manager in the desktop team at Red Hat. He is a member of the GNOME release team and has been involved in GNOME for many years.","avatar":"https://coscup.org/2018-assets/img/speakers/s00024.jpg"}},{"id":"ecbc4d29-ad26-436f-8896-a2599129d82c","field2":"growing-community-with-open-source","subject":"Growing Community with Open Source: Mothers and Housewives's GNOME and LibreOffice Training.","summary":" My current project called Perempuan Sadar Teknologi (Women Awareness in Technology). It is a movement to help, intoduce and teach woman, especially housewives and motherhood to understand the latest technology or nearest technology around them. I believe that technology should give a social impact.\n\nAs housewives, day always start too early and ended too late. They managed the houses but also want to keep up with technology for knowing that it is will bring their child a better future. For some reason, including that their time is not as free as students, they accept this challenge. This movement taken place in Family Welfare Movement (Pembinaan Kesejahteraan Keluarga) to help the housewives and mother to have basic skill on using open souce (GNOME) and Libre Office, knowing that they have so many options to start their laptop.\n\nThis talks cover the step of approaching a local community to start use GNOME and LibreOffice as well as use it on daily basis, the struggle of housewive and motherhood with no experience in using GNOME at all, and their progress to be familiar with GNOME. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome306-growing-community-with-open-source)","type":"","room":"306","start":"2018-08-12T09:30:00+08:00","end":"2018-08-12T10:15:00+08:00","speaker":{"name":"Siska Iskandar","bio":"From 2011, I’ve been focused for help and contribute on increasing awareness of women in technology especially in Open Source. We help them by teach and introduce them to newest technology or the explain the nearest technology around them. After attending several events about open souce, I joined GNOME Foundation in 2015.","avatar":"https://coscup.org/2018-assets/img/speakers/s00008.jpg"}},{"id":"452f62b9-5d0c-4b12-88cb-2249e79e8b42","field2":"iot-microtransaction","subject":"IoT Microtransaction and its Accelerator (針對物聯網的微型交易系統及加速器)","summary":" In terms of IoT, the bigger issue is volume and whether the financial system is going to be ready to accept this as devices start to charge for services at a micro-level. With IOTA, you can ensure the fulfilment of the smallest tasks in the unified network; turning off the tap in the bathroom, sticking on a tag, or at least blowing away a speck of dust. This session will cover the considerations of adopting IoT and crytocurrencies along with feasible approaches to accelerate the whole transactions, which shape the machine economy by building a portfolio of companies that literally meet the needs of machines. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-iot-microtransaction)","type":"","room":"101","start":"2018-08-12T09:30:00+08:00","end":"2018-08-12T10:20:00+08:00","speaker":{"name":"黃俊毓","bio":"BiiLabs senior engineer","avatar":"https://coscup.org/2018-assets/img/speakers/s00067.jpg"}},{"id":"2e5d902e-e1c1-4a41-b252-2aa0c402b147","field2":"my-opensuse-journey","subject":"My openSUSE Journey","summary":" How someone from the other side of the world ended up on the openSUSE Board.\r\n\r\nIn this talk I will wander through my journey and experiences in the openSUSE project, and how over an 8 year period someone from the other side of the world to most contributors (Adelaide, Australia) ended up on the board of openSUSE.\r\n\r\nThrough this talk i'll cover many parts of the openSUSE project, how they work, how I got involved along with how others can get involved. Covering various areas like providing support through forums, irc and email through to getting involved with development in areas such as packaging and translating, focusing on the concept that anyone can be involved.\r\n\r\nIf the conference organizers would like a keynote from an openSUSE board member, I will be the person who will give the keynote this year and I will use this talk, otherwise i'm happy for to have it as a normal talk. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-my-opensuse-journey)","type":"","room":"201","start":"2018-08-12T09:30:00+08:00","end":"2018-08-12T10:00:00+08:00","speaker":{"name":"Simon Lees","bio":"Simon is a member of the openSUSE board from\r\nAdelaide, Australia. He has been involved in various parts of openSUSE\r\ndevelopment for the last 7 years and currently works for SUSE in one of\r\nthe maintenance / packaging teams. He is also a Release manager for the\r\nEnlightenment desktop.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"da476819-2c42-45d7-82b6-f1d05d58eccf","field2":"using-latest-libreoffice","subject":"Using latest LibreOffice on openSUSE Leap 15","summary":" LibreOffice is a feature-rich, open-sourced office productive suite and is one of the critical parts of Linux desktop like openSUSE.\n\nConsumer products, like LibreOffice, have to keep continuous evolve to catch end-users' desire than server-side software which is preferred to be more stable than features added. Thus, LibreOffice takes time-based release policy of performing major release with functional additions every six months.\n\nSometimes you may want to use newer LibreOffice (includes daily build or beta/RC testing build) than pre-packaged version shipped with openSUSE Leap 15 (Leap 15 provides latest \"Fresh\" LibreOffice 6.0 at the moment (June), but 6.1 will be released August). Of course, you can use TDF build RPM package instead of openSUSE package, but you can do this quickly with modern packaging systems, like Flatpak, AppImage or Snap. Additionally, you can also use several versions parallelly with them.\n\nIn this talk, I would like to introduce these ways and pros/cons of the packaging systems on openSUSE Leap 15. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-using-latest-libreoffice)","type":"","room":"304","start":"2018-08-12T09:30:00+08:00","end":"2018-08-12T10:00:00+08:00","speaker":{"name":"小笠原 徳彦 Naruhiko Ogasawara","bio":"Naruhiko Ogasawara is a member of the LibreOffice Japanese team, and also a member of The Document Foundation; the charitable foundation which is home of LibreOffice. Mainly my responsibilities are organizing UI translations, outreaching LibreOffice in Japan, e.g. exhibit Japanese local FLOSS events, etc. And several years ago I had been a translator of openSUSE Weekly News. Sorry I'm not a user of openSUSE, but I use Ubuntu as a usual desktop environment. I love FLOSS desktop technologies.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"65564f60-c4c3-4f18-8201-9bb92030a70d","field2":"opensource-commericial","subject":"如何處理個人開源專案與公司商業目標的關係？","summary":" 絕大多數自己在進行與維護的開源專案，往往都和在公司工作內容不太有關係，可能是擔心在公司外做與公司有關的開源專案，可能會引來不必要的法律糾紛，同時還有職業道德層面的考量，這些都無可厚非。然而隨著科技日新月異，知名且穩健的開源專案與技術，也逐漸在各家公司中的產品與服務占比越來越高，開發人員不得不更多的了解和參與到各種開源專案之中，身為這個時代的開發人員兼開源愛好者，如何兼顧公司商業需求與開源專案維護，又不傷害到兩者呢？\n\n在討論之前，會先由講者 fatfingrererr 簡單介紹他於 2016 年起於公司內部推行「員工個人開源專案開發承諾書」的心路歷程，由於公司自 2015 年起開始採用許多開源專案，作為內部演算法計算的支援模組，然而當研發人員想改進支援模組時，就會遇到是否合適向開源專案提 PR 的兩難。\n\n在經過一連串與公司法務、主管的討論後，逐漸建立了一份「員工個人開源專案開發承諾書」，雖然可能不適用於所有行業的情況，但是其中的來來回回的各種討論，相信非常值得大家來了解。\n\n至 2017 年 GitHub 公布了一份 BEIPA 平衡員工智慧財產權同意書（Balanced Employee Intellectual Property Agreement，簡稱 BEIPA），鼓勵員工在自由時間進行自己的開源專案，並且不用擔心與公司產生糾紛。因此講者最終結合了 BEIPA 與先前的承諾書，最終定版了一份同意書，在公司內部已經使用 5 個月至今。\n\n如果你對於方面的主題有興趣了解與討論，歡迎來這個講題一起參與！ \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-oss/%2Fcoscup18-oss-opensource-commericial) ","type":"","room":"401","start":"2018-08-12T09:30:00+08:00","end":"2018-08-12T10:15:00+08:00","speaker":{"name":"fatfingrererr","bio":"LISP 愛好者、Emacs 使用者，喜愛閱讀各種 LISP 中與數學有關的開源函式庫，離開 3C 只會吃喝拉撒睡，精神好會去閱讀歷史與哲學的書籍","avatar":"https://coscup.org/2018-assets/img/speakers/s00037.jpg"}},{"id":"58e1bd55-2feb-4f7b-a69e-ec6b855629d0","field2":"integrate-adfs-or-azure-ad-with-rails","subject":"Integrate ADFS or Azure AD with Rails","summary":" AD(Active Directory) 是微軟的權限管理體系，大型企業常常使用 AD 來做權限的管理。我們如果可以跟 AD 介接，那麼企業在成為我們客戶的同時，還能夠自行管理企業內部員工的帳號權限。本次分享，將介紹 Rails 如何使用 SAML 協定，整合企業的 AD、ADFS 與 Azure AD。\n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-ruby/%2Fcoscup18-ruby-integrate-adfs-or-azure-ad-with-rails) ","type":"","room":"502","start":"2018-08-12T09:30:00+08:00","end":"2018-08-12T10:00:00+08:00","speaker":{"name":"Steven Huang 黃鈞彥","bio":"Backend RD work for Splashtop. I am passionate about building large-scale distributed systems.\n","avatar":"https://coscup.org/2018-assets/img/speakers/s00007.jpg"}},{"id":"cae3c6cb-1c6d-4c9f-bff2-84f1a5191bc7","field2":"open-source-licensing-makes-a-difference","subject":"Open Source Licensing makes a Difference / 開源授權就是不一樣","summary":" From its rise to becoming an indispensable part of many industries nowadays, Open Source Software (OSS) has only been developed for about 30 years. How come OSS can be developed so rapidely and spread so widely in this short time. Its licensing model, which is different from the past common software licensing model, plays an important role. This kind of licensing model allows users to copy, modify and distribute software directly, without asking the owner of a software for permission additionally. OSS can hence easily be modified and implemented in different industries. Speaker will accordingly introduce the characteristics of OSS licensing model and the related actual articles in OSS licenses. Besides, the commonly used OSS licenses and the differences between these licenses will also be talked about. This talk serves as the introduction of this track and will be held in Chinese so that the majority of audience can better understand the content of the talk and the following sessions.  / 開源軟體從崛起、受到矚目，再到目前許多產業已經不能沒有它的狀況，僅短短發展二、三十年，為什麼開源軟體的發展可以這麼快速？其中一個重要的原因就是它擁有不同於以往的授權模式。開源授權模式允許使用者可以直接重製、修改與散布軟體，而不需要再額外徵詢軟體所有權人的同意，開源軟體因此很容易被改進以及被運用到不同的地方。本場次因此將會介紹開源授權的特性，白話地說明其在授權條款上是如何被實際規定出來，同時也會簡介常見的開源授權條款，以及這些條款間的重大差異。本場次是這個議程軌的基礎導論，用以協助會眾了解接下來的議程內容，所以本場次會以中文進行。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-compliance/%2Fcoscup18-compliance-open-source-licensing-makes-a-difference)","type":"","room":"503","start":"2018-08-12T09:35:00+08:00","end":"2018-08-12T10:10:00+08:00","speaker":{"name":"Florence T.M. Ko 葛冬梅","bio":"Florence T.M. Ko (葛冬梅) is the co-founder of Taiwan Open Source Legal Nrtwork (OSLN Taiwan) and a freelancer with specilty in Free and Open Source Software Licensing (FOSS Licensing). She often introduces the international resources of FOSS Licensing into Taiwan, and organised many important events related to FOSS Licensing in the past. Besides, she is also highly interested in public licensing, such as Creative Commons and Open Data. During 2005-2015, Florence worked at OpenFoundry in Academia Sinica, Taiwan. For many years, she was the editor and writer of \"Legal Column\" on OSSF newsletter, which is the official publication of OpenFoundry. For more details about Florenc's resume please see: http://tw.linkedin.com/in/florencetmko / 葛冬梅（Florence T.M Ko）目前為自由工作者、台灣開源法律網絡 (Taiwan Open Source Legal Networkp, OSLN Taiwan) 的共同發起人，專長在於解析自由開源授權條款內容。她經常將國際上自由開源授權相關的資源介紹到台灣，也舉辦過多場以自由開源授權為主題的重要活動。而除了開源授權外，她對創用 CC、開放資料等公眾授權模式的議題，也具有高度興趣。葛冬梅在 2005-2015 年間任職於中央研究院自由軟體鑄造場，曾擔任鑄造場電子報上「法律專欄」的編輯與固定撰稿人多年。葛冬梅進一步個人資訊請見： http://tw.linkedin.com/in/florencetmko","avatar":"https://coscup.org/2018-assets/img/speakers/s00062.jpg"}},{"id":"8177ee69-e154-4926-862e-92b64ad2660f","field2":"qgis-with-python","subject":" QGIS with Python, feat. footprint of FOSSASIA in 9 Years","summary":" 由於大家都是 GIS 的專家，但我並非地理資訊背景的專業，因此，我想就程式語言的部分來連結 GIS 應用來和各位分享。\n\nQGIS(舊稱 Quantum GIS) 是非常方便的跨平台 GIS(Geographic Information System) 自由軟體，大多時候拿 QGIS 來看地圖疊地圖套地圖都十分方便，但除了 QGIS 提供的功能外，其實 QGIS 中有一個十分方便的 Python Console，讓 Python 的使用者很方便的可以編寫一些套件。\n\n這次 talk 中，我會非常簡單的介紹一下 Python，簡單的說明程式語言的架構，並分享如何用 Python 來和 QGIS 產生互動。其中，我會介紹如何用 Python 呈現 GIS 相關的應用，並會使用我參與的社群：FOSSASIA(一個推廣、分享、貢獻 FOSS 精神的非營利組織) 的社群活動、會議的舉辦地點當作範例，介紹如何在 Python 中以及 QGIS 上呈現 FOSSASIA 這 9 年多來在全世界點點滴滴的軌跡。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gis/%2Fcoscup18-gis-qgis-with-python) ","type":"","room":"305","start":"2018-08-12T10:00:00+08:00","end":"2018-08-12T10:45:00+08:00","speaker":{"name":"Noah Chen","bio":"Noah, volunteer of FOSSASIA, and volunteer of many PyCon around Asia","avatar":"https://coscup.org/2018-assets/img/speakers/s00019.jpg"}},{"id":"2b4c7e45-df16-47ae-abdb-e04e53a77176","field2":"xdp","subject":"XDP: Unleash The Power of Network Card","summary":" In the recent years, eBPF is extended across several other fields besides networking in Linux kernel, such as tracing, security, and error injection, and eXpress Data Path (XDP) leads the attention back to networking. Previously, eBPF is used in the generic network stack, and XDP goes further to integrate eBPF into the network drivers. With XDP, it's possible to dynamically inspect the packets right after harvesting them from the network cards. This is especially useful when dealing with the DDoS attack because the packets from the attackers are useless to the whole system, and it's better to drop them as early as possible to save the processing power. Furthermore, the newly merged AF_XDP patch set allows the user to do the zero-copy access to the packets, and this could bring more performance improvement to the userspace program. In this talk, I'll introduce the concept of XDP, the related mechanisms, and the recent updates in Linux upstream. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-xdp)","type":"","room":"201","start":"2018-08-12T10:00:00+08:00","end":"2018-08-12T10:30:00+08:00","speaker":{"name":"Gary Lin","bio":"Gary Lin is a SUSE engineer and long time linux user. He participated openSUSE\ngnome development and mainly focuses on UEFI related issues now.\n","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"06ffc4ef-fcb7-4f03-bb6d-ccec92eed756","field2":"mongodb","subject":"MongoDB 新里程 - 新事務性模式","summary":" MongoDB 4.0 將支持多文檔事務, 未來 MongoDB 將成為唯一能夠同時支持速度、靈活性和 ACID 數據完整保證的資料庫。\nACID 多文檔事務，可以理解為關係型數據庫的多行事務。在關聯式資料庫的事務支持中，大家幾乎無一例外支持同一事務內操作的原子性，即要就全部提交 (Commit)，否則全部回滾 (Rollback)。這個同一事務內可以有多個操作，針對於多個表，或者是同一個表內的多行數據。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-database/%2Fcoscup18-database-mongodb)","type":"","room":"501","start":"2018-08-12T10:05:00+08:00","end":"2018-08-12T10:45:00+08:00","speaker":{"name":"陳進賢","bio":"Mongoing 中文社群台北分會主席\n具有十多年的軟體開發及開源數據庫的推廣經驗。目前負責歐立威科技技術顧問團隊相關業務，致力於開源軟件推廣及提供企業解決方案，專長為大數據資料平台系統規劃、設計、分析、技術諮詢及教育訓練服務，應用領域涵蓋電信、金融、零售及高科技製造產業… 等。","avatar":"https://coscup.org/2018-assets/img/speakers/s00074.jpg"}},{"id":"48366167-d7e2-4a6f-9b70-969f0ba793f8","field2":"software-supply-chain-and-oss","subject":"Software Supply Chain and OSS","summary":" Modern software development projects are based on network of software module providers. The software providers will be:\n\n- Software platform (such as Operating System) providers\n- Middleware providers\n- Software development kit providers such as semiconductor vendors\n- Outsourcers of software development\n- ODM/OEM manufacturers\n\nSome of those parties may be Open Source Software (OSS) development communities which will surely provide OSS.  Some of them will also have possibilities to include OSS into their works.  If some of them do not use OSS appropriately what will it become?  In this session, we would like to consider the problem of software supply chain from view point of the appropriate use of OSS with some recommendations to the parties belonging to the supply chain. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-compliance/%2Fcoscup18-compliance-software-supply-chain-and-oss)","type":"","room":"503","start":"2018-08-12T10:10:00+08:00","end":"2018-08-12T10:50:00+08:00","speaker":{"name":"Satoru Ueda","bio":"From early 2003, Satoru Ueda has been engaged in a project to widely use Linux for consumer electronics appliances and IoT devices. In the project he has been supporting to establish and enhance collaborative relationship between the community and the embedded system developers. As from 2012 to 2017, he participates in the Keio university Leading Graduate School program as the Project Professor (in charged for education) and considering the value of open community for the innovation. The challenge to harmonize with community and many Consumer Electronics products related companies is based upon his past experience of product planning and marketing for UNIX workstation and research of ecology of independent film making community.","avatar":"https://coscup.org/2018-assets/img/speakers/s00011.jpg"}},{"id":"f3e298d2-e567-48ef-a1ed-af39f01061f3","field2":"thread","subject":"我只是想抓即時交易資料，怎麼跌到 thread 去了？！","summary":" 工作上專案的需求需要不停從交易所抓即時資料回來，這時候我們選用了公司同事本來就已經寫好的 gem mcoin 來解決我們這方面的需求，為了能夠了解他到底做了什麼事而看了程式碼卻發現........ 頭腦壓根沒有 thread 這個概念。\n我希望能夠讓像我一樣沒有這些概念，但是想成為，或是已經成為菜鳥工程師的人能夠減少我在碰到這一塊的時候的滿頭問號，而且知道在 ruby 中要如何應用。\n以下是主要內容：\nThread 的存在意義。\n為什麼要用到 queue。\n為什麼要讓 thread sleep。\n並行和並列的差別。\n現在電腦速度那麼快，真的會有差別嗎? \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-ruby/%2Fcoscup18-ruby-thread) ","type":"","room":"502","start":"2018-08-12T10:10:00+08:00","end":"2018-08-12T10:40:00+08:00","speaker":{"name":"Telsa","bio":"一個大學畢業後十年沒碰程式, 某天被雷劈到又回來的非典型工程師。\n目前是五倍紅寶石的工程師。","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"685c0f32-75cc-44f2-9bcf-064c6630df20","field2":"browser-and-oss","subject":"瀏覽器原理與開源經驗","summary":" Mozilla 的 Servo 專案是新一代瀏覽器引擎。演講將分兩部分，先介紹原理、談一下進階的實作方式，再分享過去我在開源上的心路歷程。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-oss/%2Fcoscup18-oss-browser-and-oss) ","type":"","room":"401","start":"2018-08-12T10:15:00+08:00","end":"2018-08-12T11:00:00+08:00","speaker":{"name":"劉安齊","bio":"軟體工程師。以 ＠tigercosmos 活躍於網路世界。喜歡分享程式開發知識，著有多篇技術文，並經營有「微中子」科技分享臉書粉專。喜歡開源，參加多項開源專案，並熱衷貢獻。目前著重研究與開發網路瀏覽器。喜歡分享軟體開發經驗與教人寫程式。","avatar":"https://coscup.org/2018-assets/img/speakers/s00058.jpg"}},{"id":"33c652ea-af5f-467a-a7f4-a786607ff7b1","field2":"ignite","subject":"IGNITE 分布式數據庫 – 在電子商務即時報表查詢應用","summary":" Apache Ignite 以內存為中心的分布式數據庫, 提供完整 T-SQL 語法查詢, 容錯與負載平衡, 易於擴展與部屬; 同時介紹在這樣的平台背後, 如何做到由” 數據” 驅動的報表即時分析. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-ignite)","type":"","room":"101","start":"2018-08-12T10:25:00+08:00","end":"2018-08-12T11:15:00+08:00","speaker":{"name":"SAM","bio":"BI System Administrator","avatar":"https://coscup.org/2018-assets/img/speakers/s00013.jpg"}},{"id":"afa84948-fd8f-4e03-9ee1-e65ec248e5fa","field2":"wiki-map","subject":"維基教我做的金頭腦：知識圖譜製作初體驗","summary":" 摘要\n【百萬小學堂】、【金頭腦】這類的益智節目，在台灣也風靡一時。\n而電腦是否能在節目上超越人腦，也一直是人們茶餘飯後討論的話題。\n在 2011 年的益智問答節目 Jeopardy 中，IBM 的華生電腦（Watson）擊敗兩位世界紀錄保持人並贏得 100 萬美元，造成不小轟動。本次 talk，將介紹如何自製一個答題機器人。\n\n目前，電腦對於自然語言的理解依然有限，舉例來說: 要讓電腦知道『蘋果』是什麼? 就是個困難的問題。\n因為蘋果在一句話中可能是指水果、手機或是喜歡的人 (流行音樂中的小蘋果)。為了克服這個難題，文字探勘(text mining) 中有個子領域叫做知識圖譜(Ontoloty)，目的就是希望將人類所有的知識以及規則儲存成結構化的資料。\n如此，在解析文字時，就會知道蘋果是水果 or 電腦、知道周杰倫是歌手。對益智節目、聊天機器人等應用都會產生莫大的助益。\n\n本 talk 將會介紹知識圖譜的應用、目前的做法與瓶頸、如何使用 Wikipedia 自動建立支援各國語言的知識圖譜，最後 Demo 一下答題機器人的智商到底行不行。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-data/%2Fcoscup18-data-wiki-map) ","type":"","room":"202","start":"2018-08-12T10:30:00+08:00","end":"2018-08-12T11:20:00+08:00","speaker":{"name":"張泰瑋","bio":"今年剛從中興資工系畢業，是 Dcard data engineer 新鮮人，馬上就要去被登入的準海軍陸戰隊請多指教 XD","avatar":"https://coscup.org/2018-assets/img/speakers/s00089.jpg"}},{"id":"e0d2496f-d71b-4163-aa9a-7f235540c09e","field2":"folss-for-university-students","subject":"打造適合大學生的自由軟體課程經驗","summary":" 分享個人在社群成長的經驗，還有自己身為社群推廣者一路走來的心路歷程。演講的重點在於分享成大自由軟體課程進行的各種模式、學生們的反饋與成長，也會穿插講者自身在不同社群的經驗，最後以自己的從中體悟到社群「分享」與「連結」的影響力對一個人來說有多重要。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome306-folss-for-university-students) ","type":"","room":"306","start":"2018-08-12T10:30:00+08:00","end":"2018-08-12T11:15:00+08:00","speaker":{"name":"吳念祖","bio":"我是成功大學資訊系的學生，有兩年的經驗在資訊系上的自由軟體開發與社群發展課程擔任助教。本身熱愛分享與推廣開源的精神，因為參與社群感受到社群連結的力量，所以深深著迷於社群中，喜歡舉辦社群活動讓想交朋友的人可以互相交流切磋。","avatar":"https://coscup.org/2018-assets/img/speakers/s00121.jpg"}},{"id":"3df42bb7-e8e1-4df1-ba72-d0425b59ca2c","field2":"blockchain-community","subject":"區塊鏈：為開源社區補上最後一塊短板","summary":" 通過區塊鏈為開源社區構建自洽的經濟生態，我們（「Linux 中國」開源社區）在社區中通過區塊鏈思想，將貢獻、激勵和自治和經濟自洽有機地結合在一起，探索一條不假于外部商業機構和捐贈的開源社區發展之路。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-blockchain/%2Fcoscup18-blockchain-blockchain-community) ","type":"","room":"302","start":"2018-08-12T10:30:00+08:00","end":"2018-08-12T11:00:00+08:00","speaker":{"name":"王興宇","bio":"「Linux 中國」開源社區及「中國反垃圾郵件聯盟」創始人，中國大陸開源社區意見領袖，20 年互聯網技術背景，電信高級專家，區塊鏈技術專業人士","avatar":"https://coscup.org/2018-assets/img/speakers/s00126.jpg"}},{"id":"44fc7ee9-63f6-48e2-9809-b3bc6278230d","field2":"we-are-opensuse-asia-summit","subject":"We are openSUSE.Asia Summit","summary":" openSUSE.Asia Summit 2018 is the 5th Asia summit, when I looked back the way we took to get here, there were lots of impressive memories. I would take this oppertunity to open Photo album of openSUSE.Asia Summit and share with you all about our stories. Might you are in our stories, and might you will be in our stories. \n\nI will also introduce our process of call for host, call for logo design, call for paper and call for volunteer, so that people can better know how do they get involve in. This is no possible to make openSUSE.Asia summit happen by just one people, so with you, we are openSUSE.Asia summit. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-we-are-opensuse-asia-summit)","type":"","room":"201","start":"2018-08-12T10:45:00+08:00","end":"2018-08-12T11:00:00+08:00","speaker":{"name":"Sunny","bio":"I'm Sunny, and I come from China. I joined SUSE from 2008 which was a\nstart for me to much more get involved in open source community. I was\none of members of hosting the first openSUSE.Asia Summit. We expected to\nspread open Source in Asia through this event and provide more\noppertunities for Asia contributors to have a f2f community during the\nsummit. I'm openSUSE member and working on promoting open Source and\nencouraging more women get involve in open Source projects specially.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"787b57cc-47bc-45db-966e-04b553455652","field2":"build-your-cloud-file-hosting","subject":"Build your cloud file hosting using nextcloud on openSUSE Leap 15.0","summary":" Nextcloud is a suite of client-server software for creating and using file hosting services. It is functionally similar to Dropbox, although Nextcloud is free and open-source, allowing anyone to install and operate it on a private server. \nIn contrast to proprietary services like Dropbox, the open architecture allows adding functionality to the server in form of applications and enables users to have full control of their data. \nThe original ownCloud developer Frank Karlitschek forked ownCloud and created Nextcloud, which continues to be actively developed by Karlitschek and other members of the original ownCloud team.\n\nin the case of this time, I use openSUSE Leap 15.0 to build nextcloud on it, and I will explain briefly how I can build it and installing nextcloud steps above openSUSE Leap 15.0, which turns out to build nextcloud on your own computer is not too difficult, easy even for beginners though.\n\nso we can build their own cloud file hosting, and that too is free to obtain and is an open source \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-build-your-cloud-file-hosting)","type":"","room":"304","start":"2018-08-12T10:45:00+08:00","end":"2018-08-12T11:00:00+08:00","speaker":{"name":"Mohammad Rifki Affandi Z","bio":"I am a college student in Sebelas Maret University and openSUSE user since 2016","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"461aa268-21d8-4a86-b35d-d2bba81d8a64","field2":"postgresql-recovery","subject":"PostgreSQL 複製藝術","summary":" 資料複製在資料庫應用場景來說是必要需求, 依據資料應用服務需求可分為以下幾個類別:\n* 災難回復 (Disaster Recovery/Reading and Writing)\n* 表單同步 (Partial Replication/Reporting) \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-database/%2Fcoscup18-database-postgresql-recovery)","type":"","room":"501","start":"2018-08-12T10:50:00+08:00","end":"2018-08-12T11:30:00+08:00","speaker":{"name":"陳進賢","bio":"Mongoing 中文社群台北分會主席\n具有十多年的軟體開發及開源數據庫的推廣經驗。目前負責歐立威科技技術顧問團隊相關業務，致力於開源軟件推廣及提供企業解決方案，專長為大數據資料平台系統規劃、設計、分析、技術諮詢及教育訓練服務，應用領域涵蓋電信、金融、零售及高科技製造產業… 等。","avatar":"https://coscup.org/2018-assets/img/speakers/s00074.jpg"}},{"id":"7a199fe6-6e5b-4f18-b5f7-9be574777434","field2":"10-year-ruby","subject":"我寫了 10 年的 Ruby，然後呢?","summary":" Ruby 是一個已經 25 歲的程式語言，雖然很多人說 Ruby 已死，但事實上它還是目前世界排名前 20 名的程式語言。\n\n從開始學習寫程式到現在，不知不覺已經 20 年了，在這 20 年中曾使用過許多款程式語言。在 2008 年開始接觸 Ruby 這個可愛且有趣的程式語言，並使用它工作到現在。\n\n想要成為資深的 Ruby 工程師，並不是隨著年紀變大就會變資深，而是要有方法並且正確地在同一條路上持續耕耘。我將會分享對於學習 Ruby on Rails 但卻總只是停留在 CRUD 階段的新手一些建議，同時也會分享我使用 Ruby 這個程式語言 10 年來，對我在思考程式設計的改變。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-ruby/%2Fcoscup18-ruby-10-year-ruby) ","type":"","room":"502","start":"2018-08-12T10:50:00+08:00","end":"2018-08-12T11:20:00+08:00","speaker":{"name":"高見龍","bio":"五倍紅寶石 (https://5xruby.tw) 共同發起人兼負責人，著有「為你自己學 Ruby on Rails」以及「為你自己學 Git」兩本書，愛現，喜歡冷門、非主流技術。","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"8dd615a5-b346-4b7f-916d-c6ebac37e17a","field2":"blockchain-based-community","subject":"基於區塊鏈的開源社區与貢獻的激勵機制的思考 A few thoughts on blockchain-based community & contribution incentive mechanism","summary":" 。Economic system evolution: A zero maginal cost society is being transformed by AI, Blockchain, IoT, etc. where FOSS weaves everything together. Yet, there is little sustaibable returns or rewards to the FOSS communities and contributions.\n\n。Governance challenges on consensus & incentive for FOSS communities and contributions\n\n。Current FOSS and blockchain consensus & incentive mechanisms\n\n。GCR market characteristics to fertilize a blockchain-based community & contribution incentive mechanism\n\n。Next step: Building a blockchain-based community & contribution incentive mechanism in this region. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-blockchain/%2Fcoscup18-blockchain-blockchain-based-community)","type":"","room":"302","start":"2018-08-12T11:00:00+08:00","end":"2018-08-12T11:30:00+08:00","speaker":{"name":"Richard 林旅強","bio":"旅居上海的台北人，參與 & 貢獻兩岸開源社群，COSCUP 多年志工，開源社發起人。日常工作是華為物聯網作業系統 LiteOS 運營總監。對於區塊鏈產業略知一二，HODL 派人士。","avatar":"https://coscup.org/2018-assets/img/speakers/s00130.jpg"}},{"id":"63ecd6e3-87f4-457f-abda-39e78da5f0c9","field2":"understand-and-perform-the-foss-compliance","subject":"Understand and perform the FOSS compliance in a community-driven way / 採社群思維模式做好開源合規","summary":" The ICT administrative departments in Taiwan usually know little about \"community\", most of the managers are treating Free and Open Source Software in a traditional way as in IPR management, thus easily to miss and overlook the important part of the obligations under the FOSS licenses, especially the Copyleft ones such as GNU GPL and LGPL. In this session, the speaker shall try to share the observation and experience in the past 10 years about why the FOSS community spirit is proned to be neglected and how the most doable way is to tackle that in the real world practice. 2 to 5 case studying about misunderstanding of FOSS compliance shall be demonstrated, such as the gray line between Shareware and Free and Open Source Software, then the essential points and right ways to avoid and prevent the compliance issues will be communicated and introduced to the audience. / 在台灣，資通訊產業的管理部門對「社群營造」所知甚少，多數經理人以傳統模式來進行自由開源軟體的智財權管理，因為如此，部份重要的自由開源軟體授權義務性要求常容易被忽略與忽視。於此議程，講者將基於其過去 10 年的觀察與經驗，試著分享為何這些自由開源軟體的社群精神會容易被忽略，並且提出如何為實作上最可行的因應之道。2 至 5 個對自由開源軟體合規常見的實例誤解將會被展示說明，例如共享軟體與自由開源軟體之間的灰色區隔線，藉此來向聽眾傳達與介紹，其後避免及預防這些錯誤發生的重要要件及正確之道。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-compliance/%2Fcoscup18-compliance-understand-and-perform-the-foss-compliance)","type":"","room":"503","start":"2018-08-12T11:00:00+08:00","end":"2018-08-12T11:45:00+08:00","speaker":{"name":"Lucien C.H. Lin / 林誠夏","bio":"Lucien Cheng-hsia Lin（林誠夏）, has been doing the FOSS licenses research and study from 2005 to 2016 when acted as an academic professional in the project “OpenFoundry\"hosted in Academia Sinica, which is a FOSS web-hosting service platform based on Subversion and Request Tracker. He is best known for being the main proposer and drafter of the\"Open Government Data License Taiwan 1.0\"(https://data.gov.tw/license), with an one-way CC BY 4.0 switching mechanism implemented, which can make most of the materials on Taiwan Open Data portal be used under CC BY 4.0 license. Besides that, he has been participating in the Open Source, Open Data, and Creative Commons Licenses interpretation and clarification among the local communities, official agencies, and companies in Taiwan for more than 10 years. And now he is engaging to build the Taiwan Open Source Legal Network in the position of legal adviser both of Open Culture Foundation and Gemly Int'l Intellectual Property Right Office for facilitating FOSS licensing knowledge exchange and FOSS ecosystem establishment in Taiwan. / 林誠夏 (Lucien C.H. Lin)，知識背景為科技法律，05-16 年間任職於中央研究院從事公眾授權模式的研究，近年的研究成果包括：協助歐洲自由軟體基金會，擔任自由開源軟體法律參考書台灣專章的編撰作者、參與國家發展委員會就「政府資料開放授權條款」第一版本的討論與編撰，並應臺灣數位文化中心籌備計畫邀請，協助台中市文化局研擬制定「臺中自由文化授權條款」及「臺中開放文化授權條款」，裨利用於開放文化領域的素材流通。目前於鈞理知識產權事務所，以及開放文化基金會擔任法制顧問，撥付工作之餘的心力營建國內開源授權知識的分享網絡 (Open Source Legal Network, Taiwan)，本年度並同時擔任國發會、文化部，以及陸委會政府資料開放諮詢委員。","avatar":"https://coscup.org/2018-assets/img/speakers/s00026.jpg"}},{"id":"b970f9c2-f225-4e0a-9f02-855a82dcd67a","field2":"mbtile","subject":"台灣登山向量圖磚","summary":" 結合 PostGIS/MBTiles 等資料庫、OSM 資料和內政部數值地形模型（DTM），產出供 Mapbox GL 使用之向量圖磚（.mvt）伺服器，作為登山行程用途。（有時間再談到 Mapbox 的前端設定） \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gis/%2Fcoscup18-gis-mbtile) ","type":"","room":"305","start":"2018-08-12T11:00:00+08:00","end":"2018-08-12T11:25:00+08:00","speaker":{"name":"謝晉凡","bio":"GIS 新人一名，想開發合適的手機應用來讓登山 / 救難行程更有效率","avatar":"https://coscup.org/2018-assets/img/speakers/s00050.jpg"}},{"id":"d15bf3be-45db-402b-be9b-ad8dd86d334e","field2":"drbd","subject":"DRBD - block device replication solution for HA cluster mainly","summary":" This talk explains HA cluster used by DRBD. \nDRBD is block device replication software developed by LINBIT and licensed by GPLv3. \nHA cluster is usually an expensive fee for device and controller software. \nDRBD can make HA cluster low cost because it is opensource and can use general devices.\n\nVolumes can become the single point of failure. but DRBD can cover it. \nand we can use it by manage controllers like drbdmanage or LINSTOR. \nLINSTOR has not been yet supported in openSUSE. but, LINBIT quitted development of drbdmanage. and announced developing LINSTOR. \nso I explain LINSTOR to provision HA cluster. I wish openSUSE will support LINSTOR. and I think basic philosophy is same.\n\nHA cluster used by DRBD is more usable. DRBD can use with pacemaker and Corosync, with kubernetes. and more. this talk introduces them. \npacemaker and Corosync can manage clusters. pacemaker and Corosync change active node when detecting a failure. \nDRBD support kubernetes by Kubernetes Flex Volume plugin.\n\nI remark easy step to setup HA cluster with DRBD. so attendee can learn how to setup HA cluster with easy way and HA cluster background philosophy. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-drbd)","type":"","room":"201","start":"2018-08-12T11:00:00+08:00","end":"2018-08-12T11:30:00+08:00","speaker":{"name":"Syuta Hashimoto","bio":"openSUSE-ja member. I was a local committee for openSUSE.Asia Summit 2017(Tokyo, Japan), And I am a global committee for openSUSE.Asia Summit 2018.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"f4ea1cbf-7dbd-4362-b3e8-6a5ccdae9ee5","field2":"deployment-of-multi-node-web-server","subject":" Deployment of multi node web server, database server and storage session server with Ansible","summary":" In deploying the server, especially in large quantities, it takes a long time, because the deployment must be done on each server one by one, deployment must also be done in detail so that each server is identical to each other in a group. \nIf this is done then there is the possibility of one or more of the servers not being identical to the other servers in a group. \nSo we need a tool to simplify the work, and then we use Ansible to do more deployment in the future. What is Ansible? Ansible is an open-source IT automation engine which can remove drudgery from your work life, and will also dramatically improve the scalability, consistency, and reliability of your IT environment. \nWe use ansible to deploy web servers, database servers with galera clusters, and session storage servers with master-slave mode. With the use of this tool can reduce the time required in deployment servers, and unidentical server in a group can be avoided \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-deployment-of-multi-node-web-server)","type":"","room":"304","start":"2018-08-12T11:00:00+08:00","end":"2018-08-12T11:30:00+08:00","speaker":{"name":"Didiet Agus Pambudiono","bio":"openSUSE user, member of openSUSE Indonesia, and Kelompok Linux Arek Suroboyo","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"7dd2f88d-2cb0-441d-bb39-5e3117e96948","field2":"3a-0ad","subject":"下一個 3A 級即時戰略遊戲大作 - 0AD","summary":" 0AD 從 2000 年左右，以作為商業專屬遊戲世紀帝國 2 的外掛模組的成份現身，更接近史實與真實性的構想一時受到不小的歡迎，但受限於微軟遊戲引擎與商業利益的限制，最終選擇出走開發自己的獨立免費遊戲。\n\n經過 6 年的閉源開發，期間內有重要成員去世、為了家庭因素出走，不但沒有夠好的成果，這個計畫也漸漸為人所遺忘。最後該團隊在 2009 年決定開放原始碼，程式授權採 GPL， 圖像、音聲授權採 CC BY-SA，此舉大為改變了這個計畫的命運。\n\n時間來到 2018 年， 在 Alpha 0.20 版以後， 0AD 的可玩性越來越高，諸多更貼近史實又有很優秀可玩性的設計，已經被不少玩家認定比類似主題的世紀帝國 1、 2 更為好玩，連遠在台灣的電競圈也有玩家注意到這個遊戲，開始為它推廣。\n\n以開放原始碼模式經營的遊戲，在過去通常只有 me2 的等級 - 復刻重作舊時代的遊戲；或者是商業引擎開源後，開源社群使用開源版引擎然後把遊戲原有的商業的圖片、音聲檔資源檔換成 CC 的，這些遊戲老實說就只有開源社群的自己人在玩。幾乎沒有人以 3A 等級的品質為目標，創作全新的遊戲。\n\n然而今天 0AD 做到了，雖然還在 alpha 階段，已經作到一般的遊戲族群都開始在討論的程度，還把它跟世紀帝國相提並論，評價甚至有過之而無不及。反過來開源社群才嚇一跳，「我們圈子裡出了這麼厲害的遊戲？」\n\n這件事情非常值得探討，這可能也是一個里程碑 - 開源模式也能開發出 3A 級高品質遊戲。\n\n附註 0AD 的特色：\n* 不同文明的差異：世紀帝國的作法只是技術樹稍有不同，但是通用單位圖片共用外加一種特種兵，比如南美馬雅的步兵是歐洲騎士的模樣。但是 0ad 是每個文明的兵種都有獨特的造型、機能，技術樹的系統也南轅北轍，比如說印度有工作象、羅馬有前鋒山寨堡\n\n* 男女公民有別，男性全民皆兵，平時工作，戰時出征\n\n* 陣型：除了通用的幾種外，特殊文明還有特別的陣行，如希臘方陣、羅馬龜甲陣\n\n* 招降系統：0ad 的建築無法用人力用刀劍輕鬆取下，但是有招降機制\n\n* 防禦性建築的真實性：世紀帝國的石牆類建築如圍牆等不用專門攻城器具，用刀劍都砍得破，但是 0ad 不可能很不經濟，只有用攻城器具。而且圍牆上面還可以站\n\n* 陣型有真正的效果，還可以慎定細微電腦攻守的細節原則，讓你可以像電腦一樣做細微控兵。\n*AI 比起 AOE 系列厲害很多，有做進仿人的思考 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-oss/%2Fcoscup18-oss-3a-0ad) ","type":"","room":"401","start":"2018-08-12T11:00:00+08:00","end":"2018-08-12T11:40:00+08:00","speaker":{"name":"張正一","bio":"維基人、開源貢獻者、音樂人","avatar":"https://coscup.org/2018-assets/img/speakers/s00090.jpg"}},{"id":"032c7e43-8b28-4b0d-a0bc-6ad934fa5baf","field2":"flatpak-snap","subject":"flatpak vs. snap","summary":" flatpak 和 snap 的簡短介紹及打包讲解\n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome301-flatpak-snap) ","type":"","room":"301","start":"2018-08-12T10:30:00+08:00","end":"2018-08-12T11:15:00+08:00","speaker":{"name":"BinLi","bio":"目前就職於 Canonical，北京 GNOME 用戶組的負責人，GNOME.Asia 組委會成員。","avatar":"https://coscup.org/2018-assets/img/speakers/s00044.jpg"}},{"id":"8dd867bc-1888-4c3f-bec5-7c676d816536","field2":"gnome-asia-experience","subject":"跟有情人做快乐事","summary":" 介绍完整筹备一次 GNOME.Asia 活动的血泪史 (笑逃 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome301-gnome-asia-experience) ","type":"","room":"301","start":"2018-08-12T11:15:00+08:00","end":"2018-08-12T12:00:00+08:00","speaker":{"name":"闻其详","bio":"PM of GNOME.Asia Summit 2017","avatar":"https://coscup.org/2018-assets/img/speakers/gnomeasiasummit.jpg"}},{"id":"d1a3b923-3037-46fa-8392-fd9634a8557f","field2":"using-inkscape-to-design-shoes","subject":"USING INKSCAPE TO DESIGN SHOES","summary":" Learn how Fans shoes manufacture use Free Open Source Drawing Software - Inkscape to design shoes. This presentation will explain the process from early stage of drawing the shoes with Inkscape until the final result. In addition, the presentation will show some of marketing items that are designed with Inkscape and GIMP. Inkscape is professional quality vector graphics software which runs on Linux, Mac OS X and Windows desktop computers. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome306-using-inkscape-to-design-shoes)","type":"","room":"306","start":"2018-08-12T11:15:00+08:00","end":"2018-08-12T12:00:00+08:00","speaker":{"name":"Iwan S. Tahari","bio":"Work as Director of Operations in Fans Shoes Manufacture. Company Migrator in utilizing FOSS. Speakers of GnomeAsia 2016,2017, Libreoffice Conference 2018, and several others local open source gathering. Active Contributor in local open source activities.","avatar":"https://coscup.org/2018-assets/img/speakers/s00032.jpg"}},{"id":"9c041316-d403-42cb-a6e3-75f6ac389e26","field2":"linux-kernel","subject":"回望踏入 Linux 内核之旅","summary":" 从六个方面分享 20 年来的 Linux 内核之旅：初次踏入 Linux，Linux 不仅仅是开源，翻译之路，Linux 内核书籍点评，从机制与策略探究 Linux 内核设计之道，迷时师度 悟了自度。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-linux-kernel) ","type":"","room":"101","start":"2018-08-12T11:20:00+08:00","end":"2018-08-12T12:00:00+08:00","speaker":{"name":"陳莉君","bio":"現任西安郵電大學教授，專注 Linux 核心相關研究，並教授「操作系統」、「軟建工程」等課程。曾出版「Linux 操作系統內核分析」，翻譯「深入分析 Linux 源代碼」等書籍，在技術及教學都深獲業界與學界的肯定。","avatar":"https://coscup.org/2018-assets/img/speakers/s00075.jpg"}},{"id":"e3ba45a2-f184-4d84-b415-e4b3c70f0c8d","field2":"osm-tool-for-field-survey-and-validation","subject":"Form & Map based Mobile OSM Tool for Field Survey and Validation","summary":" Traditional field survey and validation based on paper map & form. It takes much efforts to collect and digitize it, also difficult to include the meta-data such as photos, audio/video files, geo-tag location, and so on. Current ODK (Open Data Kit) with OMK (Open Map Kit) is popular and leveraged quite often, however, it needs some additional IT efforts for deployment before starting the field survey.\n\nIn this talk, we will introduce the all-in-one service: geoBingAn, which allows users to perform the field surveys (to interact with OSM data/tag) just as easy as if they were using Google Forms on OSM basemap from mobile. Moreover, the surveys can be performed by clicking on OSM building object for updating the tags by answering form, planned the Area of Interest with polygons drawing on basemap, deliver the assignments and accomplished message with app notification, and all the collected survey data can be exported in GeoJSON or KML file just with a few clicks from web UI.\n\nWe believe this OSM tool will lower the barrier of using OSM data for field surveyors, can even encourage the volunteer who doesn't have the knowledge of OSM tagging to contribute for OSM with proper form designed. We submitted this topic to SotM 2018 and it's accepted, we are keen to share this interesting development in COSCUP 2018 as well. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gis/%2Fcoscup18-gis-osm-tool-for-field-survey-and-validation)","type":"","room":"305","start":"2018-08-12T11:25:00+08:00","end":"2018-08-12T11:50:00+08:00","speaker":{"name":"Kuo-Yu slayer Chuang","bio":"Kuo-Yu slayer Chuang has worked on Location-Based Service (LBS) and disaster response with ICT for years. His current focus is the start-up social enterprise, GeoThings, which provides an integrated ICT platform for Communities, NGOs, and Government Agencies on disaster management. He is also working with various international organization such as OGC, GEO, ITU, and actively joined the OSM/HOT community and Crisis Mappers. Together with GeoThings team, slayer really look forward to a greater impact for disaster response with an idea of “the Humanitarian ICT”.","avatar":"https://coscup.org/2018-assets/img/speakers/s00027.jpg"}},{"id":"dd815dd6-81d9-433e-b6fc-df3997151ed0","field2":"blockchain-opensource","subject":"區塊鏈是開源的下一個戰場","summary":" Internet 的發展得益於開源軟體，然而，因特網有服務中心化的需求，使得開源軟件實際使用有限。比如，Xero.com 能比 GNUCash 解決用戶聯合記帳需求，Gmail 比 Thunderbird 更能解決隨時隨地訪問電郵需求。\n\n智能手機和平板原本應該能為開源提供更多發揮余地，因為在這些平台上本地 APP 比服務器端的服務體驗更好。然而實際上 app 多是即有服務的前端。開源也沒有利用這個機會發展起來。\n\n講師這里會介紹下一代基於區塊鏈的新應用很多地方很難繞開源的需求，尤其是 “無責任服務” 的產生，通過智能合約，而非一個中心擔保方提供的服務，如果不開源就無法被區塊鏈產業接受。同時，因為用戶（不經銀行代管）持有加密貨幣，大量業務邏輯必須發生在用戶設備上，這些也需要開源獲得用戶信任。開源開發者應用利用這個機會，使用開源技朮占領用戶終端和去中心化服務這兩塊傳統技朮難於進取的市場。\n\n講師會介紹 Non-fungible-token 的概念，這是用戶權益 Token，而非加密貨幣。講師會介紹這些 Token 意味着非金融應用（也就是所有應用）均有在區塊鏈上的大量應用場景。請不做金融開源的也進來聽。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-blockchain/%2Fcoscup18-blockchain-blockchain-opensource) ","type":"","room":"302","start":"2018-08-12T10:00:00+08:00","end":"2018-08-12T10:30:00+08:00","speaker":{"name":"張韡武","bio":"张韡武曾在澳大利亚联邦银行（澳大利亚最大的金融机构）担任区块链构架师，主导了 12 個區塊鏈項目。超過 5 年的區塊鏈開發經驗，從 alt 貨幣設計到交易算法等。 R3 Corda 專家 - 任 R3 全球搆架師工作組。安全和加密專家，開源系統專家，區塊鏈開發者社區公認的區塊鏈專家。2012 開始接觸比特幣和區塊鏈，持有 4 位數比特幣，詠春拳愛好者。","avatar":"https://coscup.org/2018-assets/img/speakers/s00088.jpg"}},{"id":"94ec123e-ddbc-4423-a334-1916ec9687ff","field2":"lhc","subject":"玩轉 LHC 公開數據","summary":" LHC 實驗位於瑞法邊境的歐洲粒子研究中心 (CERN)，以高能量的質子對撞實驗來研究基本粒子的交互作用等現象。去年 (2017) 年底一份新的實驗數據，以 CC0 公開在其網頁上，總量已達到了 PB 的等級。這份正是 2012 年發現希格斯粒子所使用的實驗數據與模擬事例。將簡單說明如何取得這些數據，還有資料格式。同時藉由 Jupyter 筆記本，展示如何分析使用這些公開數據，希望聽眾也可以有所啟發，使用在自己的領域上。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-data/%2Fcoscup18-data-lhc) ","type":"","room":"202","start":"2018-08-12T11:30:00+08:00","end":"2018-08-12T12:20:00+08:00","speaker":{"name":"趙元","bio":"物理研究員，OSS 愛好者","avatar":"https://coscup.org/2018-assets/img/speakers/s00060.jpg"}},{"id":"93963b36-0a2c-43ba-9e88-ecb4b17c842a","field2":"good-spirit","subject":"Maintaining the Good Spirit","summary":" openSUSE Indonesia community is a bunch of people who love openSUSE in Indonesia, a tropical archipelagic country. \nSince establish in 2007, we experience up and down era which is normal in loose hierarchical organization ;-) \nPeople come and go, but there always someone who willing to maintain and continue the breath of this community. So we have to maintain the good spirit to keep us alive and fun :-)\n\nIn the earlier year we always do a monthly or bi-monthly offline meeting, at that time the internet connection still not massive like it is right now. It was important to meet in person to maintain the cohesiveness of the community. While it was good, but that offline meeting only effective in certain area mainly in Jakarta metropolitan area. Right now, the communication means using internet connection, like website, facebook and telegram are more effective. \nOff course we still do offline meeting/class but not as many as the earlier year.\n\nAs of May 2018, our facebook group have around 4200 member and around 1100 member are active user. Telegram group member are around 370 as of May 2018. Our web site https://opensuse.id is accessed around 51 hits per day.\n\nThis is about openSUSE community progress in our country and examining it in the last 3 years, we're on the right track. \nI would love to share the experience promoting openSUSE and also want to hear other community experience in other Asian countries. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-good-spirit)","type":"","room":"201","start":"2018-08-12T11:30:00+08:00","end":"2018-08-12T12:00:00+08:00","speaker":{"name":"M. Edwin Zakaria","bio":"Work for The Research Corporation of University of\nHawaii (RCUH) / Pacific Disaster Center (PDC) as a\nconsultant for Myanmar Department of Meteorology\nand Hydrology for developing disaster aware system.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"90dd6d1d-a06b-443e-af77-46bd6d1f4f58","field2":"state-of-cjk-issues-of-libreoffice","subject":"State of CJK issues of LibreOffice","summary":" The LibreOffice project is an aimed at multilingualism, as stated in The Document Foundation's\"Our Values\"of\"Our Next Decade Manifesto\" that anyone can translate so that everyone can use it in their mother tongue. \nHowever, LibreOffice developers are mostly in Europe, and in order to use them conveniently in other languages, those who understand those languages ​​need to solve the problem. LibreOffice 's CJK and problems unique to the Japanese environment are various such as vertical writing, external characters, phonetic, currency and date notation. \nSometimes CJK regression bugs occur in the LibreOffice project. It is important to strengthen user's feedback loop approach. However, I would like to find regression bugs by testing. \nIn last year's talk, I organized mainly examples of concrete CJK bugs. In this year's talk, As the first, I will analyze the bug database and introduce the trend. Secondly, I will organize major CJK bug cases. Thirdly, I will discuss how to test CJK functionality to find bugs before release. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-state-of-cjk-issues-of-libreoffice)","type":"","room":"304","start":"2018-08-12T11:30:00+08:00","end":"2018-08-12T12:00:00+08:00","speaker":{"name":"Shinji Enoki\n榎 真治","bio":"Shinji Enoki is a member of LibreOffice Japanese Team.\nHe focuses on planning of events and sometimes on QA activities e.g. bug triage.\nHis other community activities is a chairperson of Japan UNIX Society,\na member of Kyoto OpenData Community and a staff of KANSAI OPEN SOURCE.\nHe is freelance, and he is developing LibreOffice support business\nwith iCRAFT Corp.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"c385d462-39bf-43e1-8904-83e9ed4305e8","field2":"performance","subject":"火焰圖：分析效能瓶頸不可或缺的好幫手","summary":" 這年頭開發網站很幸福，遇到需要改善 performance 時有很多方便的第三方服務能幫助你。以 Ruby on Rails 來說可以用的服務像是 NewRelic、Skylight、Scout 等等，很容易幫你調查出是不是有哪些 request 有效能問題。\n\n這些服務雖然很好用，但是大多是專注在調用 database query 上的分析，大部分服務沒辦法詳細分析非 database 造成的瓶頸，當你遇到效能瓶頸是在程式碼純運算層面時，通常沒有辦法給你太多幫助，而這時候就是火焰圖能夠幫助你的時候了！\n\n本議程將會介紹火焰圖能夠在什麼情境之下幫助你，以及介紹如何解讀火焰圖的結果來協助找出程式的效能瓶頸。\n\n註：本議程有部分內容利用 Ruby 解說示範，但大部分的程式語言都可以利用火焰圖分析，概念完全通用，非 Ruby 開發者也適用。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-ruby/%2Fcoscup18-ruby-performance) ","type":"","room":"502","start":"2018-08-12T11:30:00+08:00","end":"2018-08-12T12:00:00+08:00","speaker":{"name":"朱建瑋","bio":"現為財報狗 CTO，主導財報狗數個重要技術專案，包含將網站由 PHP 無痛轉移至 Ruby on Rails、多個重要功能的效能大幅優化、打造高效率又可靠的 background processing 系統... 等。","avatar":"https://coscup.org/2018-assets/img/speakers/s00138.jpg"}},{"id":"d1edb8ab-f08b-47a6-8f89-c5ecc4d1c179","field2":"postgresql-as-a-log-database","subject":"PostgreSQL as a Log database","summary":" 提供一個實際的 PostgreSQL 案例，為 Log 記錄及展示系統，它需要資料庫管理員和程式設計師兩方的良好互動，期待的結果也考驗著讀寫兩端的衡量。PostgreSQL 可能不是這個應用的最佳資料庫系統，但考量到人員技術與管理的相容性，卻是這個案例下較好的選擇。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-database/%2Fcoscup18-database-postgresql-as-a-log-database) ","type":"","room":"501","start":"2018-08-12T11:35:00+08:00","end":"2018-08-12T12:30:00+08:00","speaker":{"name":"古永忠","bio":"古永忠博士投入資料庫系統研究十餘年，也實際進行 DBA 及程式開發的工作，能提供學理和實務平衡的觀點。近年組織台灣 PostgreSQL 本地社群，主要提供正體中文的使用文件。","avatar":"https://coscup.org/2018-assets/img/speakers/s00125.jpg"}},{"id":"e4cd39a9-777f-4cf7-8a19-d9cf9a38f44f","field2":"neovim","subject":"像 ide 一樣的 neovim","summary":" 時代在進步。vim 有需多變化，vim fork 版本，也增加 了許多原有的 vim 沒有的功能。新的技術出現，如 Language Servere Protocol 的出現，也讓 (neo)vim 更加的強大。此議程會分享如何將 (neo)vim 改成向像 IDE 一樣強大，並示範如何用 (neo)vim 解決工作與日常問題。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-oss/%2Fcoscup18-oss-neovim) ","type":"","room":"401","start":"2018-08-12T11:40:00+08:00","end":"2018-08-12T12:10:00+08:00","speaker":{"name":"Kuo-tung Kao","bio":"熱愛技術，喜歡分享。曾在不同的社群或演討會演講過。","avatar":"https://coscup.org/2018-assets/img/speakers/s00135.jpg"}},{"id":"5712375b-28b7-44da-be4c-e21379d40202","field2":"from-openchain-to-fossology---compliance-in-2018","subject":"From OpenChain to FOSSology - Compliance in 2018","summary":" A shared understanding of process and rules is key to the success of open source success. Our global community represents many perspectives, many cultures and many jurisdictions. Approaches and tools have appeared to support a balance between flexibility and accuracy. This talk will explain practical open source compliance solutions for real world challenges. It will highlight a \"stack\" of compliance projects (OpenChain, SPDX, Reuse.Software, FOSSology, ScanCode, sw360) and explain how they work from high level (e.g OpenChain) to tooling (e.g FOSSology). \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-compliance/%2Fcoscup18-compliance-from-openchain-to-fossology---compliance-in-2018)","type":"","room":"503","start":"2018-08-12T11:45:00+08:00","end":"2018-08-12T12:15:00+08:00","speaker":{"name":"Shane Coughlan","bio":"Shane Coughlan is an expert in communication, security and business development. His professional accomplishments include spearheading the licensing team that elevated Open Invention Network into the largest patent non-aggression community in history, establishing the leading professional network of Open Source legal experts and aligning stakeholders to launch both the first law journal and the first law book dedicated to Open Source. He currently leads the OpenChain community as Project Director.\n\nShane has extensive knowledge of Open Source governance, internal process development, supply chain management and community building. His experience includes engagement with the enterprise, embedded, mobile and automotive industries.","avatar":"https://coscup.org/2018-assets/img/speakers/s00010.jpg"}},{"id":"8eb4f3c6-e536-406b-b849-bd9f5a10930c","field2":"geo-data-diy","subject":"離線圖資 DIY","summary":" 利用 Docker 自動化產生 mapsforge 格式的台灣離線圖資 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gis/%2Fcoscup18-gis-geo-data-diy) ","type":"","room":"305","start":"2018-08-12T11:50:00+08:00","end":"2018-08-12T12:15:00+08:00","speaker":{"name":"吳政璋","bio":"對社會不幸事件頗有興趣，鄉民風水師開發者","avatar":"https://coscup.org/2018-assets/img/speakers/s00119.jpg"}},{"id":"ac81fb09-03d8-4470-a67b-630f910b5361","field2":"blockchain-panel-discussion","subject":"Panel Discussion","summary":" the general topic that i would like to discuss is FOSS and blockchain.\n\nHow does blockchain fit into the FOSS community?\n\nunlike many other projects that are started in the FOSS community, or where the ideals of the project are very much aligned with the FOSS community, many blockchain projects appear to be following a different philosophy, and the fact that the blockchain code is under a Free Software and Open Source licence is more incidental than intentional.\n\ni will invite a selection of speakers coming to COSCUP to join the panel\nand i'd like to ask every speaker questions like:\n\nwhat is your relationship to the FOSS community?\n\nwhat made you decide to come here, instead of going to a blockchain conference?\n\nhow do you use Free Software and Open Source in your project?\ndo you think that blockchain projects should be more focused on FOSS, on their roots, where their code comes from? if yes, how could we achieve that?\n\ndoes blockchain depend on Free Software and Open Source licensing?\n\nif you had to choose between FOSS and blockchain, what is more important to you?\n\nthe specific set of questions will still change. and i will include the invited speakers in choosing good questions. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-blockchain/%2Fcoscup18-blockchain-blockchain-panel-discussion)","type":"","room":"302","start":"2018-08-12T11:30:00+08:00","end":"2018-08-12T12:30:00+08:00","speaker":{"name":"Martin Bähr","bio":"Martin has been using Free Software for more than 20 years. He has lived and was active in the local Free Software community on four continents.                                                                                                                           \n\nHe eventually settled in China where he now lives with his family, running a small Web Development Shop. He continues to be active in the Free Software community. He was running the Beijing GNU/Linux User Group for four years and now mentors his successors and he founded the Free Software Community Leadership Roundtable, a forum where community leaders can share and support each other. \n\nIn 2018 he started an initiative to bring together a FOSS oriented blockchain community.\n\nHe has been hosting blockchain meetups and sicusssions at several major FOSS conferences this year.\n\nThrough his career, his interest has always been Free Software that facilitates communication and collaboration and brings the world closer together. He believes that blockchain has a lot to offer to FOSS and wants to further FOSS ideals among blockchain projects.","avatar":"https://coscup.org/2018-assets/img/speakers/s00133.jpg"}},{"id":"2bb95ad6-d05d-46f2-a3a4-86cfd7490bd5","field2":"archers","subject":"招喚 Archers - Arch Linux Taiwan 社群介紹","summary":" The world around you is not what it seems.\n\n你在網路上蒐尋著 Arch Linux 某個應用方法，就在你實作成功後定睛一瞧，你認出了解決方案的提供者是多年摯友，她的真實身分竟是一名 Archer！相見恨晚猶未晚，此議程將揭露如何找到現有 Archers、成為 Archer、成就更多的 Archers。\n\nIt's Time To Move.\n\n讓我們一起來招喚隱藏的 Archers 、壯大 Arch Linux 吧！ \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-arch/%2Fcoscup18-arch-archers) ","type":"","room":"302","start":"2018-08-12T12:30:00+08:00","end":"2018-08-12T12:40:00+08:00","speaker":{"name":"PN Wu (小平)","bio":"Archer & Javator . Back-End Engineer . My LinkedIn Profile https://www.linkedin.com/in/pingnote","avatar":"https://coscup.org/2018-assets/img/speakers/s00016.jpg"}},{"id":"295c8c02-b6f9-45bb-8d88-b7afa6d12b0b","field2":"ai-and-fa","subject":"人工智慧與財務分析","summary":" 如何利用公開資料打造價值千萬的 AI 證券分析師 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-data/%2Fcoscup18-data-ai-and-fa) ","type":"","room":"202","start":"2018-08-12T12:30:00+08:00","end":"2018-08-12T13:20:00+08:00","speaker":{"name":"王淳恆","bio":"現任:\n聯發科技 技術副理\n\n學歷:\n交通大學 電信工程研究所 碩士\n\n專長領域:\n人工智慧與影像分析\n人工智慧與財務分析\n17 年以上通訊與影像的晶片設計、訊號處理與演算法相關工作經驗\n\n經歷:\nKaggle(Google 旗下資料科學與人工智慧競賽平台) 兩面銀牌\nKaggle 史上最高獎金的競賽中獲得銀牌\n中研院 2017 年人工智慧年會 講者\n台灣人工智慧學校 經理人週末研修班專題演講 \n成功大學 工學院工程管理碩士在職專班 資料探勘課程 業界講師\n政治大學 教學月 講者\n高雄第一科技大學 大數據中心 / 資管系 講師","avatar":"https://coscup.org/2018-assets/img/speakers/s00141.jpg"}},{"id":"ae22c79b-65c6-48b9-b09a-32805710d74d","field2":"drupal-fast","subject":"公司的要求千奇百怪 —— 快速建立概念網站","summary":" 展示 Drupal 架設狀況，簡單的調整版面，以及可以提供的擴張彈性。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-drupal/%2Fcoscup18-drupal-drupal-fast) ","type":"","room":"501","start":"2018-08-12T12:30:00+08:00","end":"2018-08-12T13:10:00+08:00","speaker":{"name":"劉宇烝","bio":"前 Drupal 社群經營者之一，現任癮科技技術長。","avatar":"https://coscup.org/2018-assets/img/speakers/s00059.jpg"}},{"id":"04e834d7-21d5-4639-ac3b-d0376d666151","field2":"osm-lunch-office-hour","subject":"OSM Lunch Office Hour","summary":" OpenStreetMap 開放街圖在台灣已經有發展好多年，台灣累積的圖資越來越多，而應用開放街圖的網站也越多。但一直以及缺乏新手能夠學習的場合，能夠學怎麼編輯，以及該注意的地方。隨著開放資料運動，也有越來越多能夠匯入 OpenStreetMap 的資料集，但限於社群人力不足，一直沒辦法好好處理。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gis/%2Fcoscup18-gis-osm-lunch-office-hour) ","type":"","room":"305","start":"2018-08-12T12:30:00+08:00","end":"2018-08-12T13:30:00+08:00","speaker":{"name":"陳瑞霖","bio":"OpenStreetMap 台灣成員，日常工作是科技記者。","avatar":"https://coscup.org/2018-assets/img/speakers/s00073.jpg"}},{"id":"3d0d874b-7a01-4fa6-a313-8b185695eebb","field2":"education-bof","subject":"開源與教育 BoF","summary":" (發起: BobChao)\n\n這次的 COSCUP 講題有不少跟開源 / 教育相關，想邀請關心相關議題的人來聚首，大家聊聊認識一下。由於約在中午時間，有興趣參與的人請帶點吃的來邊吃邊聊。內容大概會是彼此認識，介紹自己參與的教育相關事務，然後就大亂鬥（？）\n\n欲出席者請到 [BoF 文件] (https://docs.google.com/document/d/14I51R_FauCe9kwhz3vd1EQhnlNS6ALh9OksNtc3aH9Y/edit#heading=h.qd580qehe6es) 登記自己的名字\n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc307-education-bof) ","type":"","room":"307","start":"2018-08-12T12:30:00+08:00","end":"2018-08-12T13:30:00+08:00","speaker":{"name":"Staff","bio":"COSCUP x GNOME.Asia x openSUSE.Asia Staff","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"83de2ecf-3d20-46b8-81ac-0912a2a0c470","field2":"dagger","subject":"Dagger 是要割什麼?","summary":" 對大型軟體來說，良好的架構可以讓你寫出更好維護的程式碼。\nDagger 是由 Android 大神 Jake wharton 所開發的 dependency injection framework，本場次將帶你從基礎入門如何使用並分析其背後精神 / 原理等深入探討。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-android/%2Fcoscup18-android-dagger) ","type":"","room":"308","start":"2018-08-12T12:40:00+08:00","end":"2018-08-12T13:30:00+08:00","speaker":{"name":"林俊廷","bio":"Android / iOS 開發者，熱衷於手機 APP 開發的相關技術，工作之餘喜歡寫一些 open source 小工具幫助自己也幫助他人。","avatar":"https://coscup.org/2018-assets/img/speakers/s00105.jpg"}},{"id":"b4cd80c7-5fc4-476e-b244-591119990105","field2":"why-arch","subject":"為何選擇 Arch Linux ? 使用與部署經驗談","summary":" 此議程將提及 Arch Linux 、Manjaro Linux 使用與部署經驗，從 Embedded 、Desktop、Server 到 VPS。包括但不限於 Shell Script、systemd、Java。我將分享以 Arch Linux 作為開發環境和部署目標的便與不便，比較 Arch Linux 和 Manjaro Linux 的異同，並介紹幾個便於開發或維運的套件。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-arch/%2Fcoscup18-arch-why-arch) ","type":"","room":"302","start":"2018-08-12T12:40:00+08:00","end":"2018-08-12T13:00:00+08:00","speaker":{"name":"PN Wu (小平)","bio":"Archer & Javator . Back-End Engineer . My LinkedIn Profile https://www.linkedin.com/in/pingnote","avatar":"https://coscup.org/2018-assets/img/speakers/s00016.jpg"}},{"id":"9817dfde-888d-43d6-9092-8d0b6fd4e287","field2":"civil-infrastructure-platform","subject":"Civil Infrastructure Platform - 工業級開源平台","summary":" Civil Infrastructure Platform (CIP) 是以 Linux 為基底來打造長期維護的城市基礎建設嵌入式平台. 此平台除了包含支援 10 年以上的 Linux kernel 外, 也含有許多開源軟體以及相關強固設計. 其中設計包含 Real-time, Cybersecurity 以及 Testing. CIP 的目標為透過開源協作, 一同打造讓人類社會更進步的基礎平台. 此次分享 SZ 會介紹如何城市基礎建設的強固基礎平台, 並邀請各位一起讓人類社會更加美好. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-oss/%2Fcoscup18-oss-civil-infrastructure-platform)","type":"","room":"401","start":"2018-08-12T13:10:00+08:00","end":"2018-08-12T13:40:00+08:00","speaker":{"name":"林上智","bio":"Debian Developer, 一個熱愛技術以及分享的 Linux 軟體研發人員\n\n專職在 Embedded Linux 領域打滾, 平常有興趣的研究方向為 Embedded System, Communication, Algorithm.\n\n目前從事開發 Industrial Linux Distribution, 以軟硬整合為主體來進行設計以及實作, 並且應用在嵌入式工業領域上\n\n所懷抱的目標是讓世界看到我們這塊土地上科技人材的技術研發實力, 不是只是當個代工的 “Super user”.","avatar":"https://coscup.org/2018-assets/img/speakers/s00110.jpg"}},{"id":"d1571e22-3ebe-4cbd-ab4a-0b263e90ca81","field2":"full-archlinux","subject":"全面使用 archlinux 之旅","summary":" 不知道哪天開始，上網找 linux 教學都一直找到 archwiki\n然後不知道哪天開始，一台接著一台機器裝上 archlinux\n來跟大家分享一些故事：\n安裝 archlinux 以及一些眉角\n使用 KVM 裝 windows 打電動\n筆電上剛好有 smartcard reader ，所以就想辦法在 archlinux 上報稅 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-arch/%2Fcoscup18-arch-full-archlinux) ","type":"","room":"302","start":"2018-08-12T13:00:00+08:00","end":"2018-08-12T13:30:00+08:00","speaker":{"name":"邱冠喻","bio":"對電腦的一切事物有興趣，從電腦硬體、作業系統以及網路到程式、網站前後端，甚至智慧型手機刷機皆有涉略。\n\n小時候愛打電動，當時為了遊戲瘋狂從網路找尋豐富的相關資源，因此由電動漸漸踏入電腦網路世界。\n\n夢想是建立一個大家都能玩的遊戲平台讓大家在上面一起遊玩、競技，同時也可以創造、分享遊戲內容\n\nhttps://pastleo.me","avatar":"https://coscup.org/2018-assets/img/speakers/s00101.jpg"}},{"id":"8980bb42-a52f-4060-bdbe-212e7b2aebcb","field2":"gnome-recipes-local-wisdom","subject":"GNOME Recipes & Local Wisdom","summary":" This topic including:\n\n* GNOME Recipes in general; introducing GNOME Recipes\n* About Indonesian cuisine; introducing Indonesian cuisine and why Indonesia\n* How to collect Indonesian recipes; tells about how to collect Indonesian recipes through a contest\n* The effort to translate Indonesian recipes into English; tell about the process of internationalization of the recipe\n* Why not translate existing recipes; tells why localization of existing recipes and their obstacles\n* The effort to translate UI recipes; tells how to translate UI on recipe \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome301-gnome-recipes-local-wisdom) ","type":"","room":"301","start":"2018-08-12T13:00:00+08:00","end":"2018-08-12T13:45:00+08:00","speaker":{"name":"Kukuh Syafaat","bio":"FOSS Enthusiast","avatar":"https://coscup.org/2018-assets/img/speakers/gnomeasiasummit.jpg"}},{"id":"e27f4269-3ee7-4f8e-a871-dbf3b416519b","field2":"openattic-using-grafana-and-prometheus","subject":"openATTIC using Grafana and Prometheus","summary":" If you never heard of openATTIC before, please spend a little time to talk a look at the above video to understand openATTIC.\n\nopenATTIC is the webUI for managing ceph storage in SUSE Linux and it is also accepted upstream as part of the default managing UI. Within openATTIC, it contains lots of different projects to provide all the functions including salt, Grafana and Prometheus.\n\nThis will not be a ceph or openATTIC focus talk, even we use it as the example of showing how everything work together. Instead we will look into openATTIC to see how each project work with each other. Mainly focus on Grafana and Prometheus, they are not only very useful for ceph and openATTIC but also equally powerful for monitoring your clusters, vm or cloud / container status.\n\nBoth Grafana and Prometheus are very easy to extend, which allow user or administrator to build the dashboard which fit their own need. Even the presentation example will be base on ceph / storage. Participants can use the same idea to monitor any system status they wanted after understand how they work. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-openattic-using-grafana-and-prometheus)","type":"","room":"201","start":"2018-08-12T13:00:00+08:00","end":"2018-08-12T13:30:00+08:00","speaker":{"name":"Alex Lau ( AvengerMoJo )","bio":"AvengerMoJo is Alex’s online nickname. He received his Software Computer Science degree at University of North Texas in 1999. Previously, Alex worked at Nortel Network, before moving to China. He was the R&D Manager for SUSE Linux in Beijing and Taiwan and was the CTO for Symbio Mobile. Blockchain advisor for Cybermiles, WeBank and LikeCoin  He has been working as a consultant for ceph distributed filesystem for SUSE.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"1392312d-b7f3-45dd-b4f6-16bd2c68592f","field2":"introduction-of-openchain-japan-wg","subject":"Introduction of OpenChain Japan WG","summary":" OpenChain Japan Work Group aims at fostering environment where engineers in Japan and Asia can appropriately use OSS. The goals of Japan WG are to promotes OSS compliance in Japan and Asia, to resolves issues peculiar to Japan, and to share information and store knowledge among members. This session introduces the overview and activities of Japan WG. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-compliance/%2Fcoscup18-compliance-introduction-of-openchain-japan-wg)","type":"","room":"503","start":"2018-08-12T13:15:00+08:00","end":"2018-08-12T14:00:00+08:00","speaker":{"name":"Shinsuke Kato / Hiroyuki Fukuchi","bio":"Shinsuke Kato is a chief Software Engineer for Panasonic Corporation, where he helped Panasonic R&D improvements to Linux for use in Panasonic's products. About 10 years ago, he had developed the mobile phones which use Linux.. He has been working with Linux and OSS compliance for over 10 years.\n---\nFukuchi is open alliance manager in Sony. He is in charge of OSS compliance and community relationship. He is a member of OpenChain project, OpenChain Japan WG and the Linux Foundation Japan volunteer translation team.","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"e38571c9-7612-428d-8b55-5cc9ef21b321","field2":"104-drupal","subject":"開什麼玩笑！他居然要 104 人力銀行的日本版？--- 善用 Drupal 模組，複雜問題輕鬆解決！","summary":" 客戶的想法天馬行空、毫無邊際，光是人力銀行就夠複雜了，還要符合台日兩國的思維邏輯？\n想知道如何善用各種 Drupal 模組輕鬆做出來嗎？這議題將帶你化繁為簡，透過 Drupal 輕鬆做出繁雜網站！ \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-drupal/%2Fcoscup18-drupal-104-drupal) ","type":"","room":"501","start":"2018-08-12T13:20:00+08:00","end":"2018-08-12T14:00:00+08:00","speaker":{"name":"楊宗翰（Victor Yang）","bio":"2016 年與加拿大 ImageX 企業開始跨國合作開發，至今製作超過 200 個 Drupal 網站，範疇涉略各式平台、政府機關、雜誌、音樂、遊戲、醫美、設計等產業。","avatar":"https://coscup.org/2018-assets/img/speakers/s00063.jpg"}},{"id":"a32f8699-d774-4de7-8e8c-5f69040f38c3","field2":"pacapt","subject":"pacman + apt = pacapt","summary":" pacapt is an Arch's pacman-like package manager for some Unices. Actually this Bash script provides a wrapper for system's package manager. For example, on CentOS machines, you can install htop with command: `pacapt -S htop` \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-arch/%2Fcoscup18-arch-pacapt)","type":"","room":"302","start":"2018-08-12T13:30:00+08:00","end":"2018-08-12T14:00:00+08:00","speaker":{"name":"Carl Su","bio":"# 社群經歷\nArch Linux Taiwan 共同發起人\nDocker Taipei 共同發起人\nDocker Hack Day 台北場 主辦、評審\nHacking Thursday 值日生\nMozilla 台灣社群 志工\nCOSCUP 2015 開源工作坊 講師\nCOSCUP 2016 LINE Bot 寫扣手 評審\nCOSCUP 2017, 2018 社群議程 協調人\n\n# 近期分享\nDocker 初探 (R-Ladies Taipei)\nHacking Thursday 值日生機器人 (Study4.tw, Hacking Thursday)\n前端工程師也會 Makefile (Vue.js 台灣)\nredux-saga: Side Effect Manager (Hacking Thursday)\nGit Workflows (Mozilla 台灣社群)\nDocker Swarm, Docker on Windows (Docker Taipei)","avatar":"https://coscup.org/2018-assets/img/speakers/s00043.jpg"}},{"id":"0246eff0-6cb2-4ac7-96f0-c4cc8bc2d632","field2":"blockchain-analytics","subject":"通過鏈上資料分析判斷錢包地址歸屬","summary":" 這是一個以當下火熱的區塊鏈為切入點探討數據挖掘和分析價值的議題。區塊鏈上的交易和地址包含了眾多公開資料，通過這些資料能夠獲得哪些資訊是一個非常有意思的話題。我們以比特幣為例，一步一步體驗如何分析鏈上資料，可以對鏈上參與交易的人進行歸類分析。其中包含：1. Petri 模型解釋：地址的 Petri Net + 實體的 Petri Net；2. 地址及實體相關聯的演算法分析；3. python 代碼實現。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-data/%2Fcoscup18-data-blockchain-analytics) ","type":"","room":"202","start":"2018-08-12T13:30:00+08:00","end":"2018-08-12T14:20:00+08:00","speaker":{"name":"李立鴻","bio":"李立鴻，上海交通大學，圖像處理與模式識別研究所博士。主要研究圖像識別技術。現任 BitRabbit 比特兔交易所 CTO。主要業務範圍包括深度學習、數據分析、撮合算法以及區塊鏈相關技術開發。","avatar":"https://coscup.org/2018-assets/img/speakers/s00116.jpg"}},{"id":"7a79f99b-d387-4c7b-bafb-ffcb7f92519c","field2":"osm-community","subject":"有人用了更頭大：OpenStreetMap 的社群營運挑戰","summary":" OpenStreetMap 的圖資在廣為運用之後出現了新的問題與挑戰。例如 Pokemon Go 全面採用之後，公園的數量大幅增加，更有人試圖將不合適的區塊改為公園。如何在資料被廣為採用之際維持資料的品質成為了 OpenStreetMap 如今正在面對的全新課題。作者將試圖介紹社群現在在維護地圖品質上遭遇的狀況及目前擁有的工具。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gis/%2Fcoscup18-gis-osm-community) ","type":"","room":"305","start":"2018-08-12T13:30:00+08:00","end":"2018-08-12T13:55:00+08:00","speaker":{"name":"尤孝庭","bio":"程式設計師，同時也是地圖愛好者。積極參與台灣 OpenStreetMap 的地圖繪製，同時偶爾也會在社群跟大家打打招呼。","avatar":"https://coscup.org/2018-assets/img/speakers/s00129.jpg"}},{"id":"b31d9dd0-d56f-429b-8954-134819d6ef83","field2":"introduction-of-open-build-service","subject":"Introduction of Open Build Service","summary":" The Open Build Service (OBS) is a generic system to build and distribute binary packages from sources in an automatic, consistent and reproducible way. You can release packages as well as updates, add-ons, appliances and entire distributions for a wide range of operating systems and hardware architectures.\n\nOpen Build Service \nCreate and Distribute Software Packages for all the Major Linux Distribution s with all the Tools to Work Together \nComprehensive \nA generic system to build and distribute packages from sources in an automatic consistent and reproducible way. Release your software for a wide range of operating system and hardware architectures. \nCollaborative \nProvides all the tools to work collaboratively and harness the power of the open source development model. Set fine grained access rights, branch code, send merge requests and review submissions.\n\nOBS is \nFor Users \nFor Packagers \nFor Free Software Projects and Independent Software Vendors\n\nThis Open Build Service (OBS) talk will base on \n1. What can the Open Build Service do? \n2. How to use OBS to create your own rpm/packages \n3. How to co-work with OBS \n4. Use Git and OBS for developers \n5. How can you build containers with OBS? - Introduction of OBS Container Registry. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-introduction-of-open-build-service)","type":"","room":"201","start":"2018-08-12T13:30:00+08:00","end":"2018-08-12T14:00:00+08:00","speaker":{"name":"AL Cho","bio":"openSUSE Taiwan member, love open sourcea and\nfreedom software","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"abcefa02-3b94-474d-8413-9981be1fda2b","field2":"libreoffice","subject":"LibreOffice The Swiss Army Knife of Document Creation","summary":" I will be discussing LibreOffice and Open Document Format (ODF) at an introductory level. Both initiatives are backed by The Document Foundation (TDF), a non-profit organization in Germany. LibreOffice is a free and open source cross-platform office application suite, it is available for a number of operating systems, such as Windows, MacOS, and Linux. Additionally, as a truly globalized application, it is available in many different languages of the world. It is used daily by tens of millions of people. I will also be talking about the improvements in LibreOffice Version 6.1. Furthermore, I will be demonstrating a number of interesting usages of LibreOffice in creating documents such as product catalogs, e-books, and PDF forms. Participants will gain a good understanding of what LibreOffice is about and how they can contribute to its community. Participants will appreciate the diversity of documents that can be created with LibreOffice through the live demonstrations and how easy it is to learn. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-libreoffice)","type":"","room":"304","start":"2018-08-12T14:30:00+08:00","end":"2018-08-12T15:00:00+08:00","speaker":{"name":"Edwin C. L. Lee","bio":"I included the following bio with my talk submission:\nI am a seasoned technology solutions consultant, with experiences ranging from enterprise systems, such as SAP  to innovative greenfield software. My previous employers include IBM and Intel. Currently, I operate a software consultancy based in Hong Kong. In many of the solutions I design and implement for my clients, the use of open source software is a key component. I am a part of the LibreOffice marketing community.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"9d378cb4-a9e7-4fa2-a451-9c442a9cd896","field2":"the-command-line-ruby","subject":"The Command Line Ruby","summary":" 除了用 ruby -v 來檢查版本之外， 你曾經在 command line 直接執行過 Ruby 嗎?\n\nRuby 作為 Perl 的接班人，延續了許多好用的 command line 功能。 像是方便的讀取檔案，各種實用的預設變數，不用檔案直接執行程式碼。 讓我們一起來探索各種鮮為人知的 Ruby 功能。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-ruby/%2Fcoscup18-ruby-the-command-line-ruby) ","type":"","room":"502","start":"2018-08-12T13:30:00+08:00","end":"2018-08-12T14:00:00+08:00","speaker":{"name":"John Lin","bio":"Lead Engineer at iCHEF. Ruby lover. Full-stack developer. [ErRuby](https://github.com/johnlinvc/erruby) developer. Organizer of Swift Taipei. iOS developer. FP lover. find me at [johnlin.vc](https://johnlin.vc)","avatar":"https://coscup.org/2018-assets/img/speakers/s00030.jpg"}},{"id":"287f7e27-3ad3-4074-8955-3d3ad9dc6970","field2":"android-treble","subject":"Android Treble: Faster Updates and Easier Upgrades","summary":" Give out a tour about what is Android Treble at Google Android team, it was first introduced in 8.0/8.1, then enhanced in 9.0 this year. Will briefly cover its technical aspects such as VNDK, Binderized HAL, Build Split, etc. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-android/%2Fcoscup18-android-android-treble)","type":"","room":"308","start":"2018-08-12T13:40:00+08:00","end":"2018-08-12T14:30:00+08:00","speaker":{"name":"Merck Hung","bio":"Technical Account Manager in Android Partner Engineering","avatar":"https://coscup.org/2018-assets/img/speakers/s00022.jpg"}},{"id":"f7092770-9af5-4c94-aa6b-3a0e0777b130","field2":"global-community","subject":"開源軟體與社群 - 參與國際社群經驗談","summary":" 在此次的演講, 會聊到為何會加入台灣社群, 為何會加入國際社群, 讓來參加的朋友對參與國際社群, 舉辦會議以及申請旅行補助有相關了解. 個人參與國際社群的動力為何?（增廣見聞? 練英文?） 參與國際社群的方式？(如何跨出第一步? 如何進行後續貢獻?) openSUSE / GNOME 國際社群介紹 ---- GNOME 會議 ( GNOME.Asia Summit / GUADEC )介紹 ---- openSUSE 會議 ( openSUSE Conference / openSUSE.Asia Summit ) 介紹 ---- 申請 openSUSE / GNOME 會議旅行補助的條件與流程 與不同國家社群成員合作相關經驗與方式 （ IRC ? Mail ? ） 舉辦國際會議 經驗 / 趣味分享談 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome301-global-community)","type":"","room":"301","start":"2018-08-12T13:45:00+08:00","end":"2018-08-12T14:30:00+08:00","speaker":{"name":"Max Huang","bio":"Working at NCHC\nStudy Area 酷學園 & 鳥哥私房菜 小雜工\nopenSUSE Member / openSUSE.Asia Committee Member\nGNOME.Asia Committee Member\n喜歡社群自由無私的分享、熱愛自由軟體及 Linux 所帶來的方便性\n\nhttps://sakanamax.github.io/","avatar":"https://coscup.org/2018-assets/img/speakers/s00023.jpg"}},{"id":"97ae32fb-153d-419e-a587-31854150a6ca","field2":"ibus-cloud","subject":"iBus 引擎的 cloud 后端词库","summary":" 我很荣幸的参加 Google summer code，作为一名导师，带领学生和上游 mentainer 一起为 iBus 的输入引擎开发了基于 Google，Baidu 之类云端词库的被选词支持。iBus 是一套完全整合于 Gnome 桌面中的输入法框架，我们使用 Gnome/glib/gtk 的基础技术直接访问云端的 Rest 接口并处理各种异常情况，并整合到 ibus 之中。由此产生一些经验和心得希望于各位分享。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome306-ibus-cloud) ","type":"","room":"306","start":"2018-08-12T13:45:00+08:00","end":"2018-08-12T14:30:00+08:00","speaker":{"name":"赵强","bio":"我在 openSUSE 社群中做了许多工作，主要参与了中日韩和东亚各语言的国际化工作。主要内容包括输入法，字体，翻译等。","avatar":"https://coscup.org/2018-assets/img/speakers/s00095.jpg"}},{"id":"62276107-8d54-4b6e-9c89-c9639a5907bf","field2":"the-apache-way","subject":"The Apache Way: Contributing to Apache Projects","summary":" The Apache Software Foundation is an all-volunteer organization that maintains and incubates over 350 open source projects that cover a wide range of technologies. Contributing to an Apache project is certainly one of the most direct ways to get in contact with some of the most brilliant software mindsets worldwide to work together on exciting ideas.\n\nHowever, for some beginners to open-source contribution, taking that first step and submitting your first pull request could be quite intimidating.\n\nThis talk aims at introducing how Apache projects operate, how you can engage a project as a new contributor, and key points that lead to a rewarding contribution experience. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-oss/%2Fcoscup18-oss-the-apache-way)","type":"","room":"401","start":"2018-08-12T13:40:00+08:00","end":"2018-08-12T14:10:00+08:00","speaker":{"name":"戴資力 Tzu-Li (Gordon) Tai","bio":"Tzu-Li (Gordon) Tai is an Apache Flink PMC Member and Committer. He works at data Artisans, where he works full-time on open-source contribution for Flink. His main contributions in Flink includes some of the most widely used streaming connectors in Flink (for Apache Kafka, Elasticsearch, AWS Kinesis, etc.), as well as features around streaming state management. He is a frequent speaker in conferences such as Strata Data, Flink Forward, various Flink meetups, and Taiwan-based conferences on the Hadoop ecosystem and data engineering in general.","avatar":"https://coscup.org/2018-assets/img/speakers/s00052.jpg"}},{"id":"657d1df0-d870-4de5-90f3-5560b7579ef1","field2":"taiwan-on-the-map","subject":"Putting Taiwan on the Kernel.org Keysigning Map","summary":" Requesting a kernel.org account requires you to have a GPG key signed by 3 or more current kernel.org account holders. This talk goes through how I got my account, and how I helped others through the process. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-taiwan-on-the-map)","type":"","room":"101","start":"2018-08-12T13:50:00+08:00","end":"2018-08-12T14:30:00+08:00","speaker":{"name":"蔡鎮宇 / Chen-Yu Tsai","bio":"Chen-Yu is a software engineer / system administrator at CloudMosa, Inc. In his spare time, he co-maintains Allwinner support in the Linux Kernel, and maintains the systems for Ptt BBS.","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"5e386668-e329-46f0-90d5-22efe88762f7","field2":"voronoi-diagram","subject":"用 GRASS 繪製連鎖店各分店的勢力範圍地圖 Voronoi Diagram","summary":" 假設你手邊有某區域內的所有無線基地臺的座標。 你可以用 GRASS 裡的向量工具畫出各基地臺的責任區 / 勢力範圍地圖。 這稱為 Voronoi Diagram， 是計算幾何領域裡很實用的一個演算法。 它甚至可應用於 3D 的資料。 它的對偶圖 Delauny Triangulation 則可以用來規畫 mesh network， 可應用於例如佈署物聯網感測器的情境。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gis/%2Fcoscup18-gis-voronoi-diagram) ","type":"","room":"305","start":"2018-08-12T13:55:00+08:00","end":"2018-08-12T14:20:00+08:00","speaker":{"name":"洪朝貴","bio":"經歷過『野蠻工讀生』的慘痛經驗，對高昂的『下賊船的代價』特別有警覺性。 透過戰鬥部落格『資訊人權貴ㄓ疑』及技術教學部落格『玩具烏托邦』協助大眾『邁向自由穩健走』。 (請搜尋)","avatar":"https://coscup.org/2018-assets/img/speakers/s00097.jpg"}},{"id":"5ef20ea9-aaad-4630-a48f-fa504c8de62a","field2":"arch-linux-package","subject":"Arch Linux package 的前世今生","summary":" 討論 Arch Linux package 的各種議題，從基本的 PKGBUILD 撰寫、makepkg 使用、AUR 的使用、到進階議題如 clean chroot，package signing 與 local repo，最後會分享一個我自己寫的 AUR helper \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-arch/%2Fcoscup18-arch-arch-linux-package) ","type":"","room":"302","start":"2018-08-12T14:00:00+08:00","end":"2018-08-12T14:45:00+08:00","speaker":{"name":"顏志軒","bio":"是個 Arch Linux 使用者兼 Python 愛好者","avatar":"https://coscup.org/2018-assets/img/speakers/s00049.jpg"}},{"id":"d8fd1c82-3470-4e6e-a4d6-5ebfb91c7206","field2":"oin-linux","subject":"OIN Linux 系統專利合作計畫","summary":" Open Invention Network, OIN, 是由 IBM, NEC, Philips, Sony, Redhat, Novell, Google, Toyota 所資助的非盈利性組織， 成立的目標在透過專利交互授權的方式，讓所有參與的成員在使用 Linux 系統免於專利侵權的困擾，以達成開放式創新。加入的成員，除了成員間在 Linux 系統的專利交互授權，還可以免費得到 OIN 所擁有超過一千三百個專利的授權。希望透過這次機會，介紹 OIN 組織和運作方式，讓更多台灣的開源朋友了解也加入我們。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-compliance/%2Fcoscup18-compliance-oin-linux)","type":"","room":"503","start":"2018-08-12T14:00:00+08:00","end":"2018-08-12T14:20:00+08:00","speaker":{"name":"黃鴻文","bio":"超過 10 年經營開源商務 / 社區","avatar":"https://coscup.org/2018-assets/img/speakers/s00065.jpg"}},{"id":"d11061d5-b7c7-449a-affc-cb361f96097d","field2":"5-methods","subject":"網站效能表現問題分析的五個方法","summary":" Drupal 作為內容管理系統，具有規劃完善的資料庫，讓使用者便於透過各種模組建置高效能的網站。網站內容不斷增加下，效能問題或瓶頸可能慢慢湧現，有效的分析問題與找出效能瓶頸便相當重要。如何運用 Drupal 找出問題，對於 Drupal 網站有什麼解決之道，將提出五個有效的方法分享給與會的聽眾。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-drupal/%2Fcoscup18-drupal-5-methods) ","type":"","room":"501","start":"2018-08-12T14:10:00+08:00","end":"2018-08-12T14:50:00+08:00","speaker":{"name":"吳政斌","bio":"玩轉 Unix、工業設計、網路程式之間，從是什麼都會一些的網路設計師。致力於推廣 Drupal 網站開發，為 Drupal Taiwan 核心成員之一。對於 PHP 、 javascript 、 Twig/Liquid 架構皆有涉獵，努力成為忍者級的 Drupal 工程師。 近年專注於 RWD 網站技術，以及 Shopify 電商網站開發。","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"e0aa35ae-6caa-4f5e-954b-95bd240b59de","field2":"easier-building-iot-application-use-tamashii","subject":"Easier building IoT application use Tamashii","summary":" The Tamashii project provides framework to building IoT application, but we are limited by their tamashii-agent gem. But Tamashii Component, a framework which provides abstract interface let us can craft agent by add gem into our project. For example, Tamashii Component allows users to add IoT component gem directly (eg. tamashii-led) and control led via our Tamashii Component interface. This change the way we use Tamashii, and more flexible compose any devices when we use it.\n\nIn this talk, I’ll explain why we use Tamashii and how Tamashii Component are working to solves the above mentioned problems. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-ruby/%2Fcoscup18-ruby-easier-building-iot-application-use-tamashii)","type":"","room":"502","start":"2018-08-12T14:10:00+08:00","end":"2018-08-12T14:40:00+08:00","speaker":{"name":"林政隆","bio":"Software engineer at 5xruby.tw, Taipei, Taiwan. Also a master student at the Department of Computer Science and Information Engineering at National Taiwan University of Science and Technology, Taipei, Taiwan.","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"07b0ac76-fff1-4dad-8a94-f481023d894d","field2":"opensuse-leap-flatpak","subject":"openSUSE Leap & Flatpak","summary":" This proposal is a continuation of my previous topic on last summit \"Flatpak & AppImage Usage on openSUSE. Which One Suitable for openSUSE Users?\" (https://events.opensuse.org/conference/summitasia17/program/proposal/1502) that i'm rely on Flatpak on openSUSE Leap since 42.x until 15.0.\n\nUsing Flatpak on openSUSE is such a great way that people can use latest application through Flatpak on stable system with openSUSE Leap. Sometimes, people also can try nightly build apps with Flatpak without dependencies hell or break the system and install the same apps with multiple versions. Flatpak (formerly xdg-app) is a software utility for software deployment, package management, and application virtualization for Linux desktop computers. It provides a sandbox environment in which users can run applications in isolation from the rest of the system. Applications using Flatpak need permission from the user to control hardware devices or access the user's files.\n\nOn this proposal, I will tell my experience that i am encounter in daily use on last two years on using Flatpak with openSUSE Leap. The audience are Linux user, begineer or advanced. Attendees can expect a how Flatpak use on openSUSE Leap in a great way. This proposal will help users to know how to install with software packages without being confused with dependencies. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-opensuse-leap-flatpak)","type":"","room":"201","start":"2018-08-12T14:15:00+08:00","end":"2018-08-12T14:30:00+08:00","speaker":{"name":"Kukuh Syafaat","bio":"FOSS Enthusiast","avatar":"https://coscup.org/2018-assets/img/speakers/gnomeasiasummit.jpg"}},{"id":"6f73a472-2437-476e-b4b1-07a5023f32c7","field2":"python-package-with-c","subject":"My experence to create a python package with C language","summary":" During my daily works, I need to create a python package with C language. it is a challenge to finish this in a short time, I read some guide, met some troubles, try my best to fix it and finally have got some tips. if you know how to program in C. such extension modules can do two things that can't be done directly in Python: they can implement new built-in object types, and they can call C library functions and system calls. To support extensions, the Python API (Application Programmers Interface) defines a set of functions, macros, and variables that provide access to most aspects of the Python run-time system. The Python API is incorporated in a C source file by including the header\"Python.h\". The compilation of an extension module depends on its intended use as well as on your system setup; details are given in the talk. I hope to share it with other people in our community. Thanks! \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-python-package-with-c)","type":"","room":"304","start":"2018-08-11T15:30:00+08:00","end":"2018-08-11T15:45:00+08:00","speaker":{"name":"赵强","bio":"我在 openSUSE 社群中做了许多工作，主要参与了中日韩和东亚各语言的国际化工作。主要内容包括输入法，字体，翻译等。","avatar":"https://coscup.org/2018-assets/img/speakers/s00095.jpg"}},{"id":"eed74478-a683-4f35-b741-7daa5051769d","field2":"application-synthesizer","subject":"Application Synthesizer","summary":" The application synthesizer allows the testers to define and automatically deploy synthesized applications, components, and their features according to a form of high-level specification. The specification could define the number of VMs deployed, each VM’s resources (such as memory, CPU, disk, and networking parameters), the type of applications in a VM (such as load balancer, web server or database server), VM’s communications mechanisms (such as socket or queues), anomaly event triggers by VM (such as rebooting an application and up/down interfaces according to timer), etc. With such a powerful application synthesizer, the testers possess the capability to reliably test Application Performance Management in a controlled and scalable cloud environment. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-oss/%2Fcoscup18-oss-application-synthesizer)","type":"","room":"401","start":"2018-08-12T14:15:00+08:00","end":"2018-08-12T15:00:00+08:00","speaker":{"name":"Ming Jiang","bio":"Dr. Ming Jiang received his BS and MS degrees in electrical engineering from National Taiwan University and PhD degree in electrical engineering and computer science from University of Illinois at Chicago. He has been with several academic institutes (University of Alaska Fairbanks, National Taiwan University, Chung Cheng University) and industrial leading companies in high-performance/supercomputing, cloud computing, telecommunications, networking and Internet security (ARSC supercomputer center, 3COM, Tellabs, Symantec, Ericsson) for more than 25 years combined. His research interests and specialty are cloud computing and Internet security, especially in the areas of virtualization, Software-Defined Data Center, and SDN enabled networks. He is currently with ITRI as a Technical Director.","avatar":"https://coscup.org/2018-assets/img/speakers/s00132.jpg"}},{"id":"1fc0c0d1-7e32-4681-b134-9eda96250a4a","field2":"osm-vr","subject":"使用開放街圖於混合實境展示應用","summary":" 開放街圖 (OpenStreetMap，OSM)為一個開放的全球性製圖平台，透過維基式 (wiki-style) 方式協同合作，任何人都可以參與製圖，且自由與免費地使用地圖。全球目前超過 400 萬製圖者 參與這個開放的製圖計畫，並貢獻超過 40 億的資料點(node)。而混合實境(Mixed Reality，MR) 是融合了虛擬實境 VR 與擴增實境 AR 的特性，在投影虛擬物件的同時、也能看到現實環境。本研究透過 Unity 遊戲引擎實作混合實境 APP，即時展示使用者所在地範圍內之開放街圖資料，透過手持裝置之 GPS 與陀螺儀控制首場景攝影機的位置、方位角與姿態，以達到視界所至，開放街圖資訊即所現的虛實整合展示。初步實驗結果顯示開放地理資料可於擴增實境環境呈現，然而仍存在 GPS 精度問題，因此虛實套疊狀況會有些誤差與飄移現像，後續待手持裝置之 GPS 精度提升後，展示效果應可大大提升。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gis/%2Fcoscup18-gis-osm-vr) ","type":"","room":"305","start":"2018-08-12T14:20:00+08:00","end":"2018-08-12T14:45:00+08:00","speaker":{"name":"黃敏郎","bio":"聚禾工程顧問有限公司 技師, QGIS 小學堂小編","avatar":"https://coscup.org/2018-assets/img/speakers/s00066.jpg"}},{"id":"cd813c0c-1212-472c-b6d2-37be9169d405","field2":"different-perspectives-around-compliance","subject":"Different perspectives around compliance","summary":" Panel Discussion - Open Source Compliance Today and Tomorrow \n\nHost by Shane\n\nPanelist\n\n* Florence T.M. Ko 葛冬梅\n* Hiroyuki Fukuchi\n* Shinsuke Kato\n* Lucien C.H. Lin 林誠夏\n* Satoru Ueda\n* 黃鴻文\n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-compliance/%2Fcoscup18-compliance-different-perspectives-around-compliance) ","type":"","room":"503","start":"2018-08-12T14:30:00+08:00","end":"2018-08-12T15:30:00+08:00","speaker":{"name":"Shane Coughlan","bio":"Shane Coughlan is an expert in communication, security and business development. His professional accomplishments include spearheading the licensing team that elevated Open Invention Network into the largest patent non-aggression community in history, establishing the leading professional network of Open Source legal experts and aligning stakeholders to launch both the first law journal and the first law book dedicated to Open Source. He currently leads the OpenChain community as Project Director.\n\nShane has extensive knowledge of Open Source governance, internal process development, supply chain management and community building. His experience includes engagement with the enterprise, embedded, mobile and automotive industries.","avatar":"https://coscup.org/2018-assets/img/speakers/s00010.jpg"}},{"id":"d4b2acdf-f739-441e-a0aa-bd3968c217a9","field2":"utensor","subject":"uTensor: AI on Microcontroller","summary":" uTensor is a framework that enables developers to deploy machine learning models on Microcontrollers (MCUs).  AI inference today are typically done on high-performance computing units, such as, GPUs and TPUs. MCUs are low-energy and low-cost units. Deploying machine learning models on MCUs is a challenge because of their limited RAM size, flash capacity and clock-speed. uTensor addresses this by converting models directly into importable C++ source code, supporting quantization operators and using resource management schemes. In this talk, we will introduce Tensor, its run-time, code-generator and future work. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-data/%2Fcoscup18-data-utensor)","type":"","room":"202","start":"2018-08-12T14:30:00+08:00","end":"2018-08-12T15:20:00+08:00","speaker":{"name":"Neil Tan / Kazami Hsieh / DBoy Liao","bio":"Neil Tan is an ARM developer evangelist with a keen interest on IoT and machine learning. He is a speaker at FOSDEM, O’Reilly AI conference and a core-developer of uTensor. He works closely at open source developer communities in Asia and has taken parts as design-contest judge and event guest speaker.\n---\n\n---","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"dea0e60a-62e9-41ca-82b3-76108143050b","field2":"introduction-to-opensuse-portus","subject":"Introduction to openSUSE Portus","summary":" Portus is an open source authorization service and user interface for the next generation Docker Registry.\n\nSecure:\n\nImplements the new authorization scheme defined by the latest version of the Docker registry. It allows for fine grained control over all of your images. You decide which users and teams are allowed to push or pull images. \nMap your company organization inside of Portus, define as many teams as you want and add and remove users from them.\n\nEasily manage users with teams:\n\nTeams have three different types of users to allow full granularity:\n\n* Viewers: can only pull images. \n* Contributors: can push and pull images. \n* Owners: like contrinutors, but can also add and remove users from the team\n\nPortus provides an intuitive overview of the contents of your private registry. It also features a search capability to find images even faster.\n\nSearch: \nUser privileges are constantly taken into account, even when browsing the contents of the repository or when performing searches.\n\nThe Docker Registry on the market is very varied. Do you still have a headache to choose? \nCan try Portus, this is a OpenSource tool, but also provides beautiful UI operation \nThe heart is better to learn immediately \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-introduction-to-opensuse-portus)","type":"","room":"201","start":"2018-08-12T14:30:00+08:00","end":"2018-08-12T15:00:00+08:00","speaker":{"name":"Daniel Lin","bio":"","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"c1291386-e342-4e39-ac66-c8846a780d9a","field2":"android-in-the-cloud","subject":" Android-in-the-cloud, a combination of android-x86 open source project and container technology","summary":" In COSCUP2017 we introduced “clondroid”, a mobile virtualization open source project developed by ITRI, Taiwan. This year we are going to introduce android-in-the-cloud, an os-level-virtualization technology that enables x86 server to host multiple independent android instances in  containers with resource control feature based on cgroup.  Thru innovative gpu-virtualization every android instance gains gpu’s 3D-acceleration.  In this presentation it’s planned to talk about the project motivation, difficulties encountered , and interesting discoveries.  It’s worthy to mention that we picked android-x86, another open source project initiated by Taiwan’s developer (Chih-Wei Huang), as a stepping stone of android-in-the-cloud. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-android/%2Fcoscup18-android-android-in-the-cloud)","type":"","room":"308","start":"2018-08-12T14:40:00+08:00","end":"2018-08-12T15:30:00+08:00","speaker":{"name":"吳天健 (Wu Tian-Jian)","bio":"I am a software engineer in data center system software division of ITRI (previous ITRI Cloud Computing Center for Mobile Application)","avatar":"https://coscup.org/2018-assets/img/speakers/s00122.jpg"}},{"id":"5538eb90-1713-443e-aa59-8f4b00444dcc","field2":"mysql-security","subject":"如何善用 MySQL 的安全機制打造固若金湯的系統","summary":" 安全性是所有資訊系統最重要的性能指標, 在這個網路攻擊氾濫的世界裡, 沒有安全防衛的系統將毫無生存的餘地. 而資料庫又是大多數應用系統的核心, 它能運作得好能帶您上天堂, 資料保護得不好將讓您下地獄. 這場演講將為您揭露許多 MySQL 不太為人所知的安全機制, 它會澈底扭轉大部份人心中對 MySQL 安控機制不够完整的印象. 同時還會分享如何設定及使用這些安控功能, 而這些安控功能又如會防制不同種類的網路攻擊. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-mysql-security)","type":"","room":"101","start":"2018-08-12T14:40:00+08:00","end":"2018-08-12T15:30:00+08:00","speaker":{"name":"杜修文","bio":"目前是甲骨文 MySQL 全球事務部北亞區技術顧問主管, 自 2010 年起就在大中華及亞太地區推廣 MySQL 技術並協助企業用戶引進 MySQL 和輔助大型 MySQL 項目的推行. 他在 2009 年通過 MySQL DBA 和 MySQL Cluster 認證, 同時也是臺灣 MySQL 使用者社群的發起人.","avatar":"https://coscup.org/2018-assets/img/speakers/s00113.jpg"}},{"id":"640e0ed5-fa07-4ba0-a26a-e5c6943408b8","field2":"arch-linux-aur","subject":"打包自製套件 - Arch Linux AUR","summary":" Arch Linux 的套件打包描述檔 PKGBUILD 比起 RedHat/Ubuntu/Debian/Gentoo 的打包語言，可算是相對簡易上手 Linux 套件打包方式，本 workshop 將介紹如何建立 AUR 帳號，編寫 PKGBUILD，上傳 AUR 提供他人使用 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-arch/%2Fcoscup18-arch-arch-linux-aur) ","type":"","room":"302","start":"2018-08-12T14:45:00+08:00","end":"2018-08-12T15:30:00+08:00","speaker":{"name":"Daniel Lin 林原志","bio":"* 1992 年開始使用 Xenix shell\n* 寫過最長 shell script 約 2000 多行\n* 2005 開始使用 Arch Linux\n* 2013 開發 sh4twbox 幫網樂通建置 Arch Linux 套件","avatar":"https://coscup.org/2018-assets/img/speakers/s00104.jpg"}},{"id":"35d765ea-d07e-489b-beee-1a76ac190245","field2":"maps-in-r","subject":"Maps in R","summary":" 一班人如果不會使用 GIS 軟體繪圖，要如何使用 R 來做簡易的地圖視覺化呢？\n其實 R 裡面已經有不少套件都是可以拿來讀取地理圖形資料並且進行繪製與資料處理。本節預計從簡易介紹地理圖資特性開始、如何使用 R 做基本的地圖繪製，並介紹在 R 軟體中不同地圖相關套件的使用方式等。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gis/%2Fcoscup18-gis-maps-in-r) ","type":"","room":"305","start":"2018-08-12T14:45:00+08:00","end":"2018-08-12T15:30:00+08:00","speaker":{"name":"林怡","bio":"現為地圖測試工程師一枚，每天都會碰到地圖，但腦袋裡沒有內建地圖。程式新手。擅長使用的工具是 GIS 軟體，自學 R 與 Python 的進度十分緩慢。本體是每到一個新城市就會拿好幾種當地地圖放入行李箱的地圖控。","avatar":"https://coscup.org/2018-assets/img/speakers/s00107.jpg"}},{"id":"9bc6695b-3dba-4182-b4d2-5be9a64661ac","field2":"gnome-inside","subject":"The future of the computer classrooms - GNOME inside / 電腦教室的未來 - GNOME inside","summary":" 你對電腦教室的想像是什麼? Intel inside? 還是 Microsoft inside? 從現在開始，沒有懸念，當然是 GNOME inside \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome301-gnome-inside) ","type":"","room":"301","start":"2018-08-12T14:45:00+08:00","end":"2018-08-12T15:30:00+08:00","speaker":{"name":"Eric Sun","bio":"天真的以為自由軟體應該要成為國家的「軟體應用公共基礎建設」的人","avatar":"https://coscup.org/2018-assets/img/speakers/gnomeasiasummit.jpg"}},{"id":"7a960dc5-3d48-4923-9ec1-06f68e0adb8d","field2":"humanitarian-foss-projects","subject":"Humanitarian FOSS projects","summary":" HFOSS projects are the humanitarian open source projects that are developed by keeping society needs in mind like in developing countries the issues like poverty, facilities for differently abled people,  poor health care, education, etc are the major concerns. The GNOME Accessibility project develops and fosters compelling free open source accessibility solutions for graphical user interfaces. Through a worldwide community of developers and users, we continue to empower everyone, regardless of physical or mental abilities. GNOME has been translated to many of the world's languages. Humanitarian projects & students is  a good match for the welfare of the society. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome306-humanitarian-foss-projects)","type":"","room":"306","start":"2018-08-12T14:45:00+08:00","end":"2018-08-12T15:30:00+08:00","speaker":{"name":"Shobha Tyagi","bio":"I am from India, open source enthusiast. Educator.","avatar":"https://coscup.org/2018-assets/img/speakers/s00009.jpg"}},{"id":"9e516cb8-39ed-44ff-a46b-0916f39262a3","field2":"drupal-blockchain","subject":"打造連韭菜都會用的雙因素認證機制，不裝 APP 怎麼可能啦—— Drupal + Blockchain 輕鬆實現","summary":" 結合區塊鏈技術，不用安裝任何 APP 便能讓您的 Drupal 網站免費升等為潮到滴水的雙因素認證 (Two Factor Authentication) 安全等級，一切都在背後自動完成，連高風險的韭菜族群都能輕易使用。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-drupal/%2Fcoscup18-drupal-drupal-blockchain) ","type":"","room":"501","start":"2018-08-12T14:50:00+08:00","end":"2018-08-12T15:30:00+08:00","speaker":{"name":"Jambo Hsu","bio":"全端工程師，任職於 AUO，致力研究各種新技術於企業內部的應用，前後端軟硬體來者不拒的中本聰粉。","avatar":"https://coscup.org/2018-assets/img/speakers/s00136.jpg"}},{"id":"702149f4-3ddd-4da7-aecd-c30d5b9c7adc","field2":"game","subject":"來做一個日系卡牌手遊吧！","summary":" ### 很簡單的原理（30min）\n\n如果你是一個網站開發者，其實已經掌握了必要的條件。日系的卡牌手遊跟過去我們熟悉的線上遊戲不太一樣的地方，主要是在於不需要保持連線，以及玩家的即時互動。\n\n所以，開發一個日系卡牌手遊主要就會落在兩個重點上。\n\n* API 伺服器\n* 遊戲端的表演\n\n使用 Ruby on Rails 來開發手遊是一個不錯的選擇，必要的功能都已經具備，只需要透過實作將想要設計的手遊製作出來。\n\n接下來我們會實作手遊的登入、抽卡跟任務關卡。\n\n### 搭建 OAuth 伺服器（60min）\n\n如果有 App 開發經驗的話，可能會知道使用 OAuth 算是一個不錯的選擇。而常被跟 Unity3D 搭配來開發一些簡易的手遊伺服端功能的 FireBase 服務，也是採用 OAuth 的方式。\n\n所以，我們要先使用 Ruby on Rails 的 OAuth 伺服器套件 Doorkeeper 設定一個提供給手遊玩家的 OAuth 伺服器，讓玩家可以將手機跟帳號連結起來。不過大多數時候，手遊的 OAuth 伺服器其實是有特殊修改過的，因為相較於一般網站使用帳號密碼登入，手遊大多會直接幫玩家生成帳號後，再透過紀錄手機的 UUID 來綁定帳號。\n\n也就是說，登入流程會變成：\n\n* （第一次）生成帳號，回傳帳號跟密碼（引繼碼）\n* 透過帳號跟 UUID 產生 Access Token\n* 使用 Access Token 在這次的遊戲中進行\n\n> 以上只是給出一種情況，實際上還有很多細節或者不同的方式可以採用。\n\n完成上述的機制之後，客戶端只需要負責安全的保存帳號、密碼跟 Access Token 就可以正常的運行。\n\n實作：\n\n* OAuth2 伺服器搭建 / 管理\n* Unity3D 實作登入遊戲\n\n### 設計抽卡 API （60min）\n\n身為一個卡牌遊戲，怎麼能少掉抽卡呢！當我們可以順利登入遊戲後，最重要的就是讓玩家可以課金抽卡。不過串接 IAP 之類的事情會花上不少時間，所以我們就先專注在抽卡上吧！\n\n為了確保遊戲的公平性，所以我們要將所有的抽卡過程都在伺服器上實作，玩家只能發出「抽卡」的要求，然後伺服器回應一個「結果」到玩家端身上。\n\n不過跟網頁伺服器不一樣的事，我們不可能每次都將遊戲美術都下載一次。所以我們需要在遊戲開始前先做好素材檔案的打包，在玩家開始遊戲的時候預先的下載好卡片圖檔，而伺服器只需要回應對應的圖片路徑即可。\n\n實作：\n\n* 卡池、抽卡\n* Unity3D 選擇卡池跟顯示抽卡結果\n* 素材包概念（AssetBundle）\n\n### 設計任務 API （60min）\n\n> 跟抽卡差不多，只是實作另一種變化型跟示範簡易的防作弊（拒絕同時進行多個任務）\n\n### 總結（30min）\n\n到此為止，我們已經對如何設計一個卡牌遊戲有粗略地理解。不過在手遊開發上還是有不少地方需要注意，像是玩家大量增加後該如何透過 Sharding 的技巧改善遊戲可容納的玩家數量。跟一般網站不同的是玩家的操作都會造成寫入，要如何盡可能的有效設計 API 跟機制來減少伺服器的消耗，都會是之後需要考慮的課題。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-ruby/%2Fcoscup18-ruby-game) ","type":"","room":"502","start":"2018-08-12T14:50:00+08:00","end":"2018-08-12T15:30:00+08:00","speaker":{"name":"蒼時弦也","bio":"棲息在五倍紅寶石出礦坑的工程師，專長是挖坑。平常都在做網站或者奇怪的遊戲。","avatar":"https://coscup.org/2018-assets/img/speakers/s00061.jpg"}},{"id":"7a04da75-7572-4429-9136-4ae050180a78","field2":"libpinyin","subject":"Integrating Cloud Pinyin in ibus-libpinyin","summary":" Pinyin input method is the most popular input method in China. There are many kinds of Pinyin input methods on ibus, such as ibus-pinyin, ibus-libpinyin and ibus-sunpinyin. All of them need search words from local table dictionary. \nWhat is ibus? The full name of ibus is Input Bus Introduction. It is the default input method framework in SUSE Linux Enterprise and openSUSE GNOME Desktop. ibus-pinyin and ibus-libpinyin work on ibus. ibus and its input method are very important to Asia users of SUSE Linux Enterprise and openSUSE. \nThe cloud computing is the new feature in some commercial input methods in China. They can search and get words from cloud server. Cloud computing can greatly improve the accuracy of the input method. \nThis project is integrating cloud computing in ibus-pinyin or ibus-libpinyin. Many cloud pinyin input methods have apis can be used, Such as baidupinyin and googlepinyin.And Fcitx have finished this work, but it was just a extension on fcitx (fcitx-cloudpinyin). \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-libpinyin)","type":"","room":"201","start":"2018-08-12T15:00:00+08:00","end":"2018-08-12T16:00:00+08:00","speaker":{"name":"Hillwood Yang","bio":"Community contributor of openSUSE project.\nWork for openSUSE M17N project in free time.","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"b4effb04-e471-46b5-a49b-4d58e764c6c4","field2":"having-fun-with-kde","subject":"Having fun with KDE: create a Plasmoid","summary":" K Desktop Environment or KDE is one of the most popular in Linux. Many features provided by KDE. This is my favorite desktop environment that I use everyday with openSUSE.\n\nOn this session I will talk about one of the cool features of KDE, namely Plasmoid, a simple script for the plasma engine. I am focusing on writing QML (Qt Modeling Language) script to create a Plasmoid. QML is a user interface markup language. It is a declarative language for designing user interface–centric applications. Inline JavaScript code handles imperative aspects.\n\nOn this talk I will explain how to create plasmoid as RSS feed reader, for example fetching RSS feed of openSUSE.id blog. This feed will be displayed on desktop if the blog was updated. Plasmoid will send a notification on desktop.\n\nI will explain how to write QML code using Qt libraries, compile the plasmoid, install it on the desktop, and also give tips and tricks using QML to create other Plasmoid. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-having-fun-with-kde)","type":"","room":"304","start":"2018-08-12T15:00:00+08:00","end":"2018-08-12T16:00:00+08:00","speaker":{"name":"Yan Arief","bio":"Linux System Administration","avatar":"https://coscup.org/2018-assets/img/speakers/opensuseasiasummit.jpg"}},{"id":"4df94c1f-dcff-47c9-91fa-af4d3d327ad7","field2":"building-popular-open-source-projects","subject":"Building popular open source projects","summary":" This talk introduces the tips and tricks of building open source projects \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-oss/%2Fcoscup18-oss-building-popular-open-source-projects) ","type":"","room":"401","start":"2018-08-12T15:00:00+08:00","end":"2018-08-12T15:30:00+08:00","speaker":{"name":"Yo-An Lin (c9s)","bio":"從 2007 年開始投入開放原始碼社群及專案已有十年，專精領域從 UI/UX Design, Visual Design, 前端如 TypeScript, JavaScript, CSS/SASS 等至後端技術如 Perl, Golang, PHP, NodeJs 等等。\n於 2011 年開始使用 Go 程式語言開發工具 ，並於 2012 年將 Go 程式語言應用於正式環境 (Production) ，發布十多個 Go 相關開源專案，為 Golang 核心專案貢獻者之一。\n曾在 Perl 最大的開放原始碼模組平台 CPAN 維護近五十個模組，至今在 GitHub 上開源約兩百多個專案。\n知名專案為 PHPBrew, Maghead (ORM), Pux, CLIFramework 以及如 C 語言開發的高效能路由函式庫 r3。\n其他曾參與貢獻的知名開源專案有 Google Go / HHVM / PHP (Zend Engine) / Jifty Perl Web Framework 等等。\n曾為 2013 年 GitHub top 1 contributions user.","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"5318319c-0268-4ed6-ae9c-3da1cd0ada77","field2":"using-your-domain-name","subject":" Freedom, thanks to your domain name!","summary":" Your internet presence starts with a domain name! You can use it for e-mail (SMTP, IMAP, POP3), your website with HTTP(s), your applications (VoIP, XMPP, RTSP, FTP ...). This talk with give a high level overview what you should know about your domain name and why its among your most important digital assets. We will also look into how to protect it properly and use it with a team of developers. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-using-your-domain-name)","type":"","room":"101","start":"2018-08-12T15:40:00+08:00","end":"2018-08-12T16:10:00+08:00","speaker":{"name":"Thomas Kuiper","bio":"Thomas Kuiper is the General Manager of the Asia subsidiary of domain name registrar Gandi and originally from Germany. He worked on embedded systems and content management systems for companies in Taiwan and Europe before he set himself to the task to start Gandi's Asia business unit. Gandi (abbreviation for\"Gestion et Attribution des Noms de Domaine sur Internet\"in French or\"Management and Allocation of Domain Names on the Internet\" in English) is a company that provides domain name registration and management in addition to Internet hosting infrastructure and related services.\n\nThe company has its head office in Paris and offices in San Francisco, Luxembourg and Taipei to serve its customers around the clock. Gandi was among the first European domain name registrars to offer \".COM\" and \".NET\" and now manages over 2 million domain names with accreditation for over 700 different domain name extensions for its customers, placing Gandi among the top domain name registrars worldwide.","avatar":"https://coscup.org/2018-assets/img/speakers/s00005.jpg"}},{"id":"7a3e0f61-45f9-4fa8-90cf-c0f3281d8290","field2":"source-code-navigation-assistant","subject":"Source Code Navigation Assistant","summary":" Nowadays, the screen readers are used for the blind people to read the text on the screen. The speech speed of the screen reader is usually incredibly fast, and it reads almost everything on the screen.  Also, the generated speech is not so friendly for the users.\n\nHowever, it's important for people to quickly get the meaningful summary of the current source code navigation, even for people with average eye-sight.\n\nThis talk introduces you the design of the navigation assistant, and the technical implementation details of the tool.\n\nThe assistant is implemented in Go, and its language parser is used to generate a short comprehensive summary, and the text will be converted to voice speech to improve your source code navigation experience. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-source-code-navigation-assistant)","type":"","room":"101","start":"2018-08-12T16:15:00+08:00","end":"2018-08-12T16:45:00+08:00","speaker":{"name":"Yo-An Lin (c9s)","bio":"從 2007 年開始投入開放原始碼社群及專案已有十年，專精領域從 UI/UX Design, Visual Design, 前端如 TypeScript, JavaScript, CSS/SASS 等至後端技術如 Perl, Golang, PHP, NodeJs 等等。\n於 2011 年開始使用 Go 程式語言開發工具 ，並於 2012 年將 Go 程式語言應用於正式環境 (Production) ，發布十多個 Go 相關開源專案，為 Golang 核心專案貢獻者之一。\n曾在 Perl 最大的開放原始碼模組平台 CPAN 維護近五十個模組，至今在 GitHub 上開源約兩百多個專案。\n知名專案為 PHPBrew, Maghead (ORM), Pux, CLIFramework 以及如 C 語言開發的高效能路由函式庫 r3。\n其他曾參與貢獻的知名開源專案有 Google Go / HHVM / PHP (Zend Engine) / Jifty Perl Web Framework 等等。\n曾為 2013 年 GitHub top 1 contributions user.","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"cc72be48-0401-4c4a-8519-cab2bc456467","field2":"closing","subject":"Closing","summary":"閉幕式","type":"","room":"101","start":"2018-08-12T16:45:00+08:00","end":"2018-08-12T17:05:00+08:00","speaker":{"name":"Staff","bio":"COSCUP x GNOME.Asia x openSUSE.Asia Staff","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"be84f1b6-9ab6-499b-bb2f-a749544847b9","field2":"policy-intro","subject":"介紹開場","summary":" 1. 介紹 開放政府, PDIS。\n2. 介紹 Join。\n3. 介紹 手冊 / 攤位 / BOF/GRB。\n\n[public money, public code 的議題整理連結](http://sense.tw/map/8c1c6b87-8bf8-4360-af93-5e5c917aa780)\n\n\n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-tech/%2Fcoscup18-tech-policy-intro)","type":"","room":"308","start":"2018-08-12T09:30:00+08:00","end":"2018-08-12T10:00:00+08:00","speaker":{"name":"Hychen","bio":"Chen Hsin-Yi is the founder of TrustableAI, a research company to eusure AI is trustable with anyone who cares about computational morality.\n\nHe has a strong background in participating with open source communities and projects in Taiwan, by hosting events and contributing software patchs to different communities.","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}},{"id":"ae1ebe7d-7132-4712-99fd-d03aaf407fff","field2":"policy-sessions","subject":"議題釐清工作坊 / 維基寫作式工作坊","summary":"雙工作坊同步進行，見 https://hackmd.io/Oy5ioZhxRmiKu0b9sUQDOw","type":"","room":"308","start":"2018-08-12T10:00:00+08:00","end":"2018-08-12T12:25:00+08:00","speaker":{"name":"Hychen / 王則文","bio":"Chen Hsin-Yi is the founder of TrustableAI, a research company to eusure AI is trustable with anyone who cares about computational morality.\n\nHe has a strong background in participating with open source communities and projects in Taiwan, by hosting events and contributing software patchs to different communities.\n---\n台灣維基媒體協會現任祕書長，維基百科寫作資歷超過 10 年。","avatar":"https://coscup.org/2018-assets/img/speakers/coscup.jpg"}}]
